///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

// см. кфкОбработкаСобытийСлужебный.КлючЗаписиИсходящихСообщений
Функция КлючиЗаписейИсходящихСообщений(Данные) Экспорт
	Возврат кфкОбработкаСобытийСлужебный.КлючЗаписиИсходящихСообщений(Данные);
КонецФункции

// см. кфкИнтеграцияСлужебный.ДоступныеТопики
Функция ДоступныеТопики(Брокер) Экспорт
	Возврат кфкИнтеграцияСлужебный.ДоступныеТопики(Брокер);
КонецФункции

#КонецОбласти
