///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает ключи записей исходящих сообщений для данных.
// 
// Параметры:
//  Данные - ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийКлючЗаписи - Данные для регистрации.
// 
// Возвращаемое значение:
//  Неопределено, Массив Из Строка - Ключи записей исходящих сообщений
Функция КлючиЗаписейИсходящихСообщений(Данные) Экспорт
	Возврат кфкОбработкаСобытийСлужебный.КлючЗаписиИсходящихСообщений(Данные);
КонецФункции

#КонецОбласти
