// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает ключи записей исходящих сообщений для данных.
// 
// Параметры:
//  Данные - ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийКлючЗаписи - Данные для регистрации.
// 
// Возвращаемое значение:
//  Неопределено, Массив Из Строка - Ключи записей исходящих сообщений
Функция КлючиЗаписейИсходящихСообщений(Данные) Экспорт
	Возврат кфкОбработкаСобытийСлужебный.КлючЗаписиИсходящихСообщений(Данные);
КонецФункции

#КонецОбласти
