///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяФорма = Метаданные.Обработки.кфкПанельАдминистрирования.ОсновнаяФорма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получить параметры.
// 
// Возвращаемое значение:
//  Структура - Получить параметры:
// * ВремяSLAИсходящих - Число - ВремяSLAИсходящих
// * ВремяSLAВходящих - Число - ВремяSLAВходящих
// * ИдентификаторЧатаТГ - Строка - ИдентификаторЧатаТГ
// * ТокенБотаТГ - Строка - ТокенБотаТГ
Функция ПолучитьПараметры() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВремяSLAИсходящих", 10);
	Результат.Вставить("ВремяSLAВходящих", 10);
	
	Результат.Вставить("ИдентификаторЧатаТГ", "");
	Результат.Вставить("ТокенБотаТГ", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПараметрыКонтроляИнтеграции.ВремяSLAВходящих,
	|	кфкПараметрыКонтроляИнтеграции.ВремяSLAИсходящих,
	|	кфкПараметрыКонтроляИнтеграции.ИдентификаторЧатаТГ,
	|	кфкПараметрыКонтроляИнтеграции.ТокенБотаТГ
	|ИЗ
	|	РегистрСведений.кфкПараметрыКонтроляИнтеграции КАК кфкПараметрыКонтроляИнтеграции";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	ИначеЕсли кфкОбщегоНазначенияСлужебный.ЭтоПолноправныйПользователь() Тогда
		ОбновитьПараметры(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьПараметры(НовыеПараметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(Набор.Добавить(), НовыеПараметры);
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать();
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
