///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

﻿// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	МеткаИзмененияДата = кфкОбщегоНазначенияСлужебный.ДатаИзКомбинированнойМетки(ТекущийОбъект.МеткаИзменения);
	МеткаИзмененияСеанс = кфкОбщегоНазначенияСлужебный.НомерСеансаИзКомбинированнойМетки(
		ТекущийОбъект.МеткаИзменения);
	МеткаИзмененияНомер = кфкОбщегоНазначенияСлужебный.СчетчикИзКомбинированнойМетки(
		ТекущийОбъект.МеткаИзменения);
КонецПроцедуры

#КонецОбласти
