///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Сбросить статус ошибки.
// 
// Параметры:
//  КлючиЗаписей - Массив Из РегистрСведенийКлючЗаписи.кфкВходящиеСообщения - Ключи записей
Процедура СброситьСтатусОшибки(КлючиЗаписей) Экспорт
	
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкВходящиеСообщения); // РегистрСведенийНаборЗаписей.кфкВходящиеСообщения
	
	//@skip-check invocation-parameter-type-intersect
	Таблица = Очередь.Выгрузить(, "КлючЗаписи,ДатаЗагрузкиМС");
	
	Для Каждого КлючЗаписей Из КлючиЗаписей Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), КлючЗаписей);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС
	|ПОМЕСТИТЬ ВТКлючиЗаписей
	|ИЗ
	|	&Таблица КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВходящиеСообщения.КлючЗаписи КАК КлючЗаписи,
	|	ВходящиеСообщения.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС,
	|	ВЫБОР
	|		КОГДА ВходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое)
	|	КОНЕЦ КАК Статус,
	|	ВходящиеСообщения.Заголовки КАК Заголовки,
	|	ВходящиеСообщения.ТелоСообщения КАК ТелоСообщения,
	|	ВходящиеСообщения.Консьюмер КАК Консьюмер,
	|	ВходящиеСообщения.Топик КАК Топик,
	|	ВходящиеСообщения.Раздел КАК Раздел,
	|	ВходящиеСообщения.Смещение КАК Смещение,
	|	ВходящиеСообщения.КлючСообщения КАК КлючСообщения,
	|	ВходящиеСообщения.ДатаЗаписи КАК ДатаЗаписи,
	|	ВходящиеСообщения.ДатаЗагрузки КАК ДатаЗагрузки,
	|	ВходящиеСообщения.ДатаОбработки КАК ДатаОбработки,
	|	ВходящиеСообщения.ДлОбработкиМС КАК ДлОбработкиМС,
	|	ВходящиеСообщения.ТекстЖурнала КАК ТекстЖурнала,
	|	ВходящиеСообщения.МеткаИзмененияМС КАК МеткаИзмененияМС
	|ИЗ
	|	ВТКлючиЗаписей КАК ВТКлючиЗаписей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.кфкВходящиеСообщения КАК ВходящиеСообщения
	|		ПО ВТКлючиЗаписей.КлючЗаписи = ВходящиеСообщения.КлючЗаписи
	|		И ВТКлючиЗаписей.ДатаЗагрузкиМС = ВходящиеСообщения.ДатаЗагрузкиМС
	|ГДЕ
	|	ВходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки)";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Очередь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.МеткаИзмененияМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
	КонецЦикла;
	
	Очередь.Записать(РежимЗамещения.Обновление);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
