///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Сбросить статус ошибки.
// 
// Параметры:
//  КлючиЗаписей - Массив Из РегистрСведенийКлючЗаписи.кфкВходящиеСообщения - Ключи записей
Процедура СброситьСтатусОшибки(КлючиЗаписей) Экспорт
	
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкВходящиеСообщения); // РегистрСведенийНаборЗаписей.кфкВходящиеСообщения
	
	//@skip-check invocation-parameter-type-intersect
	Таблица = Очередь.Выгрузить(, "КлючЗаписи,ДатаЗагрузкиМС");
	
	Для Каждого КлючЗаписей Из КлючиЗаписей Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), КлючЗаписей);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	//@skip-check ql-temp-table-index
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС
	|ПОМЕСТИТЬ ВТКлючиЗаписей
	|ИЗ
	|	&Таблица КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВходящиеСообщения.КлючЗаписи КАК КлючЗаписи,
	|	ВходящиеСообщения.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС,
	|	ВЫБОР
	|		КОГДА ВходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое)
	|	КОНЕЦ КАК Статус,
	|	ВходящиеСообщения.Заголовки КАК Заголовки,
	|	ВходящиеСообщения.ТелоСообщения КАК ТелоСообщения,
	|	ВходящиеСообщения.Консьюмер КАК Консьюмер,
	|	ВходящиеСообщения.Топик КАК Топик,
	|	ВходящиеСообщения.Раздел КАК Раздел,
	|	ВходящиеСообщения.Смещение КАК Смещение,
	|	ВходящиеСообщения.КлючСообщения КАК КлючСообщения,
	|	ВходящиеСообщения.ДатаЗаписи КАК ДатаЗаписи,
	|	ВходящиеСообщения.ДатаЗагрузки КАК ДатаЗагрузки,
	|	ВходящиеСообщения.ДатаОбработки КАК ДатаОбработки,
	|	ВходящиеСообщения.ДлОбработкиМС КАК ДлОбработкиМС,
	|	ВходящиеСообщения.ТекстЖурнала КАК ТекстЖурнала,
	|	ВходящиеСообщения.КоличествоОбработок КАК КоличествоОбработок
	|ИЗ
	|	ВТКлючиЗаписей КАК ВТКлючиЗаписей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.кфкВходящиеСообщения КАК ВходящиеСообщения
	|		ПО ВТКлючиЗаписей.КлючЗаписи = ВходящиеСообщения.КлючЗаписи
	|		И ВТКлючиЗаписей.ДатаЗагрузкиМС = ВходящиеСообщения.ДатаЗагрузкиМС
	|ГДЕ
	|	ВходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки)";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Очередь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.МеткаИзмененияМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
	КонецЦикла;
	
	Очередь.Записать(РежимЗамещения.Обновление);
	
КонецПроцедуры

// Удалить сообщения.
// 
// Параметры:
//	КУдалению - Массив Из РегистрСведенийКлючЗаписи.кфкВходящиеСообщения - Список ключей записи
//			  - Структура - Описание запроса:
//					* Текст - Строка - Текст запроса
//					* Параметры - Структура - Параметры запроса
Процедура УдалитьСообщения(КУдалению) Экспорт
	
	// Создаем набор записей
	Набор = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкВходящиеСообщения);
	
	Если ТипЗнч(КУдалению) = Тип("Массив") Тогда // Если передан массив
		// Добавляем записи в набор
		Для Каждого Запись Из КУдалению Цикл
			ЗаполнитьЗначенияСвойств(Набор.Добавить(), Запись);
		КонецЦикла;
		// Удаляем записи из регистра
		Если Набор.Количество() > 0 Тогда
			Набор.Записать(РежимЗамещения.Удаление);
		КонецЕсли;
		
	Иначе
		// Создаем запрос
		Запрос = Новый Запрос;
		//@skip-check bsl-ql-hub
		Запрос.Текст = СтрЗаменить(КУдалению.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ 10000");
		Для Каждого Параметр Из КУдалению.Параметры Цикл
			Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		КонецЦикла;
		
		// Удаляем все записи из регистра по отбору
		Пока Истина Цикл
			// Выполняем запрос
			Выборка = Запрос.Выполнить().Выбрать();
			// Если записей нет, то завершаем цикл
			Если Выборка.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			// Добавляем записи в набор
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
			КонецЦикла;
			// Удаляем записи из регистра
			Набор.Записать(РежимЗамещения.Удаление);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьРегистр() Экспорт
	кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкВходящиеСообщения).Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
