// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Получить позицию.
// 
// Параметры:
//  Идентификатор - УникальныйИдентификатор - Идентификатор операции
//  Раздел - Строка - Дополнительный раздел операции
// 
// Возвращаемое значение:
//  Число - Временная метка
Функция ПолучитьПозицию(Идентификатор, Раздел = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Т.ВременнаяМетка
		|ИЗ РегистрСведений.кфкПозицииОпераций КАК Т
		|ГДЕ Т.Идентификатор = &Идентификатор И Раздел = &Раздел";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Раздел", Раздел);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка[0], 0);
	
КонецФункции

// Обновить позиции.
// 
// Параметры:
//	Идентификатор - УникальныйИдентификатор - Идентификатор операции
//	ВременнаяМетка - Число - Временная метка
//	Раздел - Строка - Дополнительный раздел операции
Процедура ОбновитьПозицию(Идентификатор, ВременнаяМетка, Раздел = "") Экспорт
	
	Набор = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкПозицииОпераций); // РегистрСведенийНаборЗаписей.кфкПозицииОпераций
	
	Набор.Отбор.Идентификатор.Установить(Идентификатор);
	Набор.Отбор.Раздел.Установить(Раздел);
	
	НоваяСтрока = Набор.Добавить();
	НоваяСтрока.Идентификатор = Идентификатор;
	НоваяСтрока.Раздел = Раздел;
	НоваяСтрока.ВременнаяМетка = ВременнаяМетка;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
