
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяМетода = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяМетода");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура ИмяМетодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяМетода = Элемент.ТекстРедактирования;
	
	Если ПустаяСтрока(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиИмени = СтрРазделить(ИмяМетода, ".");
	
	Текст = Новый Массив;
	Для Каждого Элемент Из СтрРазделить(Элементы.ИмяМетодаРасширеннаяПодсказка.Заголовок, Символы.ПС) Цикл
		Текст.Добавить(СтрШаблон("// %1", Элемент));
	КонецЦикла;
	
	Текст.Добавить(СтрШаблон(НСтр("ru = 'Функция %1(Объект, Свойства, ТекстЖурнала, Отказ) Экспорт'"), ЧастиИмени[ЧастиИмени.ВГраница()]));
	Текст.Добавить("
	|	Результат = кфкИнтеграция.ПараметрыСообщения();
	|	
	|	// TODO: Вставить содержимое обработчика
	|	
	|	// Результат.Данные - Строка, ДвоичныеДанные, Структура - Тело сообщения
	|	// Результат.Ключ - Строка - Уникальный идентификатор сообщения
	|	// Результат.Заголовки - Соответствие Из Строка - Заголовки сообщения
	|	
	|	Возврат Результат;
	|");
	Текст.Добавить(НСтр("ru = 'КонецФункции'"));
	
	КодФункции = СтрСоединить(Текст, Символы.ПС);
	
	Ждать СредстваБуфераОбмена.ПоместитьДанныеАсинх(
		Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, КодФункции));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ИмяМетода);
	
КонецПроцедуры

#КонецОбласти
