///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// инициализация нового
	Если Объект.Ссылка.Пустая() И Не Объект.РежимАсинх Тогда
		Ключи = ОбщегоНазначения.ВыгрузитьКолонку(Объект.ПараметрыПродюсера, "Ключ");
		Для Каждого ПараметрОтправки Из СтандартныеПараметрыКонсьюмера() Цикл
			Если Ключи.Найти(ПараметрОтправки.Ключ) = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Объект.ПараметрыПродюсера.Добавить(), ПараметрОтправки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// инициализация оформление формы
	УстановитьУсловноеОформление();
	
	// инициализация параметров
	СвойстваLibrdKafka = кфкИнтеграцияСлужебныйПовтИсп.СвойстваLibrdKafka("P");
	ЗаполнитьЗначенияПредставления();
	
	// формат сериализации КД
	ПространстваИмен = Новый Массив(кфкИнтеграцияСлужебныйПовтИсп.ПространстваИменПакетовXDTO());
	Элементы.ФорматСериализации.СписокВыбора.ЗагрузитьЗначения(ПространстваИмен);
	Элементы.ОбъектыМетаданныхФорматСериализации.СписокВыбора.ЗагрузитьЗначения(ПространстваИмен);
	
	// менеджер обмена КД
	ИменаОбщихМодулей = Новый Массив(кфкИнтеграцияСлужебныйПовтИсп.ПолучитьИменаОбщихМодулей());
	Элементы.ИмяМодуляСериализации.СписокВыбора.ЗагрузитьЗначения(ИменаОбщихМодулей);
	Элементы.ОбъектыМетаданныхИмяМодуляСериализации.СписокВыбора.ЗагрузитьЗначения(ИменаОбщихМодулей);
	
	// проверка доступности
	Для Каждого Элемент Из Элементы.ФормаГруппаЗапуска.ПодчиненныеЭлементы Цикл
		Элемент.Доступность = Не ТолькоПросмотр;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
	УстановитьВидимостьСериализации();
	
	// доступные топики
	кфкИнтеграцияСлужебныйКлиент.ЗаполнитьСписокВыбораТопиков(ЭтотОбъект, Элементы.ОбъектыМетаданныхИмяТопика);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ЗаполнитьСписокВыбораТопиков(ЭтотОбъект, Элементы.ОбъектыМетаданныхИмяТопика);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимАсинхПриИзменении(Элемент)
	
	ПараметрыОтправки = СтандартныеПараметрыКонсьюмера();
	
	Ключи = КлючиПараметровПродюсера();
	Для Каждого ПараметрОтправки Из ПараметрыОтправки Цикл
		Если Объект.РежимАсинх Тогда
			ВерхняяГраница = Объект.ПараметрыПродюсера.Количество() - 1;
			Для Итератор = 0 По ВерхняяГраница Цикл
				Если ПараметрыОтправки.Получить(Объект.ПараметрыПродюсера[ВерхняяГраница - Итератор].Ключ) <> Неопределено Тогда
					Объект.ПараметрыПродюсера.Удалить(ВерхняяГраница - Итератор);
				КонецЕсли;
			КонецЦикла;
		
		Иначе
			Если Ключи.Найти(ПараметрОтправки.Ключ) = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Объект.ПараметрыПродюсера.Добавить(), ПараметрОтправки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область НастройкиСериализацииПоУмолчанию

&НаКлиенте
Процедура ТипСериализацииПриИзменении(Элемент)
	
	УстановитьВидимостьСериализации();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяМетодаСериализацииПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяМетодаСериализацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.кфкПродюсеры.Форма.ФормаВводаОбработчика",
		Новый Структура("ИмяМетода", Элемент.ТекстРедактирования), ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗавершитьВводаОбработчика", ЭтотОбъект, Истина),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматСериализацииПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматСериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
		СтандартнаяОбработка)

	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ИмяМодуляСериализацииПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
	ИнициализироватьПравилаОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяМодуляСериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
		СтандартнаяОбработка)

	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыМетаданных

&НаКлиенте
Процедура ОбъектыМетаданныхПриАктивизацииСтроки(Элемент)
	
	ИнициализироватьПравилаОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если Копирование Тогда
		
		Отказ = Истина;
		
		НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.ТекущиеДанные, ,
			"НомерСтроки,ТипОбъект,ИмяТопика,ИмяПОДСериализации"); // ИмяМетодаСериализации
		
		Элементы.ОбъектыМетаданных.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элементы.ОбъектыМетаданных.ТекущийЭлемент = Элементы.ОбъектыМетаданныхТипОбъект;
		Элементы.ОбъектыМетаданных.ИзменитьСтроку();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхТипОбъектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.кфкПродюсеры.Форма.ФормаВыбораОбъектаМетаданных", , ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗавершитьВыбораОбъектаМетаданных", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхИмяТопикаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
		Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхТипСериализацииПриИзменении(Элемент)
	
	ИнициализироватьПравилаОбмена();
	
	УстановитьВидимостьСериализации();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхИмяМетодаСериализацииПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхИмяМетодаСериализацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
		СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОбъектыМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.кфкПродюсеры.Форма.ФормаВводаОбработчика",
		Новый Структура("ИмяМетода", Элемент.ТекстРедактирования), ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗавершитьВводаОбработчика", ЭтотОбъект, Ложь),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхФорматСериализацииПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхФорматСериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
		Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхИмяМодуляСериализацииПриИзменении(Элемент)
	
	ИнициализироватьПравилаОбмена();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхИмяМодуляСериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
		Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхИмяПОДСериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
		Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыПродюсера

&НаКлиенте
Процедура ПараметрыПродюсераПриАктивизацииСтроки(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование,
		Родитель, ЭтоГруппа, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераКлючПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераКлючНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора,
		ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераКлючАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
		СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора,
		ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераЗначениеПредставлениеПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПараметрыПродюсераЗначениеПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
		СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеНачалоВыбора(ЭтотОбъект, Элемент,
		ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьСериализацию(Команда)
	
	ОчиститьСообщения();
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Продюсер был изменен. Для начала сериализации сообщений сохраните настройки.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗапускДоступен() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучногоЗадания();
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьСериализациюНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершитьПоток", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПубликацию(Команда)
	
	ОчиститьСообщения();
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Продюсер был изменен. Для начала публикации сообщений сохраните настройки.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗапускДоступен() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучногоЗадания();
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьПубликациюНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершитьПоток", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеПараметрыПродюсера(Команда)
	
	Объект.ПараметрыПродюсера.Очистить();
	
	Для Каждого Параметр Из СтандартныеПараметрыКонсьюмера() Цикл
		НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
		НоваяСтрока.ЗначениеПредставление = Параметр.Значение;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#Область Блокировка

&НаКлиенте
Процедура БлокироватьРегистрацию(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьРегистрацию = Не Объект.БлокироватьРегистрацию;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура БлокироватьСериализацию(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьСериализацию = Не Объект.БлокироватьСериализацию;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура БлокироватьПубликацию(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьПубликацию = Не Объект.БлокироватьПубликацию;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ФормаГруппаБлокировка.Доступность = Не Объект.Ссылка.Пустая();
	Элементы.ФормаБлокироватьРегистрацию.Пометка = Объект.БлокироватьРегистрацию;
	Элементы.ФормаБлокироватьСериализацию.Пометка = Объект.БлокироватьСериализацию;
	Элементы.ФормаБлокироватьПубликацию.Пометка = Объект.БлокироватьПубликацию;
	
	Элементы.ГруппаДекорацияБлокироватьРегистрацию.Видимость = Объект.БлокироватьРегистрацию;
	Элементы.ГруппаДекорацияБлокироватьСериализацию.Видимость = Объект.БлокироватьСериализацию;
	Элементы.ГруппаДекорацияБлокироватьПубликацию.Видимость = Объект.БлокироватьПубликацию;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСериализации()
	
	// НастройкиПоУмолчанию
	ТипСериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.ПустаяСсылка");
	Строки = Объект.ОбъектыМетаданных.НайтиСтроки(Новый Структура("ТипСериализации", ТипСериализации));
	ИспользуетсяНастройкаПоУмолчанию = Объект.ОбъектыМетаданных.Количество() = 0 Или Строки.Количество() > 0;
	
	// ПроизвольныйОбработчик
	ТипСериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.ПроизвольныйОбработчик");
	Строки = Объект.ОбъектыМетаданных.НайтиСтроки(Новый Структура("ТипСериализации", ТипСериализации));
	Элементы.ОбъектыМетаданныхИмяМетодаСериализации.Видимость = Строки.Количество() > 0
		Или ИспользуетсяНастройкаПоУмолчанию И ТипСериализации = Объект.ТипСериализации;
	
	// КонвертацияДанных
	ТипСериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.КонвертацияДанных");
	Строки = Объект.ОбъектыМетаданных.НайтиСтроки(Новый Структура("ТипСериализации", ТипСериализации));
	Элементы.ОбъектыМетаданныхГруппаСериализацияКД.Видимость = Строки.Количество() > 0
		Или ИспользуетсяНастройкаПоУмолчанию И ТипСериализации = Объект.ТипСериализации;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПоток(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Возникла ошибка при завершении потока.'"));
		КонецЕсли;
		
		Возврат;
		 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыбораОбъектаМетаданных(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ОбъектыМетаданных.ТекущиеДанные;
	
	Строки = Объект.ОбъектыМетаданных.НайтиСтроки(Новый Структура("ТипОбъект", РезультатЗакрытия));
	Для Каждого Строка Из Строки Цикл
		//@skip-check bsl-legacy-check-dynamic-feature-access
		Если ТекущиеДанные.НомерСтроки <> Строка.НомерСтроки Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ТекущиеДанные.ТипОбъект = РезультатЗакрытия;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводаОбработчика(РезультатЗакрытия, ЭтоПоУмолчанию) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоПоУмолчанию Тогда
		Объект.ИмяМетодаСериализации = РезультатЗакрытия;
		
	Иначе
		ТекущиеДанные = Элементы.ОбъектыМетаданных.ТекущиеДанные;
		ТекущиеДанные.ИмяМетодаСериализации = РезультатЗакрытия;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Функция КлючиПараметровПродюсера()
	
	Результат = Новый Массив;
	Для Каждого ПараметрОтправки Из Объект.ПараметрыПродюсера Цикл
		Результат.Добавить(ПараметрОтправки.Ключ);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьПравилаОбмена()
	
	ОчиститьСообщения();
	
	СписокВыбора = Элементы.ОбъектыМетаданныхИмяПОДСериализации.СписокВыбора;
	СписокВыбора.Очистить();
	
	ТекущиеДанные = Элементы.ОбъектыМетаданных.ТекущиеДанные;
	
	ИмяМодуляСериализации = ?(ТекущиеДанные = Неопределено Или ПустаяСтрока(ТекущиеДанные.ИмяМодуляСериализации),
		Объект.ИмяМодуляСериализации, ТекущиеДанные.ИмяМодуляСериализации);
	Если ПустаяСтрока(ИмяМодуляСериализации) Тогда
		Возврат;
	КонецЕсли;
	
	КлючПравилОбмена = ИмяМодуляСериализации;
	ПОДы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПравилаОбработкиДанных, КлючПравилОбмена); // Неопределено, Массив
	Если ПОДы = Неопределено Тогда
		
		ПОДы = ДоступныеПОДы(ИмяМодуляСериализации); // Неопределено, Массив
		
		Правила = ?(ПравилаОбработкиДанных = Неопределено, Новый Структура, Новый Структура(ПравилаОбработкиДанных));
		Правила.Вставить(КлючПравилОбмена, ПОДы);
		ПравилаОбработкиДанных = Новый ФиксированнаяСтруктура(Правила);
		
	КонецЕсли;
	Если ТипЗнч(ПОДы) = Тип("Массив") Тогда
		СписокВыбора.ЗагрузитьЗначения(ПОДы);
		Возврат;
	КонецЕсли;
	
	ТипСериализации = ?(ТекущиеДанные = Неопределено Или ТекущиеДанные.ТипСериализации.Пустая(),
		Объект.ТипСериализации, ТекущиеДанные.ТипСериализации);
	Если ТекущиеДанные <> Неопределено
			И ТипСериализации  = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.КонвертацияДанных") Тогда
		//@skip-check bsl-legacy-check-dynamic-feature-access
		НомерСтроки = ТекущиеДанные.НомерСтроки;
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
			НСтр("ru = 'Имя модуля'"), НомерСтроки, НСтр("ru = 'Объекты метаданных'"),
			СтрШаблон(НСтр("ru = '''%1'' - не найден'"), ИмяМодуляСериализации));
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОбъектыМетаданных", НомерСтроки,
			"ИмяМодуляСериализации");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , Поле, "Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтандартныеПараметрыКонсьюмера()
	
//	см. Обработка.кфкИнтеграция.ОтправитьСообщение()
	
	Результат = Новый Соответствие;
	Результат.Вставить("message.timeout.ms", 5000); // с этим параметром поакуратнее	
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапускДоступен()
	Возврат Не ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции");
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьСериализациюНаСервере(Знач Продюсер, Знач Идентификатор)
	Возврат кфкФоновыеОперацииСлужебный.ЗапуститьПотокИнтерактивно(Продюсер, Истина, Идентификатор);
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьПубликациюНаСервере(Знач Продюсер, Знач Идентификатор)
	Возврат кфкФоновыеОперацииСлужебный.ЗапуститьПотокИнтерактивно(Продюсер, Ложь, Идентификатор);
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеПОДы(Знач МенеджерОбмена)
	
	Если Метаданные.ОбщиеМодули.Найти(МенеджерОбмена) = Неопределено Тогда
		Возврат МенеджерОбмена;
	КонецЕсли;
	
	КомпонентыОбмена = кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Отправка");
	КомпонентыОбмена.МенеджерОбмена = ОбщегоНазначения.ОбщийМодуль(МенеджерОбмена);
	ПОДы = кфкОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных(КомпонентыОбмена);
	
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(ПОДы, "Имя");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗначенияПредставления()
	
	Если СвойстваLibrdKafka = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Объект.ПараметрыПродюсера Цикл // ТекущийОбъект
		
		Свойство = СвойстваLibrdKafka.Получить(Строка.Ключ); // см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
		ТипЗначения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойство, "ТипЗначения");
		Строка.ЗначениеПредставление = ?(ТипЗначения = "int" Или ТипЗначения = "float",
			СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.Значение), Строка.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// ПроизвольныйОбработчик
	Элемент = УсловноеОформление.Элементы.Добавить();
	//	* Оформление
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	//	* Поля
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
		Элементы.ОбъектыМетаданныхИмяМетодаСериализации.Имя);
	//	* Отбор/Группа
	// НЕ ПроизвольныйОбработчик:
	//		НЕ (
	//			Строка.ТипСериализации=ПроизвольныйОбработчик
	//			ИЛИ (Строка.ТипСериализации=ПустаяСсылка И ТипСериализации=ПроизвольныйОбработчик)
	//		)
	ГруппаИсключение = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор, "Исключение",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе);
	Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаИсключение, "Условие",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	//	* Отбор/Элементы: Строка.ТипСериализации=ПроизвольныйОбработчик
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Объект.ОбъектыМетаданных.ТипСериализации",
		Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик);
	//	* Отбор/Элементы: Строка.ТипСериализации=ПустаяСсылка И ТипСериализации=ПроизвольныйОбработчик
	ГруппаПоУмолчанию = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Группа, "ПоУмолчанию",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию,
		"Объект.ОбъектыМетаданных.ТипСериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию, "Объект.ТипСериализации",
		Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик);
	
	// КонвертацияДанных
	Элемент = УсловноеОформление.Элементы.Добавить();
	//	* Оформление
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	//	* Поля
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
		Элементы.ОбъектыМетаданныхФорматСериализации.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
		Элементы.ОбъектыМетаданныхИмяМодуляСериализации.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
		Элементы.ОбъектыМетаданныхИмяПОДСериализации.Имя);
	//	* Отбор/Группа
	// НЕ КонвертацияДанных:
	//		НЕ (
	//			Строка.ТипСериализации=КонвертацияДанных
	//			ИЛИ (Строка.ТипСериализации=ПустаяСсылка И ТипСериализации=КонвертацияДанных)
	//		)
	ГруппаИсключение = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор, "Исключение",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе);
	Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаИсключение, "Условие",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	//	* Отбор/Элементы: Строка.ТипСериализации=КонвертацияДанных
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Объект.ОбъектыМетаданных.ТипСериализации",
		Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
	//	* Отбор/Элементы: Строка.ТипСериализации=ПустаяСсылка И ТипСериализации=КонвертацияДанных
	ГруппаПоУмолчанию = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Группа, "ПоУмолчанию",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию,
		"Объект.ОбъектыМетаданных.ТипСериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию, "Объект.ТипСериализации",
		Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
	
	// НастройкиПоУмолчанию
	//  * ТипСериализации
	Если Не Объект.ТипСериализации.Пустая() Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		//	* Оформление
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Объект.ТипСериализации);
		//	* Поля
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
			Элементы.ОбъектыМетаданныхТипСериализации.Имя);
		//	* Отбор
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.ОбъектыМетаданных.ТипСериализации", ,
			ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	//  * ИмяМетодаСериализации
	Если Не ПустаяСтрока(Объект.ИмяМетодаСериализации) Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		//	* Оформление
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Объект.ИмяМетодаСериализации);
		//	* Поля
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
			Элементы.ОбъектыМетаданныхИмяМетодаСериализации.Имя);
		//	* Отбор/ПроизвольныйОбработчик
		// ПроизвольныйОбработчик:
		//		Строка.ТипСериализации=ПроизвольныйОбработчик
		//		ИЛИ (Строка.ТипСериализации=ПустаяСсылка И ТипСериализации=ПроизвольныйОбработчик)
		Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор, "Условие",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		//	* Отбор/ПроизвольныйОбработчик: Строка.ТипСериализации=ПроизвольныйОбработчик
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Объект.ОбъектыМетаданных.ТипСериализации",
			Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик);
		//	* Отбор/ПроизвольныйОбработчик: Строка.ТипСериализации=ПустаяСсылка И ТипСериализации=ПроизвольныйОбработчик
		ГруппаПоУмолчанию = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Группа, "ПоУмолчанию",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию,
			"Объект.ОбъектыМетаданных.ТипСериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию, "Объект.ТипСериализации",
			Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик);
		//	* Отбор/ИмяМетодаСериализации
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"Объект.ОбъектыМетаданных.ИмяМетодаСериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	//  * ИмяМодуляСериализации
	Если Не ПустаяСтрока(Объект.ИмяМодуляСериализации) Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		//	* Оформление
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Объект.ИмяМодуляСериализации);
		//	* Поля
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
			Элементы.ОбъектыМетаданныхИмяМодуляСериализации.Имя);
		//	* Отбор/КонвертацияДанных
		// КонвертацияДанных:
		//		Строка.ТипСериализации=КонвертацияДанных
		//		ИЛИ (Строка.ТипСериализации=ПустаяСсылка И ТипСериализации=КонвертацияДанных)
		Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор, "Условие",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		//	* Отбор/КонвертацияДанных: Строка.ТипСериализации=КонвертацияДанных
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Объект.ОбъектыМетаданных.ТипСериализации",
			Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
		//	* Отбор/КонвертацияДанных: Строка.ТипСериализации=ПустаяСсылка И ТипСериализации=КонвертацияДанных
		ГруппаПоУмолчанию = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Группа, "ПоУмолчанию",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию,
			"Объект.ОбъектыМетаданных.ТипСериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию, "Объект.ТипСериализации",
			Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
		//	* Отбор/ИмяМодуляСериализации
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"Объект.ОбъектыМетаданных.ИмяМодуляСериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	//  * ФорматСериализации
	Если Не ПустаяСтрока(Объект.ФорматСериализации) Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		//	* Оформление
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Объект.ФорматСериализации);
		//	* Поля
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
			Элементы.ОбъектыМетаданныхФорматСериализации.Имя);
		//	* Отбор/КонвертацияДанных
		// КонвертацияДанных:
		//		Строка.ТипСериализации=КонвертацияДанных
		//		ИЛИ (Строка.ТипСериализации=ПустаяСсылка И ТипСериализации=КонвертацияДанных)
		Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор, "Условие",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		//	* Отбор/КонвертацияДанных: Строка.ТипСериализации=КонвертацияДанных
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Объект.ОбъектыМетаданных.ТипСериализации",
			Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
		//	* Отбор/КонвертацияДанных: Строка.ТипСериализации=ПустаяСсылка И ТипСериализации=КонвертацияДанных
		ГруппаПоУмолчанию = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Группа, "ПоУмолчанию",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию,
			"Объект.ОбъектыМетаданных.ТипСериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию, "Объект.ТипСериализации",
			Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
		//	* Отбор/ФорматСериализации
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"Объект.ОбъектыМетаданных.ФорматСериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
