
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьОбъектыМетаданных();
	
	ПолучитьОбъектСсылочногоТипа = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПродюсерПриИзменении(Элемент)
	
	ЗаполнитьОбъектыМетаданных();
	
	Для Каждого Строка Из ОбъектыМетаданных.ПолучитьЭлементы() Цикл
		Элементы.ОбъектыМетаданных.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыМетаданных

&НаКлиенте
Процедура ОбъектыМетаданныхПриАктивизацииСтроки(Элемент)
	
	Заголовок = "";
	АвтоЗаголовок = Истина;
	Элементы.ГруппаОтбор.Доступность = Ложь;
	
	ТекущиеДанные = Элементы.ОбъектыМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//@skip-check property-return-type
	ИмяОбъекта = ТекущиеДанные.ПолноеИмя; // Строка
	Если ПустаяСтрока(ИмяОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = СтрШаблон(НСтр("ru = 'Регистрация в Kafka: %1'"), ТекущиеДанные.Синоним);
	АвтоЗаголовок = Ложь;
	Элементы.ГруппаОтбор.Доступность = Истина;
	
	ОбновитьСписок(ИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьДанные(Команда)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.ОбъектыМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗарегистрироватьДанныеНаСервере();
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = СтрШаблон(НСтр("ru = 'Регистрация ''%1'''"), ТекущиеДанные.Синоним);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершитьРегистрацию", ЭтотОбъект),
		ПараметрыОжидания);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершитьРегистрацию(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить проверку подключения к брокеру.'"));
		КонецЕсли;
		
		Возврат;
		 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныеОбъектыМетаданных(Продюсер)
	
	Результат = Новый Массив; // Массив Из ОбъектМетаданных
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.ТипОбъект КАК ПолноеИмя
		|ИЗ
		|	Справочник.кфкПродюсеры.ОбъектыМетаданных КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка";
	Если Не ЗначениеЗаполнено(Продюсер) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Таблица.Ссылка = &Ссылка", "ИСТИНА");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Продюсер);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//@skip-check property-return-type
		ПолноеИмя = Выборка.ПолноеИмя; // Строка
		Если СтрЧислоВхождений(ПолноеИмя, ".") = 1 Тогда
			ОбъектМД = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ПолноеИмя);
			Если ОбъектМД <> Неопределено Тогда
				Результат.Добавить(ОбъектМД);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОбъектыМетаданных()
	
	ДоступныеОбъектыМД = ДоступныеОбъектыМетаданных(Продюсер);
	
	Строки = ОбъектыМетаданных.ПолучитьЭлементы();
	Строки.Очистить();

	// ССЫЛОЧНЫЕ ТИПЫ
	ДобавитьОбъектыМетаданных(Строки, Метаданные.ПланыОбмена,
		НСтр("ru = 'ПланыОбмена'"), НСтр("ru = 'Планы обмена'"),
		ДоступныеОбъектыМД,
		БиблиотекаКартинок.ПланОбмена);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.Справочники,
		НСтр("ru = 'Справочники'"), НСтр("ru = 'Справочники'"),
		ДоступныеОбъектыМД,
		БиблиотекаКартинок.Справочник);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.Документы,
		НСтр("ru = 'Документы'"), НСтр("ru = 'Документы'"),
		ДоступныеОбъектыМД,
		БиблиотекаКартинок.Документ);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.ПланыВидовХарактеристик,
		НСтр("ru = 'ПланыВидовХарактеристик'"), НСтр("ru = 'Планы видов характеристик'"),
		ДоступныеОбъектыМД,
		БиблиотекаКартинок.ПланВидовХарактеристик);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.ПланыСчетов,
		НСтр("ru = 'ПланыСчетов'"), НСтр("ru = 'Планы счетов'"),
		ДоступныеОбъектыМД,
		БиблиотекаКартинок.ПланСчетов);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.ПланыВидовРасчета,
		НСтр("ru = 'ПланыВидовРасчета'"), НСтр("ru = 'Планы видов расчета'"),
		ДоступныеОбъектыМД,
		БиблиотекаКартинок.ПланВидовРасчета);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.БизнесПроцессы,
		НСтр("ru = 'БизнесПроцессы'"), НСтр("ru = 'Бизнес процессы'"),
		ДоступныеОбъектыМД,
		БиблиотекаКартинок.БизнесПроцесс);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.Задачи,
		НСтр("ru = 'Задачи'"), НСтр("ru = 'Задачи'"),
		ДоступныеОбъектыМД,
		БиблиотекаКартинок.Задача);
	
	// РЕГИСТРЫ
	ДобавитьОбъектыМетаданных(Строки, Метаданные.РегистрыСведений,
		НСтр("ru = 'РегистрыСведений'"), НСтр("ru = 'Регистры сведений'"),
		ДоступныеОбъектыМД,
		БиблиотекаКартинок.РегистрСведений);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбъектыМетаданных(Дерево, КлассОМ, Имя, Синоним, ОтборМД, Картинка)
	
	Если Не КлассОМ.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Строки = Неопределено;
	
	Для Каждого ЭлементМД Из ОтборМД Цикл
		Если Не КлассОМ.Содержит(ЭлементМД) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строки = Неопределено Тогда // инициализация группы при необходимости
			НоваяСтрока = Дерево.Добавить();
			НоваяСтрока.Имя = Имя;
			НоваяСтрока.Синоним = Синоним;
			НоваяСтрока.Картинка = Картинка;
			Строки = НоваяСтрока.ПолучитьЭлементы();
		КонецЕсли;
		
		НоваяСтрока = Строки.Добавить();
		НоваяСтрока.ПолноеИмя = ЭлементМД.ПолноеИмя();
		НоваяСтрока.Имя = ЭлементМД.Имя;
		НоваяСтрока.Синоним = ЭлементМД.Синоним;
		НоваяСтрока.Картинка = Картинка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок(ИмяОбъекта)
	
	Если Список.ОсновнаяТаблица = ИмяОбъекта Тогда
		Возврат;
	КонецЕсли;
	
	Список.Отбор.Элементы.Очистить();
	Список.Порядок.Элементы.Очистить();
	Список.УсловноеОформление.Элементы.Очистить();
	Список.ОсновнаяТаблица = ИмяОбъекта;
	Для Каждого Элемент Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл 
		Если ТипЗнч(Элемент) = Тип("ОтборКомпоновкиДанных") Или ТипЗнч(Элемент) = Тип("ПорядокКомпоновкиДанных")
				Или ТипЗнч(Элемент) = Тип("УсловноеОформлениеКомпоновкиДанных") Тогда 
			Элемент.Элементы.Очистить();
		КонецЕсли;
	КонецЦикла;
	
	КУдалению = Новый Массив; // Массив Из ПолеФормы 
	Для Каждого Элемент Из Элементы.Список.ПодчиненныеЭлементы Цикл 
		КУдалению.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из КУдалению Цикл 
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	Поля = Список.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы;
	Для Каждого ЭлементКД Из Поля Цикл
		ИмяПоля = Строка(ЭлементКД.Поле);
		Если Не ТипЗнч(ЭлементКД) = Тип("ДоступноеПолеКомпоновкиДанных")
			Или ЭлементКД.Таблица = Истина
			Или ИмяПоля = "Представление"
			Или ИмяПоля = "Ссылка" Или ИмяПоля = "ВерсияДанных" Или ИмяПоля = "МоментВремени"
			Или ИмяПоля = "ИмяПредопределенныхДанных" Или ИмяПоля = "Предопределенный"
			Или ЭлементКД.ТипЗначения.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			Продолжить;
		КонецЕсли;
		Элемент = Элементы.Добавить("Список" + ИмяПоля, Тип("ПолеФормы"), Элементы.Список);
		Элемент.ПутьКДанным = "Список." + ИмяПоля;
		Элемент.Вид = ?(ЭлементКД.ТипЗначения.СодержитТип(Тип("Булево")) И ЭлементКД.ТипЗначения.Типы().Количество() = 1, 
			ВидПоляФормы.ПолеФлажка, ВидПоляФормы.ПолеВвода);
	КонецЦикла; 
	
	Элементы.ПолучитьОбъектСсылочногоТипа.Доступность = Не Поля.Найти("Ссылка") = Неопределено;
	
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьДанныеНаСервере()
	
	ОбъектМД = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(Список.ОсновнаяТаблица);
	Если ОбъектМД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтоРегистр = ОбщегоНазначения.ЭтоРегистр(ОбъектМД);
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКД = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	НастройкиКД.Структура.Очистить();
	ГруппировкаКД = НастройкиКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Если ЭтоРегистр Тогда
		Для Каждого Элемент Из НастройкиКД.ДоступныеПоляВыбора.Элементы Цикл
			Поле = ГруппировкаКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Поле = Элемент.Поле;
		КонецЦикла;
		
	Иначе
		Поле = ГруппировкаКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		Поле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикМакета.Выполнить(Схема, НастройкиКД);
	
	ПараметрыЗапроса = Новый Структура;
	Для Каждого Параметр Из МакетКД.ЗначенияПараметров Цикл
		ПараметрыЗапроса.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;
	
	Запрос = Новый Структура;
	Запрос.Вставить("Текст", МакетКД.НаборыДанных[0].Запрос);
	Запрос.Вставить("Параметры", ПараметрыЗапроса);
	
	Если ЭтоРегистр Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(
			ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор),
			"Обработки.кфкРегистрацияИзменений.ВыполнитьРегистрациюРегистра",
			Запрос, Продюсер, ОбъектМД.ПолноеИмя());
			
	Иначе
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(
			ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор),
			"Обработки.кфкРегистрацияИзменений.ВыполнитьРегистрациюСсылочногоТипа",
			Запрос, Продюсер, ПолучитьОбъектСсылочногоТипа);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
