// @strict-types

#Область ПрограммныйИнтерфейс

// Открывает форму очереди исходящих сообщений с отбором по объекту.
// 
// Параметры:
//	Данные - ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийКлючЗаписи - Данные для регистрации.
//	Форма - ФормаКлиентскогоПриложения - Форма владельца
//	Окно - ОкноКлиентскогоПриложения - Окно приложения, в котором будет открыта форма.
//	РежимОткрытияОкна - РежимОткрытияОкнаФормы - Режим открытия окна формы.
//
Процедура ИсторияВыгрузкиОбъекта(Данные, Форма = Неопределено, Окно = Неопределено, РежимОткрытияОкна = Неопределено) Экспорт
	
	КлючиЗаписей = кфкИнтеграцияСлужебныйВызовСервера.КлючиЗаписейИсходящихСообщений(Данные);
	Если КлючиЗаписей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимОткрытияОкна = Неопределено Тогда
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("КлючЗаписи", КлючиЗаписей));
	ОткрытьФорму("РегистрСведений.кфкИсходящиеСообщения.ФормаСписка", ПараметрыФормы, Форма, Данные, Окно, , ,
		РежимОткрытияОкна);
	
КонецПроцедуры

#КонецОбласти
