///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	кфкИспользоватьПотоковыйРежим.Значение КАК ИспользоватьПотоковыйРежим
		|ИЗ
		|	Константа.кфкИспользоватьПотоковыйРежим КАК кфкИспользоватьПотоковыйРежим";	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	УстановитьУсловноеОформление();
	
	Элементы.КомандыУправлениеФЗ.Доступность = кфкОбщегоНазначенияСлужебный.ЭтоПолноправныйПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПрочитатьКЭШ();
	
	ОбновитьФоновыеЗадания();
	 
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнтервалАвтообновленияПриИзменении(Элемент)
	
	ОбновитьКЭШ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Навигация

&НаКлиенте
Процедура ПерейтиОсновное(Команда)
	ВладелецФормы.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиРегламентноеЗадание(Команда)
	ОткрытьСтраницу("РегламентноеЗадание");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиОчереди(Команда)
	ОткрытьСтраницу("Очереди");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиЛогирование(Команда)
	ОткрытьСтраницу("Логирование");
КонецПроцедуры

#КонецОбласти

#Область ФоновыеЗадания

&НаКлиенте
Процедура Запустить(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Интерактивный запуск интеграции с Kafka'");
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ЗапуститьПотокиНаСервере(),
		Новый ОписаниеОповещения("ЗавершитьЗапускФЗ", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура Перезапустить(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Перезапуск интеграции с Kafka'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ПерезапуститьПотокиНаСервере(),
		Новый ОписаниеОповещения("ЗавершитьПерезапускФЗ", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура Разблокировать(Команда)
	
	//@skip-check property-return-type
	ВладелецФормы.БлокировкаИнтеграции = Ложь;
	УстановитьБлокировкаИнтеграции(Ложь);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Заблокировать(Команда)
	
	//@skip-check property-return-type
	ВладелецФормы.БлокировкаИнтеграции = Истина;
	УстановитьБлокировкаИнтеграции(Истина);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПотоковыйРежим(Команда)
	
	ИспользоватьПотоковыйРежим = Не ИспользоватьПотоковыйРежим;
	УстановитьИспользоватьПотоковыйРежим(ИспользоватьПотоковыйРежим);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьФоновыеЗадания();
	
	УстановитьВидимостьДоступность();
		
КонецПроцедуры

&НаКлиенте
Процедура Автообновление(Команда)
	
	РежимАвтообновления = Не РежимАвтообновления;
	
	УстановитьВидимостьДоступность();
	
	Если РежимАвтообновления Тогда
		ОбновитьФоновыеЗадания();
	КонецЕсли;
	
	ОбновитьКЭШ();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	//@skip-check dynamic-access-method-not-found
	ВладелецФормы.УстановитьВидимостьДоступность();
	
	// НАВИГАЦИЯ
	Элементы.ПерейтиФоновыеЗаданияСтатус.Картинка = ВладелецФормы.Элементы.ПерейтиФоновыеЗадания.Картинка;
	Элементы.ПерейтиРегламентноеЗадание.Картинка = ВладелецФормы.Элементы.ПерейтиРегламентноеЗадание.Картинка;
	
	// ФОНОВЫЕ ЗАДАНИЯ
	//@skip-check property-return-type
	БлокировкаИнтеграции = ВладелецФормы.БлокировкаИнтеграции; // Булево
	Элементы.Запустить.Доступность = Не (БлокировкаИнтеграции Или ЕстьФоновыеЗадания);
	Элементы.Перезапустить.Доступность = Не БлокировкаИнтеграции И ЕстьФоновыеЗадания;
	Элементы.Разблокировать.Видимость = БлокировкаИнтеграции;
	Элементы.Заблокировать.Видимость = Не БлокировкаИнтеграции;
	Элементы.ПотоковыйРежим.Доступность = Не БлокировкаИнтеграции;
	Элементы.ПотоковыйРежим.Пометка = ИспользоватьПотоковыйРежим;
	Элементы.Обновить.Доступность = Не (РежимАвтообновления Или ОбновлениеОжидаетОтвета);
	Элементы.Автообновление.Пометка = РежимАвтообновления;
	Элементы.ИнтервалАвтообновления.Доступность = РежимАвтообновления;
	
КонецПроцедуры

#Область Навигация

&НаКлиенте
Процедура ОткрытьСтраницу(ИмяСтраницы)
	
	ОткрытьФорму("Обработка.кфкПанельАдминистрирования.Форма." + ИмяСтраницы, , ВладелецФормы, , ВладелецФормы.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область ФоновыеЗадания

&НаКлиенте
Процедура ОбновитьФоновыеЗадания() Экспорт
	
	Если ОбновлениеОжидаетОтвета Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеОжидаетОтвета = Истина;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ОбновитьФоновыеЗаданияНаСервере(УникальныйИдентификатор),
		Новый ОписаниеОповещения("ЗавершитьОбновлениеФоновыхЗаданий", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

// Завершить обновление фоновых заданий.
// 
// Параметры:
//	Результат - Структура - Результат:
//		* Статус - Строка - Статус
//		* АдресРезультата - Строка - Адрес результата
//		* ИнформацияОбОшибке - ИнформацияОбОшибке - Информация об ошибке
//		* ПодробноеПредставлениеОшибки - Строка - Подробное представление ошибки
//		* КраткоеПредставлениеОшибки - Строка - Краткое представление ошибки
//	ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ЗавершитьОбновлениеФоновыхЗаданий(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновлениеОжидаетОтвета = Ложь;
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить проверку подключения к брокеру.'"));
		КонецЕсли;
		
		Возврат;
		 
	КонецЕсли;
	
	Дерево = ФоновыеЗадания.ПолучитьЭлементы();
	Дерево.Очистить();
	
	ЕстьФоновыеЗадания = Ложь;
	
	Если ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		
		АктивныеФоновыеЗадания = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ЗаполнитьАктивныеФоновыеЗадания(Дерево, АктивныеФоновыеЗадания);
		
		ОбновитьОтображениеДанных(Элементы.ФоновыеЗадания);
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
	Если РежимАвтообновления Тогда
		ПодключитьОбработчикОжидания("ОбновитьФоновыеЗадания", ИнтервалАвтообновления, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Завершить запуск ФЗ.
// 
// Параметры:
//	Результат - Структура - Результат:
//		* Статус - Строка - Статус
//		* ИнформацияОбОшибке - ИнформацияОбОшибке - Информация об ошибке
//		* ПодробноеПредставлениеОшибки - Строка - Подробное представление ошибки
//		* КраткоеПредставлениеОшибки - Строка - Краткое представление ошибки
//	ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ЗавершитьЗапускФЗ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить проверку подключения к брокеру.'"));
		КонецЕсли;
		
		Возврат;
		 
	КонецЕсли;
	
КонецПроцедуры

// Завершить перезапуск ФЗ.
// 
// Параметры:
//	Результат - Структура - Результат:
//		* Статус - Строка - Статус
//		* ИнформацияОбОшибке - ИнформацияОбОшибке - Информация об ошибке
//		* ПодробноеПредставлениеОшибки - Строка - Подробное представление ошибки
//		* КраткоеПредставлениеОшибки - Строка - Краткое представление ошибки
//	ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ЗавершитьПерезапускФЗ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		УстановитьБлокировкаИнтеграции(Ложь);
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить проверку подключения к брокеру.'"));
		КонецЕсли;
		
		Возврат;
		 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАктивныеФоновыеЗадания(Дерево, АктивныеЗадания)
	
	Для Каждого Задание Из АктивныеЗадания Цикл // Массив Из Структура
		
		НоваяСтрока = Дерево.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Задание);
		НоваяСтрока.Картинка = КартинкаСостоянияФЗ(НоваяСтрока.Состояние);
		
		ЕстьФоновыеЗадания = ЕстьФоновыеЗадания Или НоваяСтрока.Состояние = "Активно";
		
		//@skip-check property-return-type
		ЗаполнитьАктивныеФоновыеЗадания(НоваяСтрока.ПолучитьЭлементы(), Задание.ВложенныеПотоки);
		Элементы.ФоновыеЗадания.Развернуть(НоваяСтрока.ПолучитьИдентификатор(), Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция КартинкаСостоянияФЗ(Состояние)
	
	Если Состояние = "Ошибка" Тогда
		Возврат БиблиотекаКартинок.ОформлениеКругКрасный;
		
	ИначеЕсли Состояние = "Активно" Тогда
		Возврат БиблиотекаКартинок.ОформлениеКругЗеленый;
		
	Иначе
		Возврат БиблиотекаКартинок.ОформлениеКругПустой;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьКЭШ()
	
	КэшФЗ = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ВладелецФормы, "КэшФЗ"); // ФиксированнаяСтруктура
	Если КэшФЗ = Неопределено Тогда
		РежимАвтообновления = Истина;
		ИнтервалАвтообновления = 15;
		
		ОбновитьКЭШ();
		
	Иначе
		//@skip-check statement-type-change
		РежимАвтообновления = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КэшФЗ, "РежимАвтообновления", Истина); // Булево
		//@skip-check statement-type-change
		ИнтервалАвтообновления = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КэшФЗ, "ИнтервалАвтообновления", 15); // Число
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКЭШ()
	
	КэшФЗ = Новый Структура;
	КэшФЗ.Вставить("РежимАвтообновления", РежимАвтообновления);
	КэшФЗ.Вставить("ИнтервалАвтообновления", ИнтервалАвтообновления);
	
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(ВладелецФормы, "КэшФЗ", Новый ФиксированнаяСтруктура(КэшФЗ));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьБлокировкаИнтеграции(Значение)
	
	Константы.кфкБлокировкаИнтеграции.Установить(Значение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьИспользоватьПотоковыйРежим(Значение)
	
	Константы.кфкИспользоватьПотоковыйРежим.Установить(Значение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьФоновыеЗаданияНаСервере(Идентификатор)
	Возврат ДлительныеОперации.ВыполнитьФункцию(Идентификатор, "Обработки.кфкПанельАдминистрирования.ФоновыеЗадания");
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьПотокиНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Интерактивный запуск интеграции с Kafka'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "кфкФоновыеОперацииСлужебный.ЗапуститьПотоки");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПерезапуститьПотокиНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Перезапуск интеграции с Kafka'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "Обработки.кфкПанельАдминистрирования.ПерезапуститьФЗ");
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ДобавитьУсловноеОформлениеФЗ("Ошибка", WebЦвета.ТемноКрасный);
	ДобавитьУсловноеОформлениеФЗ("Завершено", WebЦвета.НейтральноСерый);
	ДобавитьУсловноеОформлениеФЗ("Отменено", WebЦвета.НейтральноСерый);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеФЗ(Состояние, ЦветТекста)
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ФоновыеЗадания.Имя);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФоновыеЗадания.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Состояние;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
