///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

Процедура СообщениеНедоступностиРучнойОбработки() Экспорт

	//@skip-check new-font
	ПоказатьПредупреждение(, Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока(НСтр("ru = 'Для ручной обработки требуется:'"), Новый Шрифт(,, Истина)), Символы.ПС,
		Новый ФорматированнаяСтрока(НСтр("ru = '   - Заблокировать задания или выключить регламент'")), Символы.ПС,
		Новый ФорматированнаяСтрока(НСтр("ru = '   - Дождаться остановки фоновых заданий'")), Символы.ПС,
		Символы.ПС,
		Новый ФорматированнаяСтрока(НСтр("ru = 'см. Kafka/Администрирование'"), , , ,
			"e1cib/command/Обработка.кфкПанельАдминистрирования.Команда.ФоновыеЗадания")));
	
КонецПроцедуры

Процедура СообщениеНедоступностиРучногоЗадания() Экспорт

	//@skip-check new-font
	ПоказатьПредупреждение(, Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока(НСтр("ru = 'Для ручного запуска требуется:'"), Новый Шрифт(,, Истина)), Символы.ПС,
		Новый ФорматированнаяСтрока(НСтр("ru = '   - Разблокировать фоновые задания'")), Символы.ПС,
		Символы.ПС,
		Новый ФорматированнаяСтрока(НСтр("ru = 'см. Kafka/Администрирование'"), , , ,
			"e1cib/command/Обработка.кфкПанельАдминистрирования.Команда.ФоновыеЗадания")));
	
КонецПроцедуры

// Авто подбор списока выбора.
// 
// Параметры:
//	Элемент - РасширениеПоляФормыДляПоляВвода - Элемент
//	Текст - Строка - Текст
//	ДанныеВыбора - Неопределено, СписокЗначений Из ЭлементСпискаЗначений - Данные выбора
//	СтандартнаяОбработка - Булево - Стандартная обработка
Процедура АвтоПодборСписокаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	СписокВыбора = Элемент.СписокВыбора; // СписокЗначений Из ЭлементСпискаЗначений
	
	Если СписокВыбора.Количество() = 0 Или ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений; // СписокЗначений Из ЭлементСпискаЗначений
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		
		Значение = ЭлементСписка.Значение; // Строка
		
		Представление = СтрНайтиИВыделитьОформлением(Значение, Текст);
		Если Представление <> Неопределено Тогда
			ДанныеВыбора.Добавить(Значение, Представление);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполнить список выбора доступных топиков.
// 
// Параметры:
//	Брокер - СправочникСсылка.кфкБрокеры - Брокер
//	Элемент - РасширениеПоляФормыДляПоляВвода - Элемент
//	ИдентификаторФормы - УникальныйИдентификатор - Идентификатор формы
Процедура ЗаполнитьСписокВыбораТопиков(Брокер, Элемент, ИдентификаторФормы) Экспорт
	
	ОтложенноеЗаполнение = Ложь;
	Результат = кфкИнтеграцияСлужебныйВызовСервера.ДоступныеТопики(Брокер, ИдентификаторФормы, ОтложенноеЗаполнение);
	Если ОтложенноеЗаполнение Тогда
		// Обработка отложенного заполнения
		ПараметрыОтложенногоЗаполнения = Новый Структура("Брокер, Элемент", Брокер, Элемент);
		ОповещениеОтложенногоЗаполнения = Новый ОписаниеОповещения("ЗавершитьОтложенноеЗаполнениеТопиков", ЭтотОбъект,
			ПараметрыОтложенногоЗаполнения);
		// Параметры ожидания
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		// Запуск длительной операции
		ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, ОповещениеОтложенногоЗаполнения, ПараметрыОжидания)
		
	Иначе
		Элемент.СписокВыбора.ЗагрузитьЗначения(Новый Массив(Результат));
		
	КонецЕсли;
	
КонецПроцедуры

// Завершить отложенное заполнение топиков.
// 
// Параметры:
//	Результат - см. кфкИнтеграцияСлужебный.ДоступныеТопики
//	ДополнительныеПараметры - Структура - Дополнительные параметры:
//		* Брокер - СправочникСсылка.кфкБрокеры - Брокер
//		* Элемент - РасширениеПоляФормыДляПоляВвода - Элемент
Процедура ЗавершитьОтложенноеЗаполнениеТопиков(Результат, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Статус") <> "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	АдресРезультата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "АдресРезультата"); // Строка
	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Возврат;
	КонецЕсли;
	
	Топики = ПолучитьИзВременногоХранилища(АдресРезультата); // Массив Из Строка
	Если ТипЗнч(Топики) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнить список выбора
	ДополнительныеПараметры.Элемент.СписокВыбора.ЗагрузитьЗначения(Топики);
	
	// Обновить кэш доступных топиков
	кфкИнтеграцияСлужебныйВызовСервера.ОбновитьКЭШДоступныхТопиков(ДополнительныеПараметры.Брокер, Топики);
	
КонецПроцедуры

#Область ПараметрыПодключения

// Параметры подключения "при активизации строки".
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
//	Элемент - ПолеФормы - Элемент
Процедура ПараметрыПодключенияПриАктивизацииСтроки(Форма, Элемент) Экспорт
	
	ИмяТаблицы = ИмяРеквизитаПараметрыПодключения(Форма);
	
	ТекущиеДанные = ТекущиеПараметрыПодключения(Форма, ИмяТаблицы);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Свойство = СвойстваLibrdKafka(Форма).Получить(ТекущиеДанные.Ключ); // см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
	Если Свойство = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодключенияИнициализироватьКолонкуЗначение(Форма, ИмяТаблицы, Свойство);
	
КонецПроцедуры

// Событие элемента формы "перед началом добавления".
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
//	Элемент - ПолеФормы - Элемент
//	Отказ - Булево - Отказ
//	Копирование - Булево - Копирование
//	Родитель - Произвольный - Родитель
//	ЭтоГруппа - Булево - Это группа
//	Параметр - Произвольный - Параметр
Процедура ПараметрыПодключенияПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр) Экспорт
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Событие элемента формы "при изменении".
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
//	Элемент - ПолеФормы - Элемент
Процедура ПараметрыПодключенияКлючПриИзменении(Форма, Элемент) Экспорт
	
	ИмяТаблицы = ИмяРеквизитаПараметрыПодключения(Форма);
	
	ТекущиеДанные = ТекущиеПараметрыПодключения(Форма, ИмяТаблицы);
	Если ТекущиеДанные = Неопределено Или ПустаяСтрока(ТекущиеДанные.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	Свойство = СвойстваLibrdKafka(Форма).Получить(ТекущиеДанные.Ключ); // см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
	Если Свойство = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодключенияИнициализироватьКолонкуЗначение(Форма, ИмяТаблицы, Свойство, ТекущиеДанные);
	
КонецПроцедуры

// Событие элемента формы "начало выбора".
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
//	Элемент - ПолеФормы - Элемент
//	ДанныеВыбора - СписокЗначений Из Строка - Данные выбора
//	ВыборДобавлением - Булево - Выбор добавлением
//	СтандартнаяОбработка - Булево - Стандартная обработка
Процедура ПараметрыПодключенияКлючНачалоВыбора(Форма, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ИмяТаблицы = ИмяРеквизитаПараметрыПодключения(Форма);
	
	ТекущиеДанные = ТекущиеПараметрыПодключения(Форма, ИмяТаблицы);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Свойства = СвойстваLibrdKafka(Форма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийКлюч", ТекущиеДанные.Ключ);
	ПараметрыФормы.Вставить("СвойстваLibrdKafka", Свойства);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Форма", Форма);
	ПараметрыОповещения.Вставить("ИмяТаблицы", ИмяТаблицы);
	ПараметрыОповещения.Вставить("ТекущаяСтрока", ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Форма.Элементы,
		ИмяТаблицы, "ТекущаяСтрока"));
	ПараметрыОповещения.Вставить("СвойстваLibrdKafka", Свойства);
	Оповещение = Новый ОписаниеОповещения("ПараметрыПодключенияЗавершениеВыбораКлюча", ЭтотОбъект, ПараметрыОповещения);
	
	ОткрытьФорму("ОбщаяФорма.кфкФормаВыбораСвойстваLibrdKafka", ПараметрыФормы, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Параметры подключения ключ авто подбор.
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
//	Элемент - ПолеФормы - Элемент
//	Текст - Строка - Текст
//	ДанныеВыбора - СписокЗначений Из Строка- Данные выбора
//	ПараметрыПолученияДанных - Структура - Параметры получения данных
//	Ожидание - Число - Ожидание
//	СтандартнаяОбработка - Булево - Стандартная обработка
Процедура ПараметрыПодключенияКлючАвтоПодбор(Форма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений; // СписокЗначений Из Строка
	
	ТекущиеДанные = ТекущиеПараметрыПодключения(Форма);
	ТекстПодбора = ?(ПустаяСтрока(Текст) И ТекущиеДанные <> Неопределено, ТекущиеДанные.Ключ, Текст);
	
	Для Каждого Свойство Из СвойстваLibrdKafka(Форма) Цикл
		
		Если ПустаяСтрока(Текст) И Свойство.Значение.БыстрыйДоступ Тогда
			ДанныеВыбора.Добавить(Свойство.Ключ, Свойство.Ключ);
			
		ИначеЕсли Не ПустаяСтрока(ТекстПодбора) И СтрНайти(Свойство.Ключ, ТекстПодбора) > 0 Тогда
			ДанныеВыбора.Добавить(Свойство.Ключ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры подключения значение представление "при изменении".
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
//	Элемент - ПолеФормы - Элемент
Процедура ПараметрыПодключенияЗначениеПредставлениеПриИзменении(Форма, Элемент) Экспорт
	
	ТекущиеДанные = ТекущиеПараметрыПодключения(Форма);
	ТекущиеДанные.Значение = ?(ТипЗнч(ТекущиеДанные.ЗначениеПредставление) = Тип("Число"),
		Формат(ТекущиеДанные.ЗначениеПредставление, "ЧН=0; ЧГ=;"), ТекущиеДанные.ЗначениеПредставление);
	
КонецПроцедуры

// Параметры подключения значение представление "начало выбора".
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
//	Элемент - ПолеФормы - Элемент
//	ДанныеВыбора - СписокЗначений Из Строка - Данные выбора
//	ВыборДобавлением - Булево - Выбор добавлением
//	СтандартнаяОбработка - Булево - Стандартная обработка
Асинх Процедура ПараметрыПодключенияЗначениеПредставлениеНачалоВыбора(Форма, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = ТекущиеПараметрыПодключения(Форма);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Свойство = СвойстваLibrdKafka(Форма).Получить(ТекущиеДанные.Ключ); // см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
	Если Свойство = Неопределено Или Свойство.ТипЗначения <> "list|string" Тогда
		Возврат;
	КонецЕсли;
	
	Список = Новый СписокЗначений; // СписокЗначений Из Строка
	
	Для Каждого Элемент Из СтрРазделить(ТекущиеДанные.ЗначениеПредставление, ",", Ложь) Цикл
		Список.Добавить(СокрЛП(Элемент), , Истина);
	КонецЦикла;
	Для Каждого Элемент Из Свойство.ДоступныеЗначения Цикл
		Если Список.НайтиПоЗначению(Элемент) = Неопределено Тогда
			Список.Добавить(СокрЛП(Элемент));
		КонецЕсли;
	КонецЦикла;
	Список.СортироватьПоЗначению();
	
	Ответ = Ждать Список.ОтметитьЭлементыАсинх(ТекущиеДанные.Ключ); // Неопределено, СписокЗначений Из Строка
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Массив; // Массив Из Строка
	
	Для Каждого Элемент Из Ответ Цикл
		Если Элемент.Пометка Тогда
			Результат.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ТекущиеДанные.Значение = СтрСоединить(Результат, ", ");
	ТекущиеДанные.ЗначениеПредставление = ТекущиеДанные.Значение;
	
КонецПроцедуры

// Обработчик завершения оповещения для события элемента формы "начало выбора".
// 
// Параметры:
//	ИмяСвойства - Строка - Имя свойства
//	ДополнительныеПараметры - Структура - Дополнительные параметры:
//	 * Форма - ФормаКлиентскогоПриложения - Форма
//	 * ИмяТаблицы - Строка - Имя таблицы
//	 * ТекущаяСтрока - Число - Текущая строка
//	 * СвойстваLibrdKafka - ФиксированноеСоответствие Из ФиксированнаяСтруктура - Свойства конфигурации, см. кфкИнтеграцияСлужебныйПовтИсп.СвойстваLibrdKafka:
Процедура ПараметрыПодключенияЗавершениеВыбораКлюча(ИмяСвойства, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ИмяСвойства) <> Тип("Строка") Или ПустаяСтрока(ИмяСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	Свойство = ДополнительныеПараметры.СвойстваLibrdKafka.Получить(ИмяСвойства); // см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
	Если Свойство = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ДополнительныеПараметры.Форма, "Объект."
		+ ДополнительныеПараметры.ИмяТаблицы); // ДанныеФормыКоллекция
	
	Строка = Параметры.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока); // см. ТекущиеПараметрыПодключения
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка.Ключ = ИмяСвойства;
	
	ПараметрыПодключенияИнициализироватьКолонкуЗначение(ДополнительныеПараметры.Форма,
		ДополнительныеПараметры.ИмяТаблицы, Свойство, Строка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПараметрыПодключения

// Свойства librd kafka.
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
// 
// Возвращаемое значение:
//	ФиксированноеСоответствие Из ФиксированнаяСтруктура - Свойства конфигурации, см. кфкИнтеграцияСлужебныйПовтИсп.СвойстваLibrdKafka:
//	* Ключ - Строка - Имя свойства
//	* Значение - ФиксированнаяСтруктура - Свойства:
//		** ДоступныеЗначения - Строка, ФиксированныйМассив Из Строка - Доступные строковые значения
//		** ДоступныеЗначенияОт - Число - Доступные число 'ОТ'
//		** ДоступныеЗначенияДо - Число - Доступные число 'ДО'
//		** ЗначениеПоУмолчанию - Строка - Значение по умолчанию
//		** ТипЗначения - Строка - Тип значения: string, bool, float, int, enum, list|string 
//		** Важность - Число - Важность, 1 - Низкая, 2 - Средняя, 3 - Высокая
//		** БыстрыйДоступ - Булево - Быстрый доступ
//		** Описание - Строка - Описание
Функция СвойстваLibrdKafka(Форма)
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "СвойстваLibrdKafka");
КонецФункции

// Текущие параметры подключения.
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
//	ИмяТаблицы - Строка - Имя таблицы
// 
// Возвращаемое значение:
//	Неопределено, ДанныеФормыЭлементКоллекции - Текущие параметры подключения:
//	 * НомерСтроки - Число - Номер строки
//	 * Ключ - Строка - Ключ
//	 * Значение - Строка - Значение
//	 * ЗначениеПредставление - Строка, Число - Значение представление
//	 * РежимПароля - Булево - Режим пароля
Функция ТекущиеПараметрыПодключения(Форма, ИмяТаблицы = "")
	
	Если ПустаяСтрока(ИмяТаблицы) Тогда
		ИмяТаблицы = ИмяРеквизитаПараметрыПодключения(Форма);
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Форма.Элементы, ИмяТаблицы, "ТекущиеДанные");
	
КонецФункции

// Имя реквизита параметры подключения.
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
// 
// Возвращаемое значение:
//	Строка - Имя реквизита параметры подключения
Функция ИмяРеквизитаПараметрыПодключения(Форма)
	
	ТипФормы = ТипЗнч(ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.Ссылка"));
	Если ТипФормы = Тип("СправочникСсылка.кфкБрокеры") Тогда
		Возврат "ПараметрыПодключения";
		
	ИначеЕсли ТипФормы = Тип("СправочникСсылка.кфкПродюсеры") Тогда
		Возврат "ПараметрыПродюсера";
		
	ИначеЕсли ТипФормы = Тип("СправочникСсылка.кфкКонсьюмеры") Тогда
		Возврат "ПараметрыКонсьюмера";
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный тип формы параметров подключения'");
	КонецЕсли;
	
КонецФункции

// Параметры подключения инициализировать колонку значение.
// 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма
//	ИмяТаблицы - Строка - Имя таблицы
//	Свойство - ФиксированнаяСтруктура, Структура - Свойство, см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
//	Строка - Неопределено, ДанныеФормыЭлементКоллекции - Текущая строка, см. ТекущиеПараметрыПодключения
//@skip-check property-return-type
//@skip-check dynamic-access-method-not-found
Процедура ПараметрыПодключенияИнициализироватьКолонкуЗначение(Форма, ИмяТаблицы, Свойство, Строка = Неопределено)
	
	Если Строка <> Неопределено Тогда
		Строка.Значение = Свойство.ЗначениеПоУмолчаниюСтрокой;
		Строка.ЗначениеПредставление = Свойство.ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Элемент = Форма.Элементы[ИмяТаблицы + "ЗначениеПредставление"]; // ПолеФормы
	Элемент.СписокВыбора.Очистить(); // СписокЗначений Из Строка
	
	Элемент.КнопкаВыбора = Ложь;
	Элемент.КнопкаОчистки = Ложь;
	Элемент.КнопкаРегулирования = Ложь;
	Элемент.КнопкаВыпадающегоСписка = Ложь;
	
	Если Свойство.ТипЗначения = "string" Тогда
		Элемент.КнопкаОчистки = Истина;
		
	ИначеЕсли Свойство.ТипЗначения = "bool" Или Свойство.ТипЗначения = "enum" Тогда
		Элемент.СписокВыбора.ЗагрузитьЗначения(Новый Массив(Свойство.ДоступныеЗначения));
		Элемент.КнопкаВыпадающегоСписка = Истина;
		
	ИначеЕсли Свойство.ТипЗначения = "int" Или Свойство.ТипЗначения = "float" Тогда
		Элемент.КнопкаРегулирования = Истина;
		Элемент.МинимальноеЗначение = Свойство.ДоступныеЗначенияОт;
		Элемент.МаксимальноеЗначение = Свойство.ДоступныеЗначенияДо;
		
	ИначеЕсли Свойство.ТипЗначения = "list|string" Тогда
		Элемент.КнопкаВыбора = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
