///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ОписаниеПеременных

&НаКлиенте
Перем РедакторJSON; // ВнешнийОбъект

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	ТолькоПросмотр = Истина;
	Элементы.ФормаОбработатьСообщение.Доступность = кфкОбщегоНазначенияСлужебный.ЭтоПолноправныйПользователь();
	
	Элементы.ДлОбработкиМС.ФорматРедактирования = ?(ЗначениеЗаполнено(Запись.ДатаОбработки), "ЧН='<1';", "ЧН=;");
	
	АдресРедактораJSON = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("кфкJSONEditor"));
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ТелоСообщения
	ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(ТекущийОбъект.ТелоСообщения); // Строка
	АдресТелаСообщения = ПоместитьВоВременноеХранилище(ТелоСообщения);
	
	// Заголовки
	Заголовки.Очистить();
	ЗаголовкиИБ = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(ТекущийОбъект.Заголовки); // Неопределено, Соответствие Из Строка
	Если ЗаголовкиИБ <> Неопределено Тогда
		Для Каждого КлючЗначение Из ЗаголовкиИБ Цикл
			ЗаполнитьЗначенияСвойств(Заголовки.Добавить(), КлючЗначение);
		КонецЦикла;
	КонецЕсли;
	Элементы.СтраницаЗаголовки.Доступность = Заголовки.Количество() > 0;
	
	// ТекстЖурнала
	Элементы.СтраницаТекстЖурнала.Доступность = Не ПустаяСтрока(ТекущийОбъект.ТекстЖурнала);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализироватьРедакторJSON();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницаРедактораJSONДокументСформирован(Элемент)
	
	Если РедакторJSON = Неопределено Тогда
		//@skip-check property-return-type
		//@skip-check dynamic-access-method-not-found
		РедакторJSON = Элемент.Документ.defaultView.Init(); // ВнешнийОбъект
	КонецЕсли;
	
	//@skip-check property-return-type
	РедакторJSON.menu.style.backgroundColor = "#d0d0d0";
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.focus();
	
	ТелоСообщения = ПолучитьИзВременногоХранилища(АдресТелаСообщения); // Строка
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.setText(ТелоСообщения);
	
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.setMode("tree");
	
КонецПроцедуры

&НаКлиенте
Процедура РедакторJSONРежимТекстаПриИзменении(Элемент)
	
	//@skip-check dynamic-access-method-not-found
	РедакторJSON.setMode(?(РедакторJSONРежимТекста, "code", "tree"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	
	ОчиститьСообщения();
	
	Если Не ОбработкаДоступна() Тогда
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучнойОбработки();
		Возврат;
	КонецЕсли;
	
	ОбработатьСообщениеНаСервере();
	
	ИнициализироватьРедакторJSON();
	
	ОповеститьОбИзменении(Запись.ИсходныйКлючЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОбработкаДоступна()
	Возврат (ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции")
				Или Не кфкФоновыеОперацииСлужебный.РегламентноеЗадание().Использование)
			И кфкФоновыеОперацииСлужебный.ПолучитьПотоки(СостояниеФоновогоЗадания.Активно).Количество() = 0;
КонецФункции

&НаСервере
Процедура ОбработатьСообщениеНаСервере()
	
	кфкФоновыеОперацииСлужебный.ДесериализацияСообщения(Запись.ИсходныйКлючЗаписи);
	
	Прочитать();
	
КонецПроцедуры

#Область ИнициализацияФормы

&НаКлиенте
Процедура ИнициализироватьРедакторJSON()
	
	Если Не (ПустаяСтрока(РедакторJSONСтраница)
			И ЭтоАдресВременногоХранилища(АдресТелаСообщения) И ЭтоАдресВременногоХранилища(АдресРедактораJSON)) Тогда
		Возврат;
	КонецЕсли;
		
#Если Не ВебКлиент Тогда
	
	Каталог = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(КаталогВременныхФайлов(), "kfkJSONEditor");
	РедакторJSONСтраница = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(Каталог, "index.html");
	
	Файл = Новый Файл(РедакторJSONСтраница);
	Если Не Файл.Существует() Тогда
		
		УдалитьФайлы(Каталог);
		СоздатьКаталог(Каталог);
		
		РедакторДД = ПолучитьИзВременногоХранилища(АдресРедактораJSON); // ДвоичныеДанные
		Поток = РедакторДД.ОткрытьПотокДляЧтения();
		ЧтениеZip = Новый ЧтениеZipФайла(Поток);
		ЧтениеZip.ИзвлечьВсе(Каталог);
		
	КонецЕсли;
	
#Иначе
	Элементы.СтраницаТелоСообщения.Доступность = Ложь;
#КонецЕсли

КонецПроцедуры

#КонецОбласти

#КонецОбласти
