///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает доступные брокеры.
// 
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение - Доступные брокеры:
//	 * Ключ - СправочникСсылка.кфкБрокеры - Брокер
//	 * Значение см. ПустоеОписаниеБрокера
//
Функция ДоступныеБрокеры() Экспорт
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина); // Требуется для получения защещенных данных из безопасного хранилища
	// BSLLS:SetPrivilegedMode-on
	
	Результат = Новый Соответствие; // Соответствие Из Структура
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Брокеры.Ссылка КАК Ссылка,
	|	Брокеры.Наименование КАК Наименование
	|ИЗ
	|	Справочник.кфкБрокеры КАК Брокеры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	кфкБрокерыУзлы.Ссылка КАК Ссылка,
	|	кфкБрокерыУзлы.Адрес КАК Адрес
	|ИЗ
	|	Справочник.кфкБрокеры.Узлы КАК кфкБрокерыУзлы
	|ГДЕ
	|	кфкБрокерыУзлы.Использование = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БрокерыПараметрыПодключения.Ссылка КАК Ссылка,
	|	БрокерыПараметрыПодключения.Ключ КАК Ключ,
	|	БрокерыПараметрыПодключения.Значение КАК Значение,
	|	БрокерыПараметрыПодключения.РежимПароля КАК РежимПароля
	|ИЗ
	|	Справочник.кфкБрокеры.ПараметрыПодключения КАК БрокерыПараметрыПодключения";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	ВыборкаУзлы = РезультатЗапроса[1].Выбрать();
	ВыборкаПараметры = РезультатЗапроса[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Параметры из безопасного хранилища
		ДанныеБХ = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Выборка.Ссылка, "ПараметрыПодключения");
		Если ДанныеБХ = Неопределено Тогда
			ДанныеБХ = Новый Соответствие;
		КонецЕсли;
		
		Описание = ПустоеОписаниеБрокера();
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
		
		// Узлы
		Узлы = Новый Массив;
		ВыборкаУзлы.Сбросить();
		Пока ВыборкаУзлы.НайтиСледующий(Выборка.Ссылка, "Ссылка") Цикл
			Узлы.Добавить(ВыборкаУзлы.Адрес);
		КонецЦикла;
		Описание.АдресБрокера = СтрСоединить(Узлы, ",");
		
		// Параметры подключения
		ВыборкаПараметры.Сбросить();
		Пока ВыборкаПараметры.НайтиСледующий(Выборка.Ссылка, "Ссылка") Цикл
			Описание.ПараметрыПодключения.Вставить(ВыборкаПараметры.Ключ,
				?(ВыборкаПараметры.РежимПароля, ДанныеБХ.Получить(ВыборкаПараметры.Ключ), ВыборкаПараметры.Значение));
		КонецЦикла;
		
		Результат.Вставить(Описание.Ссылка, Описание);
		
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

// Возвращает адрес брокера
// 
// Параметры:
//	Брокер - СправочникСсылка.кфкБрокеры - Брокер
// 
// Возвращаемое значение:
//	Строка - Адрес брокера
Функция АдресБрокера(Брокер) Экспорт
	
	Если Не ЗначениеЗаполнено(Брокер) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Адрес ИЗ Справочник.кфкБрокеры.Узлы ГДЕ Ссылка = &Ссылка И Использование = ИСТИНА";
	Запрос.УстановитьПараметр("Ссылка", Брокер);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат СтрСоединить(кфкОбщегоНазначенияСлужебный.ВыбратьКолонку(Выборка, "Адрес"), ",");
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пустое описание брокера.
// 
// Возвращаемое значение:
//	Структура - Пустое описание брокера:
//	 * Ссылка - СправочникСсылка.кфкБрокеры - Брокер
//	 * Наименование - Строка - Наименование брокера
//	 * АдресБрокера - Строка - Адрес брокера
//	 * ПараметрыПодключения - Соответствие Из КлючИЗначение - Параметры подключения:
//		** Ключ - Строка - Имя параметра
//		** Значение - Произвольный - Значение параметра
Функция ПустоеОписаниеБрокера()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", ПустаяСсылка());
	Результат.Вставить("Наименование", "");
	Результат.Вставить("АдресБрокера", "");
	Результат.Вставить("ПараметрыПодключения", Новый Соответствие);
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли