///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьОбъектСсылочногоТипа = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПродюсерПриИзменении(Элемент)
	
	ОбъектыМетаданных.Очистить();
	
	Если Продюсер.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТипОбъект Из ДоступныеОбъектыМетаданных(Продюсер) Цикл
		ОбъектыМетаданных.Добавить().ТипОбъект = ТипОбъект;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	ИзменитьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ИзменитьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДанные(Команда)
	
	Для Каждого Строка Из ОбъектыМетаданных Цикл
		Строка.Статус = Неопределено;
		Строка.Завершено = Ложь;
	КонецЦикла;
	
	ЗапуститьРегистрацию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапуститьРегистрацию()
	
	ТипОбъект = "";
	Для Каждого Строка Из ОбъектыМетаданных Цикл
		
		Если Строка.Регистрировать И Не Строка.Завершено Тогда
			Элементы.ОбъектыМетаданных.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
			ТипОбъект = Строка.ТипОбъект;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПустаяСтрока(ТипОбъект) Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = СтрШаблон(НСтр("ru = 'Регистрация ''%1'''"), ТипОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ЗапуститьРегистрациюНаСервере(ТипОбъект),
		Новый ОписаниеОповещения("ЗавершитьРегистрацию", ЭтотОбъект, ТипОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРегистрацию(Результат, ТипОбъект) Экспорт
	
	Успешно = Ложь;
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить проверку подключения к брокеру.'"));
		КонецЕсли;
		
		Возврат;
		
	Иначе
		Успешно = Истина;
		
	КонецЕсли;
	
	Строки = ОбъектыМетаданных.НайтиСтроки(Новый Структура("ТипОбъект", ТипОбъект));
	Если Строки.Количество() <> 1 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не найдена строка для объекта метаданных %1'"), ТипОбъект);
	КонецЕсли;
	Строка = Строки[0];
	Строка.Статус = ?(Успешно, БиблиотекаКартинок.ОформлениеКругЗеленый, БиблиотекаКартинок.ОформлениеКругКрасный);
	Строка.Завершено = Истина;
	
	ЗапуститьРегистрацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажки(Значение)
	
	ВыделенныеСтроки = Элементы.ОбъектыМетаданных.ВыделенныеСтроки; // Массив Из Число
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		Строка = ОбъектыМетаданных.НайтиПоИдентификатору(ИдентификаторСтроки);
		Строка.Регистрировать = Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныеОбъектыМетаданных(Продюсер)
	
	Результат = Новый Массив; // Массив Из Строка
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Т.ТипОбъект
		|ИЗ Справочник.кфкПродюсеры.ОбъектыМетаданных КАК Т
		|ГДЕ Т.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Продюсер);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТипОбъект = Выборка[0]; // Строка
		Если ПустаяСтрока(ТипОбъект) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ТипОбъект) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ТипОбъект);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗапуститьРегистрациюНаСервере(ТипОбъект)
	
	ОбъектМД = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ТипОбъект);
	Если ОбъектМД = Неопределено Тогда
		ВызватьИсключение СтрШаблон(НРег("Объект метаданных не найден: %1"), ТипОбъект);
	КонецЕсли;
	
	ЭтоРегистр = ОбщегоНазначения.ЭтоРегистр(ОбъектМД);
	Если ЭтоРегистр Тогда
		ПоляСтрокой = СтрСоединить(кфкОбщегоНазначенияСлужебный.КлючиРегистра(ОбъектМД), ",");
		Запрос = Новый Структура;
		Запрос.Вставить("Текст", СтрШаблон("ВЫБРАТЬ %1 ИЗ %2", ПоляСтрокой, ТипОбъект));
		Запрос.Вставить("Параметры", Новый Структура);
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(
			ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор),
			"Обработки.кфкРегистрацияИзменений.ВыполнитьРегистрациюРегистра",
			Запрос, Продюсер, ОбъектМД.ПолноеИмя());
			
	Иначе
		Запрос = Новый Структура;
		Запрос.Вставить("Текст", СтрШаблон("ВЫБРАТЬ %1.Ссылка", ТипОбъект));
		Запрос.Вставить("Параметры", Новый Структура);
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(
			ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор),
			"Обработки.кфкРегистрацияИзменений.ВыполнитьРегистрациюСсылочногоТипа",
			Запрос, Продюсер, ПолучитьОбъектСсылочногоТипа);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
