///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ФоновыеЗадания

Процедура ПерезапуститьФЗ() Экспорт
	
	ДлительныеОперации.СообщитьПрогресс(1, НСтр("ru = 'Блокировка потоков'"));
	
	Константы.кфкБлокировкаИнтеграции.Установить(Истина);
	
	Задания = кфкФоновыеОперацииСлужебный.ПолучитьПотоки(СостояниеФоновогоЗадания.Активно);
	ОжидатьЗавершенияВыполнения(Задания, Задания.Количество());
	
	ПроцентЗапускаПотоков = 80;
	ДлительныеОперации.СообщитьПрогресс(ПроцентЗапускаПотоков, НСтр("ru = 'Запуск потоков'"));
	Константы.кфкБлокировкаИнтеграции.Установить(Ложь);
	
	Задание = кфкФоновыеОперацииСлужебный.РегламентноеЗадание();
	Если Не Задание.Использование Тогда
		кфкФоновыеОперацииСлужебный.ЗапуститьПотоки();
	КонецЕсли;
	
	ПроцентЗавершения = 100;
	ДлительныеОперации.СообщитьПрогресс(ПроцентЗавершения, НСтр("ru = 'Перезапуск завершен'"));
	
КонецПроцедуры

Функция ФоновыеЗадания() Экспорт
	
	Потоки = кфкФоновыеОперацииСлужебный.ПолучитьПотоки();
	Если Потоки.Количество() = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Таблица = ПустаяТаблицаФЗ();
	
	Родители = ПустаяТаблицаРодителейФЗ();
	
	КлючиСлужебных = кфкФоновыеОперацииСлужебный.КлючиСлужебныхОпераций();
	
	КлючГруппыСлужебных = НСтр("ru = 'СлужебныеОперации'");
	ЕстьСлужебныеОперации = Ложь;
	
	Для Каждого Задание Из Потоки Цикл
		ЭтоСлужебнаяОперация = ДобавитьФоновоеЗаданиеВТаблицу(
			Таблица, Родители, Задание, КлючиСлужебных, КлючГруппыСлужебных);
		ЕстьСлужебныеОперации = ЭтоСлужебнаяОперация Или ЕстьСлужебныеОперации;
	КонецЦикла;
	
	Если ЕстьСлужебныеОперации Тогда
		
		// Добавим группу служебных операций как родителя
		НоваяСтрока = Родители.Добавить();
		НоваяСтрока.Имя = КлючГруппыСлужебных;
		НоваяСтрока.Порядок = 0;
		
		// Добавим группу служебных операций как виртуальный поток
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Ключ = КлючГруппыСлужебных;
		НоваяСтрока.Наименование = НСтр("ru = 'Служебные операции'");
		
	КонецЕсли;
	
	Таблица.Индексы.Добавить("Родитель");
	Таблица.Индексы.Добавить(ИмяКолонкиКлюч());
	
	Родители.Свернуть("Имя,Порядок");
	Родители.Сортировать("Порядок Убыв");
	
	//@skip-check statement-type-change
	Родители = ОбщегоНазначения.ВыгрузитьКолонку(Родители, "Имя", Истина); // Массив Из Строка
	
	Для Каждого Родитель Из Родители Цикл
		Если Таблица.Найти(Родитель, ИмяКолонкиКлюч()) = Неопределено Тогда
			
			Строка = Таблица.Найти(Родитель, "Родитель");
			Если Не Строка = Неопределено Тогда
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Ключ = Лев(Строка.Ключ, СтрНайти(Строка.Ключ, "_", НаправлениеПоиска.СКонца) - 1);
				ПозицияСкобки = СтрНайти(Строка.Наименование, "(", НаправлениеПоиска.СКонца);
				Наименование = Лев(Строка.Наименование, ПозицияСкобки - 1);
				НоваяСтрока.Наименование = СокрП(Наименование);
				НоваяСтрока.Родитель = Лев(НоваяСтрока.Родитель, СтрНайти(НоваяСтрока.Родитель, "_", НаправлениеПоиска.СКонца) - 1);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Таблица.Сортировать("Наименование, Начало Убыв");
	
	Ключи = Новый Массив;
	Возврат ТаблицуФЗВМассив(Таблица, НовоеОписаниеЗадания(), Ключи);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФоновыеЗадания

Функция ДобавитьФоновоеЗаданиеВТаблицу(Таблица, Родители, Задание, КлючиСлужебных, КлючГруппыСлужебных)

	Строка = Таблица.Найти(Задание.Ключ, ИмяКолонкиКлюч());
	Если Строка = Неопределено Тогда
		НоваяСтрока = Таблица.Добавить();

	ИначеЕсли Строка.Конец <> Дата(1, 1, 1) И Строка.Начало < Задание.Начало Тогда
		НоваяСтрока = Строка;

	Иначе
		Возврат Ложь;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(НоваяСтрока, Задание);
	НоваяСтрока.Идентификатор = Строка(Задание.УникальныйИдентификатор);
	НоваяСтрока.Состояние = ПредставлениеСостоянияФЗ(Задание.Состояние);

	Если Задание.ИнформацияОбОшибке <> Неопределено Тогда
		НоваяСтрока.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
	КонецЕсли;

	Если КлючиСлужебных.Найти(Задание.Ключ) <> Неопределено Тогда
		НоваяСтрока.Родитель = КлючГруппыСлужебных;
		Возврат Истина;
	КонецЕсли;

	Позиция = СтрНайти(Задание.Ключ, "_", НаправлениеПоиска.СКонца);
	Если Позиция > 0 Тогда
		НоваяСтрока.Родитель = Лев(Задание.Ключ, Позиция - 1);
		ДополнитьРодителиФЗ(Родители, Задание.Ключ);
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция ИмяКолонкиКлюч()
	Возврат "Ключ";
КонецФункции

// Ожидать завершения выполнения.
// 
// Параметры:
//  Задания - Массив Из ФоновоеЗадание - Задания
//	ИсходноеКоличество - Число - Исходное количество
Процедура ОжидатьЗавершенияВыполнения(Задания, ИсходноеКоличество)

	Если Задания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	НачальныйПроцентОжидания = 10;
	ДиапазонПроцентаОжидания = 69;
	РазрядностьПроцента = 2;
	КоличествоЗаданий = Задания.Количество();
	Процент = Окр(НачальныйПроцентОжидания
			+ ((ИсходноеКоличество - КоличествоЗаданий) / ИсходноеКоличество * ДиапазонПроцентаОжидания),
		РазрядностьПроцента);
	ШаблонСообщения = НСтр("ru = 'Ожидание завершения: %1'");
	СообщениеОПрогрессе = СтрШаблон(ШаблонСообщения, КоличествоЗаданий);
	ДлительныеОперации.СообщитьПрогресс(Процент, СообщениеОПрогрессе);

	ТаймаутОжидания = 60;
	Задания = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(Задания, ТаймаутОжидания);
	НомерЗадания = Задания.Количество();
	Пока НомерЗадания > 0 Цикл

		НомерЗадания = НомерЗадания - 1;
		Задание = Задания[НомерЗадания];

		Если Задание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
			Задания.Удалить(НомерЗадания);
		КонецЕсли;

	КонецЦикла;

	ОжидатьЗавершенияВыполнения(Задания, ИсходноеКоличество);

КонецПроцедуры

// Таблицу активных заданий в массив.
// 
// Параметры:
//  Таблица - ТаблицаЗначений - Таблица, см. ПустаяТаблицаФЗ:
//	 * Родитель - Строка - Родитель
//	 * ИмяМетода - Строка - ИмяМетода
//	 * Ключ - Строка - Ключ
//	 * Наименование - Строка - Наименование
//	 * Начало - Дата - Начало
//	 * Конец - Дата - Конец
//	 * Состояние - Строка - Состояние
//	 * ТекстОшибки - Строка - ТекстОшибки
//  Родитель - Структура, СтрокаТаблицыЗначений - Родитель, см. ПустаяТаблицаФЗ, НовоеОписаниеЗадания:
//	 * Родитель - Строка - Родитель
//	 * ИмяМетода - Строка - ИмяМетода
//	 * Ключ - Строка - Ключ
//	 * Наименование - Строка - Наименование
//	 * Начало - Дата - Начало
//	 * Конец - Дата - Конец
//	 * Состояние - Строка - Состояние
//	 * ТекстОшибки - Строка - ТекстОшибки
//	Ключи - Массив Из Строка - Ключик
// 
// Возвращаемое значение:
//  Массив Из Структура - Таблицу активных заданий в массив
Функция ТаблицуФЗВМассив(Таблица, Родитель, Ключи)

	Результат = Новый Массив; // Массив Из Структура

	Состояния = Новый Массив; // Массив Из Строка
	Состояния.Добавить(НСтр("ru = 'Ошибка'"));
	Состояния.Добавить(НСтр("ru = 'Активно'"));
	Состояния.Добавить(НСтр("ru = 'Отменено'"));
	Состояния.Добавить(НСтр("ru = 'Завершено'"));
	Состояния.Добавить("");

	СекундВСутках = 86400;
	Для Каждого Строка Из Таблица.НайтиСтроки(Новый Структура("Родитель", Родитель.Ключ)) Цикл

		Если Ключи.Найти(Строка.Ключ) <> Неопределено
			И Строка.Состояние <> "Активно"
			И Строка.Конец >= ТекущаяДатаСеанса() - СекундВСутках Тогда
			Продолжить;
		КонецЕсли;

		Если Не НачалоСтрокиВИнтервалеРодителя(Родитель, Строка) Тогда
			Продолжить;
		КонецЕсли;

		Ключи.Добавить(Строка.Ключ);

		Задание = НовоеОписаниеЗадания();
		ЗаполнитьЗначенияСвойств(Задание, Строка);
		Задание.ВложенныеПотоки = ТаблицуФЗВМассив(Таблица, Задание, Ключи);

		Результат.Добавить(Задание);

		Индекс1 = Состояния.Найти(Родитель.Состояние);
		Индекс2 = Состояния.Найти(Задание.Состояние);
		Если Индекс1 <> Неопределено И Индекс2 <> Неопределено Тогда
			Родитель.Состояние = Состояния.Получить(Мин(Индекс1, Индекс2));
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция НачалоСтрокиВИнтервалеРодителя(Родитель, Строка)

	Возврат Родитель.Начало = Дата(1, 1, 1)
		Или Родитель.Начало <= Строка.Начало
			И (Строка.Начало <= Родитель.Конец Или Родитель.Конец = Дата(1, 1, 1));

КонецФункции

// Дополнить родители ФЗ.
// 
// Параметры:
//  Родители - ТаблицаЗначений - Родители, см. ПустаяТаблицаРодителейФЗ
//  Ключ - Строка - Ключ
Процедура ДополнитьРодителиФЗ(Родители, Ключ)
	
	Позиция = СтрНайти(Ключ, "_", НаправлениеПоиска.СКонца);
	Если Позиция Тогда
		
		НоваяСтрока = Родители.Добавить();
		НоваяСтрока.Имя = Лев(Ключ, Позиция - 1);
		НоваяСтрока.Порядок = СтрЧислоВхождений(НоваяСтрока.Имя, "_");
		
		ДополнитьРодителиФЗ(Родители, НоваяСтрока.Имя);
		
	КонецЕсли;
	
КонецПроцедуры

// Представление состояния ФЗ.
// 
// Параметры:
//  Состояние - СостояниеФоновогоЗадания - Состояние
// 
// Возвращаемое значение:
//  Строка - Представление состояния ФЗ
Функция ПредставлениеСостоянияФЗ(Состояние)
	
	Если Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат НСтр("ru = 'Активно'");
		
	ИначеЕсли Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		Возврат НСтр("ru = 'Завершено'");
		
	ИначеЕсли Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Возврат НСтр("ru = 'Ошибка'");
		
	ИначеЕсли Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		Возврат НСтр("ru = 'Отменено'");
		
	Иначе
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

// Новое описание задания.
// 
// Параметры:
//  Наименование - Строка - Наименование
//  
// Возвращаемое значение:
//  Структура - Новое описание задания:
// * ИмяМетода - Строка - ИмяМетода
// * Ключ - Строка - Ключ
// * Наименование - Строка - Наименование
// * Начало - Дата - Начало
// * Конец - Дата - Конец
// * Состояние - Строка - Состояние
// * ТекстОшибки - Строка - ТекстОшибки
// * ВложенныеПотоки - Массив Из Строка - Вложенные потоки
Функция НовоеОписаниеЗадания(Наименование = "")
	
	Результат = Новый Структура;
	
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("ИмяМетода", "");
	Результат.Вставить(ИмяКолонкиКлюч(), "");
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("Начало", Дата(1, 1, 1));
	Результат.Вставить("Конец", Дата(1, 1, 1));
	Результат.Вставить("Состояние", "");
	Результат.Вставить("ТекстОшибки", "");
	
	Результат.Вставить("ВложенныеПотоки", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

// Пустая таблица ФЗ.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Пустая таблица ФЗ:
// * Родитель - Строка - Родитель
// * Идентификатор - Строка - Идентификатор
// * ИмяМетода - Строка - ИмяМетода
// * Ключ - Строка - Ключ
// * Наименование - Строка - Наименование
// * Начало - Дата - Начало
// * Конец - Дата - Конец
// * Состояние - Строка - Состояние
// * ТекстОшибки - Строка - ТекстОшибки
Функция ПустаяТаблицаФЗ()
	
	МаксимальнаяДлинаСтроки = 150;
	ТСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(МаксимальнаяДлинаСтроки);
	ТДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Родитель", ТСтрока);
	Таблица.Колонки.Добавить("Идентификатор", ТСтрока);
	Таблица.Колонки.Добавить("ИмяМетода", ТСтрока);
	Таблица.Колонки.Добавить(ИмяКолонкиКлюч(), ТСтрока);
	Таблица.Колонки.Добавить("Наименование", ТСтрока);
	Таблица.Колонки.Добавить("Начало", ТДата);
	Таблица.Колонки.Добавить("Конец", ТДата);
	Таблица.Колонки.Добавить("Состояние", ТСтрока);
	Таблица.Колонки.Добавить("ТекстОшибки", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Возврат Таблица;
	
КонецФункции

// Пустая таблица родителей ФЗ.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Пустая таблица родителей ФЗ:
// * Имя - Строка - Имя
// * Порядок - Число - Порядок
Функция ПустаяТаблицаРодителейФЗ()
	
	МаксимальнаяДлинаСтроки = 150;
	РазрядностьПорядка = 15;
	Родители = Новый ТаблицаЗначений;
	Родители.Колонки.Добавить("Имя", ОбщегоНазначения.ОписаниеТипаСтрока(МаксимальнаяДлинаСтроки));
	Родители.Колонки.Добавить(
		"Порядок", ОбщегоНазначения.ОписаниеТипаЧисло(РазрядностьПорядка, 0, ДопустимыйЗнак.Неотрицательный));
	
	Возврат Родители;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
