///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание консьюмера.
// 
// Параметры:
//  Консьюмер - СправочникСсылка.кфкКонсьюмеры - Консьюмер
// 
// Возвращаемое значение:
//	см. НовоеОписаниеКонсьюмера
Функция ОписаниеКонсьюмера(Консьюмер) Экспорт
	Возврат ОписаниеКонсьюмеров(Консьюмер).Получить(Консьюмер); // см. НовоеОписаниеКонсьюмера
КонецФункции

// Возвращает описание консьюмеров
// 
// Параметры:
//  Консьюмеры - Массив Из СправочникСсылка.кфкКонсьюмеры - Консьюмеры
// 
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение - Описание консьюмеров:
//		* Ключ - СправочникСсылка.кфкКонсьюмеры - Консьюмер
//		* Значение см. НовоеОписаниеКонсьюмера
Функция ОписаниеКонсьюмеров(Консьюмеры) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Консьюмеры.Ссылка КАК Ссылка,
	|	Консьюмеры.Наименование КАК Наименование,
	|	Консьюмеры.Брокер КАК Брокер,
	|	Консьюмеры.Идентификатор КАК Идентификатор,
	|	Консьюмеры.ТаймаутОжидания КАК ТаймаутОжидания,
	|	Консьюмеры.ДвоичныеДанные КАК ДвоичныеДанные
	|ИЗ
	|	Справочник.кфкКонсьюмеры КАК Консьюмеры
	|ГДЕ
	|	Консьюмеры.Ссылка В (&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонсьюмерыТопики.Ссылка КАК Ссылка,
	|	КонсьюмерыТопики.Топик КАК Топик
	|ИЗ
	|	Справочник.кфкКонсьюмеры.Топики КАК КонсьюмерыТопики
	|ГДЕ
	|	КонсьюмерыТопики.Ссылка В (&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонсьюмерыПараметры.Ссылка КАК Ссылка,
	|	КонсьюмерыПараметры.Ключ КАК Ключ,
	|	КонсьюмерыПараметры.Значение КАК Значение
	|ИЗ
	|	Справочник.кфкКонсьюмеры.ПараметрыКонсьюмера КАК КонсьюмерыПараметры
	|ГДЕ
	|	КонсьюмерыПараметры.Ссылка В (&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", Консьюмеры);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	ВыборкаТопики = РезультатЗапроса[1].Выбрать();
	ВыборкаПараметры = РезультатЗапроса[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Описание = НовоеОписаниеКонсьюмера();
		Результат.Вставить(Выборка.Ссылка, Описание);
		
		ДоступныеБрокеры = Справочники.кфкБрокеры.ДоступныеБрокеры();
		Брокер = ДоступныеБрокеры.Получить(Выборка.Брокер);
		Если Брокер = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
		ЗаполнитьЗначенияСвойств(Описание, Брокер, "АдресБрокера,ПараметрыПодключения");
		
		ВыборкаТопики.Сбросить();
		Пока ВыборкаТопики.НайтиСледующий(Выборка.Ссылка, "Ссылка") Цикл
			Описание.Топики.Добавить(ВыборкаТопики.Топик);
		КонецЦикла;
		
		ВыборкаПараметры.Сбросить();
		Пока ВыборкаПараметры.НайтиСледующий(Выборка.Ссылка, "Ссылка") Цикл
			Описание.ПараметрыПодключения.Вставить(ВыборкаПараметры.Ключ, ВыборкаПараметры.Значение);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

// Возвращает правила десериализации для указанных консьюмеров.
//
// Параметры:
//	Консьюмеры - Массив Из СправочникСсылка.кфкКонсьюмеры - список ссылок на консьюмеров
//
// Возвращаемое значение:
//	Соответствие Из Строка - словарь десериализации:
//	 * Ключ - Строка - Продюсер + ТипОбъект
//	 * Значение - Структура - Описание десериализации, см. кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена
Функция ПравилаДесериализации(Консьюмеры) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкКонсьюмерыТопики.Ссылка КАК Ссылка,
	|	кфкКонсьюмерыТопики.Топик КАК Топик,
	|	кфкКонсьюмерыТопики.ТипДесериализации КАК Тип,
	|	кфкКонсьюмерыТопики.ИмяМетодаДесериализации КАК ИмяМетода,
	|	кфкКонсьюмерыТопики.ИмяМодуляДесериализации КАК ИмяМодуля,
	|	кфкКонсьюмерыТопики.ИмяПОДДесериализации КАК ИмяПОД,
	|	кфкКонсьюмерыТопики.ФорматДесериализации КАК Формат
	|ИЗ
	|	Справочник.кфкКонсьюмеры.Топики КАК кфкКонсьюмерыТопики
	|ГДЕ
	|	кфкКонсьюмерыТопики.Ссылка В (&Консьюмеры)";
	Запрос.УстановитьПараметр("Консьюмеры", Консьюмеры);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Описание = кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена();
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
		
		// TODO: КД - Обратная совместимость
		Если Описание.Тип.Пустая() И Не ПустаяСтрока(Описание.ИмяМетода)
				И ПустаяСтрока(Описание.ИмяМодуля + Описание.ИмяПОД + Описание.Формат) Тогда
			Описание.Тип = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
		КонецЕсли;
		
		Результат.Вставить(НРег(XMLСтрока(Выборка.Ссылка) + Выборка.Топик), Описание);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает консьюмеров, для которых включена идемпотентная обработка
//
// Параметры:
//	Консьюмеры - Массив Из СправочникСсылка.кфкКонсьюмеры - список ссылок на консьюмера
//
// Возвращаемое значение:
//	Массив Из СправочникСсылка.кфкКонсьюмеры - список ссылок на консьюмеры
Функция ИдемпотентнаяОбработка(Консьюмеры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкКонсьюмеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кфкКонсьюмеры КАК кфкКонсьюмеры
	|ГДЕ
	|	кфкКонсьюмеры.Ссылка В (&Консьюмеры)
	|	И кфкКонсьюмеры.ИдемпотентнаяОбработка = ИСТИНА";
	Запрос.УстановитьПараметр("Консьюмеры", Консьюмеры);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат кфкОбщегоНазначенияСлужебный.ВыбратьКолонку(Выборка, "Ссылка");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Новое описание консьюмера.
// 
// Возвращаемое значение:
//	Структура - описание консьюмера:
//	 * Ссылка - СправочникСсылка.кфкКонсьюмеры - Консьюмер 
//	 * Наименование - Строка - Наименование консьюмера
//	 * АдресБрокера - Строка - Адрес брокера
//	 * Идентификатор - Строка - Идентификатор группы
//	 * ТаймаутОжидания - Число - Таймаут ожидания сообщений
//	 * ДвоичныеДанные - Булево - Получать сообщения двоичными данными
//	 * Топики - Массив Из Строка - Топики
//	 * ПараметрыПодключения - Соответствие Из КлючИЗначение - Параметры подключения брокера и консьюмера:
//		** Ключ - Строка - Имя параметра
//		** Значение - Строка - Значение параметра
Функция НовоеОписаниеКонсьюмера()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", ПустаяСсылка());
	Результат.Вставить("Наименование", "");
	Результат.Вставить("АдресБрокера", "");
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("ТаймаутОжидания", 0);
	Результат.Вставить("ДвоичныеДанные", Ложь);
	Результат.Вставить("Топики", Новый Массив);
	Результат.Вставить("ПараметрыПодключения", Новый Соответствие);
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли