
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Строки = ОбъектыМетаданных.ПолучитьЭлементы();

	// ССЫЛОЧНЫЕ ТИПЫ
	ДобавитьОбъектыМетаданных(Строки, Метаданные.ПланыОбмена,
		НСтр("ru = 'ПланыОбмена'"), НСтр("ru = 'Планы обмена'"),
		БиблиотекаКартинок.ПланОбмена);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.Справочники,
		НСтр("ru = 'Справочники'"), НСтр("ru = 'Справочники'"),
		БиблиотекаКартинок.Справочник);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.Документы,
		НСтр("ru = 'Документы'"), НСтр("ru = 'Документы'"),
		БиблиотекаКартинок.Документ);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.ПланыВидовХарактеристик,
		НСтр("ru = 'ПланыВидовХарактеристик'"), НСтр("ru = 'Планы видов характеристик'"),
		БиблиотекаКартинок.ПланВидовХарактеристик);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.ПланыСчетов,
		НСтр("ru = 'ПланыСчетов'"), НСтр("ru = 'Планы счетов'"),
		БиблиотекаКартинок.ПланСчетов);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.ПланыВидовРасчета,
		НСтр("ru = 'ПланыВидовРасчета'"), НСтр("ru = 'Планы видов расчета'"),
		БиблиотекаКартинок.ПланВидовРасчета);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.БизнесПроцессы,
		НСтр("ru = 'БизнесПроцессы'"), НСтр("ru = 'Бизнес процессы'"),
		БиблиотекаКартинок.БизнесПроцесс);
	
	ДобавитьОбъектыМетаданных(Строки, Метаданные.Задачи,
		НСтр("ru = 'Задачи'"), НСтр("ru = 'Задачи'"),
		БиблиотекаКартинок.Задача);
	
	// РЕГИСТРЫ
	ДобавитьОбъектыМетаданных(Строки, Метаданные.РегистрыСведений,
		НСтр("ru = 'РегистрыСведений'"), НСтр("ru = 'Регистры сведений'"),
		БиблиотекаКартинок.РегистрСведений);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыМетаданных

&НаКлиенте
Процедура ОбъектыМетаданныхВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Строка = ОбъектыМетаданных.НайтиПоИдентификатору(Значение);
	Если Строка = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка при инициализации выбранной строки!'");
	КонецЕсли;
	
	Если ПустаяСтрока(Строка.ПолноеИмя) Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Строка.ПолноеИмя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьОбъектыМетаданных(Дерево, КлассОМ, Имя, Синоним, Картинка)
	
	Если Не КлассОМ.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Дерево.Добавить();
	НоваяСтрока.Имя = Имя;
	НоваяСтрока.Синоним = Синоним;
	НоваяСтрока.Картинка = Картинка;
	
	Строки = НоваяСтрока.ПолучитьЭлементы();
	Для Каждого ОбъектОМ Из КлассОМ Цикл
		
		НоваяСтрока = Строки.Добавить();
		НоваяСтрока.ПолноеИмя = ОбъектОМ.ПолноеИмя();
		НоваяСтрока.Имя = ОбъектОМ.Имя;
		НоваяСтрока.Синоним = ОбъектОМ.Синоним;
		НоваяСтрока.Картинка = Картинка;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти