///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоПолноправныйПользователь = кфкОбщегоНазначенияСлужебный.ЭтоПолноправныйПользователь();
	Элементы.ВернутьВОчередь.Доступность = ЭтоПолноправныйПользователь;
	Элементы.ФормаВернутьВОчередь.Доступность = ЭтоПолноправныйПользователь;
	Элементы.ОбработатьСообщение.Доступность = ЭтоПолноправныйПользователь;
	Элементы.ФормаОбработатьСообщение.Доступность = ЭтоПолноправныйПользователь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Элементы.ФормаОбработатьСообщение.Доступность = ЭтоПолноправныйПользователь
		И Элемент.ВыделенныеСтроки.Количество() = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВернутьВОчередь(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Сбрасывается статус ошибки…'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ВернутьВОчередьНаСервере(Элементы.Список.ВыделенныеСтроки),
		Новый ОписаниеОповещения("ЗавершитьФоновуюОперацию", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбработкаДоступна() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучнойОбработки();
		Возврат;
	КонецЕсли;
	
	ОбработатьСообщениеНаСервере(ВыделенныеСтроки[0]);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#Область УдалитьСообщения

&НаКлиенте
Асинх Процедура УдалитьВыделенныеСообщения(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано ни одного сообщения.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ОбработкаДоступна() Тогда
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучнойОбработки();
		Возврат;
	КонецЕсли;
	
	Ответ = Ждать ВопросАсинх(
		СтрШаблон(НСтр("ru = 'Удалить %1 выделенных сообщений?'"), ВыделенныеСтроки.Количество()),
		РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет, НСтр("ru = 'Удаление сообщений'"),
		КодВозвратаДиалога.Нет); // КодВозвратаДиалога
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Интерактивное удаление исходящих сообщений…'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		УдалитьВыделенныеСообщенияНаСервере(ВыделенныеСтроки),
		Новый ОписаниеОповещения("ЗавершитьФоновуюОперацию", ЭтотОбъект),
		ПараметрыОжидания);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьОтфильтрованныеСообщения(Команда)
	
	ОчиститьСообщения();
	
	Запрос = СформироватьОписаниеЗапроса();
	Если Запрос.Параметры.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не установлены фильтры для удаления сообщений.'"));
		Возврат;
	КонецЕсли;
	
	КоличествоСообщений = КоличествоПоОписаниюЗапроса(Запрос);
	Если КоличествоСообщений = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет сообщений для удаления.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ОбработкаДоступна() Тогда
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучнойОбработки();
		Возврат;
	КонецЕсли;
	
	Ответ = Ждать ВопросАсинх(
		СтрШаблон(НСтр("ru = 'Удалить %1 сообщений?'"), КоличествоСообщений),
		РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет, НСтр("ru = 'Удаление сообщений'"),
		КодВозвратаДиалога.Нет); // КодВозвратаДиалога
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Интерактивное удаление исходящих сообщений…'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		УдалитьОтфильтрованныеСообщенияНаСервере(Запрос),
		Новый ОписаниеОповещения("ЗавершитьФоновуюОперацию", ЭтотОбъект),
		ПараметрыОжидания);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОчиститьРегистр(Команда)
	
	ОчиститьСообщения();
	
	Если Не ОбработкаДоступна() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучнойОбработки();
		Возврат;
	КонецЕсли;
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Очистить все сообщения?'"),
		РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет, НСтр("ru = 'Удаление сообщений'"),
		КодВозвратаДиалога.Нет); // КодВозвратаДиалога
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Интерактивное удаление исходящих сообщений…'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ОчиститьРегистрНаСервере(),
		Новый ОписаниеОповещения("ЗавершитьФоновуюОперацию", ЭтотОбъект),
		ПараметрыОжидания);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Завершить фоновую операцию над регистром
// 
// Параметры:
//	Результат - Структура - Результат:
//		* Статус - Строка - Статус
//		* ИнформацияОбОшибке - ИнформацияОбОшибке - Информация об ошибке
//		* ПодробноеПредставлениеОшибки - Строка - Подробное представление ошибки
//		* КраткоеПредставлениеОшибки - Строка - Краткое представление ошибки
//	ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ЗавершитьФоновуюОперацию(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка выполнения операции над регистром'"));
		КонецЕсли;
		
		Возврат;
		 
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработкаДоступна()
	Возврат (ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции")
				Или Не кфкФоновыеОперацииСлужебный.РегламентноеЗадание().Использование)
			И кфкФоновыеОперацииСлужебный.ПолучитьПотоки(СостояниеФоновогоЗадания.Активно).Количество() = 0;
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьВОчередьНаСервере(Знач КлючиЗаписей)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Сброс статус ошибки (Kafka)'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"РегистрыСведений.кфкВходящиеСообщения.СброситьСтатусОшибки",
		КлючиЗаписей);

КонецФункции

&НаСервереБезКонтекста
Функция УдалитьВыделенныеСообщенияНаСервере(Знач КлючиЗаписей)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Интерактивное удаление исходящих сообщений (Kafka)'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"РегистрыСведений.кфкВходящиеСообщения.УдалитьСообщения",
		КлючиЗаписей);

КонецФункции

&НаСервереБезКонтекста
Функция УдалитьОтфильтрованныеСообщенияНаСервере(ОписаниеЗапроса)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Интерактивное удаление исходящих сообщений (Kafka)'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"РегистрыСведений.кфкВходящиеСообщения.УдалитьСообщения",
		ОписаниеЗапроса);
	
КонецФункции

&НаСервереБезКонтекста
Функция ОчиститьРегистрНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Интерактивное удаление исходящих сообщений (Kafka)'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"РегистрыСведений.кфкВходящиеСообщения.ОчиститьРегистр");

КонецФункции

&НаСервереБезКонтекста
Функция КоличествоПоОписаниюЗапроса(ОписаниеЗапроса)
	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(ОписаниеЗапроса.Текст);
	ЗапросВыборки = Схема.ПакетЗапросов[0].Операторы[0];
	ЗапросВыборки.ВыбираемыеПоля.Очистить();
	ЗапросВыборки.ВыбираемыеПоля.Добавить("Количество(*)");
	
	Запрос = Новый Запрос;
	Запрос.Текст = Схема.ПолучитьТекстЗапроса();
	
	Для Каждого Параметр Из ОписаниеЗапроса.Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось получить количество записей'");
	КонецЕсли;
	
	Возврат Выборка[0]; // Число
	
КонецФункции

&НаСервере
Процедура ОбработатьСообщениеНаСервере(Сообщение)
	
	кфкФоновыеОперацииСлужебный.ДесериализацияСообщения(Сообщение);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция СформироватьОписаниеЗапроса()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКД = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	НастройкиКД.Структура.Очистить();
	ГруппировкаКД = НастройкиКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Для Каждого Измерение Из Метаданные.РегистрыСведений.кфкВходящиеСообщения.Измерения Цикл
		Поле = ГруппировкаКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		Поле.Поле = Новый ПолеКомпоновкиДанных(Измерение.Имя);
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикМакета.Выполнить(Схема, НастройкиКД);
	
	ПараметрыЗапроса = Новый Структура;
	Для Каждого Параметр Из МакетКД.ЗначенияПараметров Цикл
		ПараметрыЗапроса.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;
	
	Запрос = Новый Структура;
	Запрос.Вставить("Текст", МакетКД.НаборыДанных[0].Запрос);
	Запрос.Вставить("Параметры", ПараметрыЗапроса);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти