///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// инициализация нового
	Если Объект.Ссылка.Пустая() Тогда
		Ключи = ОбщегоНазначения.ВыгрузитьКолонку(Объект.ПараметрыКонсьюмера, "Ключ");
		Для Каждого Параметр Из СтандартныеПараметрыКонсьюмера() Цикл
			Если Ключи.Найти(Параметр.Ключ) = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Объект.ПараметрыКонсьюмера.Добавить(), Параметр);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// инициализация оформление формы
	УстановитьУсловноеОформление();
	
	// инициализация параметров
	СвойстваLibrdKafka = кфкИнтеграцияСлужебныйПовтИсп.СвойстваLibrdKafka("C");
	ЗаполнитьЗначенияПредставления();
	
	// формат десериализации КД
	ПространстваИмен = кфкИнтеграцияСлужебныйПовтИсп.ПространстваИменПакетовXDTO();
	Элементы.ТопикиФорматДесериализации.СписокВыбора.ЗагрузитьЗначения(Новый Массив(ПространстваИмен));
	
	// менеджер обмена КД
	ИменаОбщихМодулей = кфкИнтеграцияСлужебныйПовтИсп.ПолучитьИменаОбщихМодулей();
	Элементы.ТопикиИмяМодуляДесериализации.СписокВыбора.ЗагрузитьЗначения(Новый Массив(ИменаОбщихМодулей));
	
	// проверка доступности
	Для Каждого Элемент Из Элементы.ФормаГруппаЗапуска.ПодчиненныеЭлементы Цикл
		Элемент.Доступность = Не ТолькоПросмотр;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
	УстановитьВидимостьСериализации();
	
	// доступные топики
	кфкИнтеграцияСлужебныйКлиент.ЗаполнитьСписокВыбораТопиков(Объект.Брокер, Элементы.ТопикиТопик,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ЗаполнитьСписокВыбораТопиков(Объект.Брокер, Элементы.ТопикиТопик,
		УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТопики

&НаКлиенте
Процедура ТопикиПриАктивизацииСтроки(Элемент)
	
	ИнициализироватьПравилаОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)

	Если Копирование Тогда
		
		Отказ = Истина;
		
		НоваяСтрока = Объект.Топики.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.ТекущиеДанные, , "НомерСтроки,Топик,ИмяПОДДесериализации"); // ИмяМетодаДесериализации
		
		Элементы.Топики.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элементы.Топики.ТекущийЭлемент = Элементы.ТопикиТопик;
		Элементы.Топики.ИзменитьСтроку();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиТопикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСписокаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиТипДесериализацииПриИзменении(Элемент)
	
	ИнициализироватьПравилаОбмена();
	
	УстановитьВидимостьСериализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиИмяМетодаДесериализацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.кфкКонсьюмеры.Форма.ФормаВводаОбработчика",
		Новый Структура("ИмяМетода", Элемент.ТекстРедактирования), ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗавершитьВводаОбработчика", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ТопикиФорматДесериализацииПриИзменении(Элемент)
	
	ИнициализироватьПравилаОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиФорматДесериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСписокаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиИмяМодуляДесериализацииПриИзменении(Элемент)
	
	ИнициализироватьПравилаОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиИмяМодуляДесериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСписокаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиИмяПОДДесериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСписокаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыКонсьюмера

&НаКлиенте
Процедура ПараметрыКонсьюмераПриАктивизацииСтроки(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонсьюмераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование,
		Родитель, ЭтоГруппа, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонсьюмераКлючПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонсьюмераКлючНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора,
		ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонсьюмераКлючАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора,
		ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонсьюмераЗначениеПредставлениеПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПараметрыКонсьюмераЗначениеПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеНачалоВыбора(ЭтотОбъект, Элемент,
		ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьЧтение(Команда)
	
	ОчиститьСообщения();
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Консьюмер был изменен. Для начала чтения сообщений сохраните настройки.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗапускДоступен() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучногоЗадания();
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьЧтениеНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершитьПоток", ЭтотОбъект),
		ПараметрыОжидания);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьДесериализацию(Команда)
	
	ОчиститьСообщения();
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Консьюмер был изменен. Для начала десериализации сообщений сохраните настройки.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗапускДоступен() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучногоЗадания();
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьДесериализациюНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершитьПоток", ЭтотОбъект),
		ПараметрыОжидания);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеПараметрыКонсьюмера(Команда)
	
	Объект.ПараметрыКонсьюмера.Очистить();
	
	Для Каждого Параметр Из СтандартныеПараметрыКонсьюмера() Цикл
		НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
		НоваяСтрока.ЗначениеПредставление = Параметр.Значение;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#Область Блокировка

&НаКлиенте
Процедура БлокироватьЧтение(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьЧтение = Не Объект.БлокироватьЧтение;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура БлокироватьДесериализацию(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьДесериализацию = Не Объект.БлокироватьДесериализацию;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ФормаГруппаБлокировка.Доступность = Не Объект.Ссылка.Пустая();
	Элементы.ФормаБлокироватьЧтение.Пометка = Объект.БлокироватьЧтение;
	Элементы.ФормаБлокироватьДесериализацию.Пометка = Объект.БлокироватьДесериализацию;
	
	Элементы.ДекорацияБлокироватьЧтение.Видимость = Объект.БлокироватьЧтение;
	Элементы.ДекорацияБлокироватьДесериализацию.Видимость = Объект.БлокироватьДесериализацию;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСериализации()
	
	// ПроизвольныйОбработчик
	ТипДесериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.ПроизвольныйОбработчик");
	Строки = Объект.Топики.НайтиСтроки(Новый Структура("ТипДесериализации", ТипДесериализации));
	Элементы.ТопикиИмяМетодаДесериализации.Видимость = Строки.Количество() > 0;
	
	// КонвертацияДанных
	ТипДесериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.КонвертацияДанных");
	Строки = Объект.Топики.НайтиСтроки(Новый Структура("ТипДесериализации", ТипДесериализации));
	Элементы.ТопикиГруппаДесериализацияКД.Видимость = Строки.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПоток(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить проверку подключения к брокеру.'"));
		КонецЕсли;
		
		Возврат;
		 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводаОбработчика(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Топики.ТекущиеДанные;
	ТекущиеДанные.ИмяМетодаДесериализации = РезультатЗакрытия;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьПравилаОбмена()
	
	ТекущиеДанные = Элементы.Топики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ПустаяСтрока(ТекущиеДанные.ИмяМодуляДесериализации) Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	КлючПравилОбмена = ТекущиеДанные.ИмяМодуляДесериализации + ":" + ТекущиеДанные.ФорматДесериализации;
	
	СписокВыбора = Элементы.ТопикиИмяПОДДесериализации.СписокВыбора;
	СписокВыбора.Очистить();
	
	ПОДы = ?(ПравилаОбработкиДанных = Неопределено, Неопределено,
		ПравилаОбработкиДанных.Получить(КлючПравилОбмена)); // Неопределено, Массив
	Если ПОДы = Неопределено Тогда
		
		ПОДы = ДоступныеПОДы(ТекущиеДанные.ФорматДесериализации, ТекущиеДанные.ИмяМодуляДесериализации); // Неопределено, Массив
		
		Правила = ?(ПравилаОбработкиДанных = Неопределено, Новый Соответствие, Новый Соответствие(ПравилаОбработкиДанных));
		Правила.Вставить(КлючПравилОбмена, ПОДы);
		ПравилаОбработкиДанных = Новый ФиксированноеСоответствие(Правила);
		
	КонецЕсли;
	
	Если ТипЗнч(ПОДы) = Тип("Массив") Тогда
		СписокВыбора.ЗагрузитьЗначения(ПОДы);
		
	ИначеЕсли ТекущиеДанные.ТипДесериализации
			= ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.КонвертацияДанных") Тогда
		НомерСтроки = ТекущиеДанные.НомерСтроки;
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
			НСтр("ru = 'Имя модуля'"), НомерСтроки, НСтр("ru = 'Объекты метаданных'"),
			СтрШаблон(НСтр("ru = '''%1'' - не найден'"), ТекущиеДанные.ИмяМодуляДесериализации));
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Топики", НомерСтроки,
			"ИмяМодуляДесериализации");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , Поле, "Объект");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтандартныеПараметрыКонсьюмера()
	
	Результат = Новый Соответствие;
	Результат.Вставить("auto.offset.reset", "earliest");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапускДоступен()
	Возврат Не ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции");
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьЧтениеНаСервере(Консьюмер, Идентификатор)
	Возврат кфкФоновыеОперацииСлужебный.ЗапуститьПотокИнтерактивно(Консьюмер, Ложь, Идентификатор);
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьДесериализациюНаСервере(Консьюмер, Идентификатор)
	Возврат кфкФоновыеОперацииСлужебный.ЗапуститьПотокИнтерактивно(Консьюмер, Истина, Идентификатор);
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеПОДы(XMLСхема, МенеджерОбмена)
	
	Если Метаданные.ОбщиеМодули.Найти(МенеджерОбмена) = Неопределено Тогда
		Возврат МенеджерОбмена + ":" + XMLСхема;
	КонецЕсли;
	
	КомпонентыОбмена = кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Получение");
	КомпонентыОбмена.XMLСхема = XMLСхема;
	КомпонентыОбмена.МенеджерОбмена = ОбщегоНазначения.ОбщийМодуль(МенеджерОбмена);
	ПОДы = кфкОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных(КомпонентыОбмена);
	
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(ПОДы, "Имя");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗначенияПредставления()
	
	Если СвойстваLibrdKafka = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Объект.ПараметрыКонсьюмера Цикл // ТекущийОбъект
		
		Свойство = СвойстваLibrdKafka.Получить(Строка.Ключ); // см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
		ТипЗначения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойство, "ТипЗначения");
		Строка.ЗначениеПредставление = ?(ТипЗначения = "int" Или ТипЗначения = "float",
			СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.Значение), Строка.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// ПроизвольныйОбработчик
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ТопикиИмяМетодаДесериализации.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Топики.ТипДесериализации");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	
	// ПроизвольныйОбработчик
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ТопикиФорматДесериализации.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ТопикиИмяМодуляДесериализации.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ТопикиИмяПОДДесериализации.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Топики.ТипДесериализации");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.кфкТипыОбработчиков.КонвертацияДанных;
	
КонецПроцедуры

#КонецОбласти