///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// инициализация нового
	Если Объект.Ссылка.Пустая() Тогда
		Ключи = ОбщегоНазначения.ВыгрузитьКолонку(Объект.ПараметрыКонсьюмера, "Ключ");
		Для Каждого Параметр Из СтандартныеПараметрыКонсьюмера() Цикл
			Если Ключи.Найти(Параметр.Ключ) = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Объект.ПараметрыКонсьюмера.Добавить(), Параметр);
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	// инициализация оформление формы
	УстановитьУсловноеОформление();

	// инициализация параметров
	СвойстваLibrdKafka = кфкИнтеграцияСлужебныйПовтИсп.СвойстваLibrdKafka("C");
	ЗаполнитьЗначенияПредставления();

	// формат десериализации КД
	ПространстваИмен = Новый Массив(кфкИнтеграцияСлужебныйПовтИсп.ПространстваИменПакетовXDTO());
	Элементы.ФорматДесериализации.СписокВыбора.ЗагрузитьЗначения(ПространстваИмен);
	Элементы.ТопикиФорматДесериализации.СписокВыбора.ЗагрузитьЗначения(ПространстваИмен);

	// менеджер обмена КД
	ИменаОбщихМодулей = Новый Массив(кфкИнтеграцияСлужебныйПовтИсп.ИменаМенеджеровОбмена());
	Элементы.ИмяМодуляДесериализации.СписокВыбора.ЗагрузитьЗначения(ИменаОбщихМодулей);
	Элементы.ТопикиИмяМодуляДесериализации.СписокВыбора.ЗагрузитьЗначения(ИменаОбщихМодулей);

	// проверка доступности
	Для Каждого Элемент Из Элементы.ФормаГруппаЗапуска.ПодчиненныеЭлементы Цикл
		Элемент.Доступность = Не ТолькоПросмотр;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
	УстановитьВидимостьСериализации();
	
	// доступные топики
	кфкИнтеграцияСлужебныйКлиент.ЗаполнитьСписокВыбораТопиков(ЭтотОбъект, Элементы.ТопикиТопик);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ЗаполнитьСписокВыбораТопиков(ЭтотОбъект, Элементы.ТопикиТопик);
	
КонецПроцедуры

#Область НастройкиДесериализацииПоУмолчанию

&НаКлиенте
Процедура ТипДесериализацииПриИзменении(Элемент)

	УстановитьВидимостьСериализации();

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ИмяМетодаДесериализацииПриИзменении(Элемент)

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ИмяМетодаДесериализацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОткрытьФорму("Справочник.кфкКонсьюмеры.Форма.ФормаВводаОбработчика",
		Новый Структура("ИмяМетода", Элемент.ТекстРедактирования), ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗавершитьВводаОбработчика", ЭтотОбъект, Истина),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ФорматДесериализацииПриИзменении(Элемент)

	ИнициализироватьПравилаОбмена();

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ФорматДесериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
		СтандартнаяОбработка)

	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ИмяМодуляДесериализацииПриИзменении(Элемент)

	ИнициализироватьПравилаОбмена();

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ИмяМодуляДесериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
		СтандартнаяОбработка)

	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТопики

&НаКлиенте
Процедура ТопикиПриАктивизацииСтроки(Элемент)
	
	ИнициализироватьПравилаОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)

	Если Копирование Тогда
		
		Отказ = Истина;
		
		НоваяСтрока = Объект.Топики.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.ТекущиеДанные, ,
			"НомерСтроки,Топик,ИмяПОДДесериализации"); // ИмяМетодаДесериализации
		
		Элементы.Топики.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элементы.Топики.ТекущийЭлемент = Элементы.ТопикиТопик;
		Элементы.Топики.ИзменитьСтроку();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиТопикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиТипДесериализацииПриИзменении(Элемент)

	ИнициализироватьПравилаОбмена();

	УстановитьВидимостьСериализации();

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ТопикиИмяМетодаДесериализацииПриИзменении(Элемент)

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ТопикиИмяМетодаДесериализацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
		СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.Топики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьФорму("Справочник.кфкКонсьюмеры.Форма.ФормаВводаОбработчика",
		Новый Структура("ИмяМетода", Элемент.ТекстРедактирования), ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗавершитьВводаОбработчика", ЭтотОбъект, Ложь),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ТопикиФорматДесериализацииПриИзменении(Элемент)

	ИнициализироватьПравилаОбмена();

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ТопикиФорматДесериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
		Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиИмяМодуляДесериализацииПриИзменении(Элемент)

	ИнициализироватьПравилаОбмена();

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ТопикиИмяМодуляДесериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
		Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТопикиИмяПОДДесериализацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
		Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.АвтоПодборСпискаВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыКонсьюмера

&НаКлиенте
Процедура ПараметрыКонсьюмераПриАктивизацииСтроки(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонсьюмераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование,
		Родитель, ЭтоГруппа, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонсьюмераКлючПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонсьюмераКлючНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора,
		ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонсьюмераКлючАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
		СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора,
		ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонсьюмераЗначениеПредставлениеПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПараметрыКонсьюмераЗначениеПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
		СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеНачалоВыбора(ЭтотОбъект, Элемент,
		ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьЧтение(Команда)
	
	ОчиститьСообщения();
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Консьюмер был изменен. Для начала чтения сообщений сохраните настройки.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗапускДоступен() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучногоЗадания();
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьЧтениеНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершитьПоток", ЭтотОбъект),
		ПараметрыОжидания);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьДесериализацию(Команда)
	
	ОчиститьСообщения();
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Консьюмер был изменен. Для начала десериализации сообщений сохраните настройки.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗапускДоступен() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучногоЗадания();
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьДесериализациюНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершитьПоток", ЭтотОбъект),
		ПараметрыОжидания);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеПараметрыКонсьюмера(Команда)
	
	Объект.ПараметрыКонсьюмера.Очистить();
	
	Для Каждого Параметр Из СтандартныеПараметрыКонсьюмера() Цикл
		НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
		НоваяСтрока.ЗначениеПредставление = Параметр.Значение;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#Область Блокировка

&НаКлиенте
Процедура БлокироватьЧтение(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьЧтение = Не Объект.БлокироватьЧтение;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура БлокироватьДесериализацию(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьДесериализацию = Не Объект.БлокироватьДесериализацию;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ФормаГруппаБлокировка.Доступность = Не Объект.Ссылка.Пустая();
	Элементы.ФормаБлокироватьЧтение.Пометка = Объект.БлокироватьЧтение;
	Элементы.ФормаБлокироватьДесериализацию.Пометка = Объект.БлокироватьДесериализацию;
	
	Элементы.ГруппаДекорацияБлокироватьЧтение.Видимость = Объект.БлокироватьЧтение;
	Элементы.ГруппаДекорацияБлокироватьДесериализацию.Видимость = Объект.БлокироватьДесериализацию;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСериализации()

	// НастройкиПоУмолчанию
	ТипДесериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.ПустаяСсылка");
	Строки = Объект.Топики.НайтиСтроки(Новый Структура("ТипДесериализации", ТипДесериализации));
	ИспользуетсяНастройкаПоУмолчанию = Объект.Топики.Количество() = 0 Или Строки.Количество() > 0;

	// ПроизвольныйОбработчик
	ТипДесериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.ПроизвольныйОбработчик");
	Строки = Объект.Топики.НайтиСтроки(Новый Структура("ТипДесериализации", ТипДесериализации));
	Элементы.ТопикиИмяМетодаДесериализации.Видимость = Строки.Количество() > 0
		Или ИспользуетсяНастройкаПоУмолчанию И ТипДесериализации = Объект.ТипДесериализации;

	// КонвертацияДанных
	ТипДесериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.КонвертацияДанных");
	Строки = Объект.Топики.НайтиСтроки(Новый Структура("ТипДесериализации", ТипДесериализации));
	Элементы.ТопикиГруппаДесериализацияКД.Видимость = Строки.Количество() > 0
		Или ИспользуетсяНастройкаПоУмолчанию И ТипДесериализации = Объект.ТипДесериализации;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПоток(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Возникла ошибка при завершении потока.'"));
		КонецЕсли;
		
		Возврат;
		 
	КонецЕсли;
	
КонецПроцедуры

// Принимает имя процедуры из формы ввода обработчика.
//
// Параметры:
//  РезультатЗакрытия - Строка, Неопределено - имя процедуры или отмена выбора.
//  ЭтоПоУмолчанию - Булево - изменять общий метод вместо метода текущего топика.
&НаКлиенте
Процедура ЗавершитьВводаОбработчика(РезультатЗакрытия, ЭтоПоУмолчанию) Экспорт

	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоПоУмолчанию Тогда
		Объект.ИмяМетодаДесериализации = РезультатЗакрытия;

	Иначе
		ТекущиеДанные = Элементы.Топики.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;

		ТекущиеДанные.ИмяМетодаДесериализации = РезультатЗакрытия;

	КонецЕсли;

	Модифицированность = Истина;

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьПравилаОбмена()

	ОчиститьСообщения();

	СписокВыбора = Элементы.ТопикиИмяПОДДесериализации.СписокВыбора;
	СписокВыбора.Очистить();

	ТекущиеДанные = Элементы.Топики.ТекущиеДанные;
	ИмяМодуляДесериализации = ?(ТекущиеДанные = Неопределено Или ПустаяСтрока(ТекущиеДанные.ИмяМодуляДесериализации),
		Объект.ИмяМодуляДесериализации, ТекущиеДанные.ИмяМодуляДесериализации);
	ФорматДесериализации = ?(ТекущиеДанные = Неопределено Или ПустаяСтрока(ТекущиеДанные.ФорматДесериализации),
		Объект.ФорматДесериализации, ТекущиеДанные.ФорматДесериализации);
	Если ПустаяСтрока(ИмяМодуляДесериализации) Или ПустаяСтрока(ФорматДесериализации) Тогда
		Возврат;
	КонецЕсли;

	КлючПравилОбмена = ИмяМодуляДесериализации + ":" + ФорматДесериализации;

	ПОДы = ?(ПравилаОбработкиДанных = Неопределено, Неопределено,
		ПравилаОбработкиДанных.Получить(КлючПравилОбмена)); // Неопределено, Массив из Строка, Строка
	Если ПОДы = Неопределено Тогда

		ПОДы = ДоступныеПОДы(
			ФорматДесериализации,
			ИмяМодуляДесериализации); // Массив из Строка, Строка

		Правила = ?(ПравилаОбработкиДанных = Неопределено,
			Новый Соответствие, Новый Соответствие(ПравилаОбработкиДанных));
		Правила.Вставить(КлючПравилОбмена, ПОДы);
		ПравилаОбработкиДанных = Новый ФиксированноеСоответствие(Правила);

	КонецЕсли;

	Если ТипЗнч(ПОДы) = Тип("Массив") Тогда
		СписокВыбора.ЗагрузитьЗначения(ПОДы);
		Возврат;
	КонецЕсли;

	ТипДесериализации = ?(ТекущиеДанные = Неопределено Или ТекущиеДанные.ТипДесериализации.Пустая(),
		Объект.ТипДесериализации, ТекущиеДанные.ТипДесериализации);
	Если ТекущиеДанные <> Неопределено
			И ТипДесериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.КонвертацияДанных") Тогда
		//@skip-check bsl-legacy-check-dynamic-feature-access
		НомерСтроки = ТекущиеДанные.НомерСтроки;
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
			НСтр("ru = 'Имя модуля'"), НомерСтроки, НСтр("ru = 'Топики'"),
			СтрШаблон(НСтр("ru = '''%1'' - не найден'"), ИмяМодуляДесериализации));
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Топики", НомерСтроки,
			"ИмяМодуляДесериализации");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , Поле, "Объект");
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтандартныеПараметрыКонсьюмера()
	
	Результат = Новый Соответствие;
	Результат.Вставить("auto.offset.reset", "earliest");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапускДоступен()
	Возврат Не ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции");
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьЧтениеНаСервере(Знач Консьюмер, Знач Идентификатор)
	Возврат кфкФоновыеОперацииСлужебный.ЗапуститьПотокИнтерактивно(Консьюмер, Ложь, Идентификатор);
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьДесериализациюНаСервере(Знач Консьюмер, Знач Идентификатор)
	Возврат кфкФоновыеОперацииСлужебный.ЗапуститьПотокИнтерактивно(Консьюмер, Истина, Идентификатор);
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеПОДы(Знач XMLСхема, Знач МенеджерОбмена)

	Возврат кфкОбменДаннымиXDTOСервер.ИменаПравилОбработкиДанных(МенеджерОбмена, "Получение", XMLСхема);

КонецФункции

&НаСервере
Процедура ЗаполнитьЗначенияПредставления()
	
	Если СвойстваLibrdKafka = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Объект.ПараметрыКонсьюмера Цикл // ТекущийОбъект
		
		Свойство = СвойстваLibrdKafka.Получить(Строка.Ключ); // см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
		ТипЗначения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойство, "ТипЗначения");
		Строка.ЗначениеПредставление = ?(ТипЗначения = "int" Или ТипЗначения = "float",
			СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.Значение), Строка.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	// ПроизвольныйОбработчик
	Элемент = УсловноеОформление.Элементы.Добавить();
	//	* Оформление
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	//	* Поля
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
		Элементы.ТопикиИмяМетодаДесериализации.Имя);
	//	* Отбор/Группа
	// НЕ ПроизвольныйОбработчик:
	//		НЕ (
	//			Строка.ТипДесериализации=ПроизвольныйОбработчик
	//			ИЛИ (Строка.ТипДесериализации=ПустаяСсылка И ТипДесериализации=ПроизвольныйОбработчик)
	//		)
	ГруппаИсключение = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор, "Исключение",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе);
	Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаИсключение, "Условие",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	//	* Отбор/Элементы: Строка.ТипДесериализации=ПроизвольныйОбработчик
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Объект.Топики.ТипДесериализации",
		Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик);
	//	* Отбор/Элементы: Строка.ТипДесериализации=ПустаяСсылка И ТипДесериализации=ПроизвольныйОбработчик
	ГруппаПоУмолчанию = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Группа, "ПоУмолчанию",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию,
		"Объект.Топики.ТипДесериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию, "Объект.ТипДесериализации",
		Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик);

	// КонвертацияДанных
	Элемент = УсловноеОформление.Элементы.Добавить();
	//	* Оформление
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	//	* Поля
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
		Элементы.ТопикиФорматДесериализации.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
		Элементы.ТопикиИмяМодуляДесериализации.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
		Элементы.ТопикиИмяПОДДесериализации.Имя);
	//	* Отбор/Группа
	// НЕ КонвертацияДанных:
	//		НЕ (
	//			Строка.ТипДесериализации=КонвертацияДанных
	//			ИЛИ (Строка.ТипДесериализации=ПустаяСсылка И ТипДесериализации=КонвертацияДанных)
	//		)
	ГруппаИсключение = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор, "Исключение",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе);
	Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаИсключение, "Условие",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	//	* Отбор/Элементы: Строка.ТипДесериализации=КонвертацияДанных
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Объект.Топики.ТипДесериализации",
		Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
	//	* Отбор/Элементы: Строка.ТипДесериализации=ПустаяСсылка И ТипДесериализации=КонвертацияДанных
	ГруппаПоУмолчанию = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Группа, "ПоУмолчанию",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию,
		"Объект.Топики.ТипДесериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию, "Объект.ТипДесериализации",
		Перечисления.кфкТипыОбработчиков.КонвертацияДанных);

	// НастройкиПоУмолчанию
	//  * ТипДесериализации
	Если Не Объект.ТипДесериализации.Пустая() Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		//	* Оформление
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Объект.ТипДесериализации);
		//	* Поля
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
			Элементы.ТопикиТипДесериализации.Имя);
		//	* Отбор
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.Топики.ТипДесериализации", ,
			ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	//  * ИмяМетодаДесериализации
	Если Не ПустаяСтрока(Объект.ИмяМетодаДесериализации) Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		//	* Оформление
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Объект.ИмяМетодаДесериализации);
		//	* Поля
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
			Элементы.ТопикиИмяМетодаДесериализации.Имя);
		//	* Отбор/ПроизвольныйОбработчик
		// ПроизвольныйОбработчик:
		//		Строка.ТипДесериализации=ПроизвольныйОбработчик
		//		ИЛИ (Строка.ТипДесериализации=ПустаяСсылка И ТипДесериализации=ПроизвольныйОбработчик)
		Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор, "Условие",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		//	* Отбор/ПроизвольныйОбработчик: Строка.ТипДесериализации=ПроизвольныйОбработчик
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Объект.Топики.ТипДесериализации",
			Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик);
		//	* Отбор/ПроизвольныйОбработчик: Строка.ТипДесериализации=ПустаяСсылка И ТипДесериализации=ПроизвольныйОбработчик
		ГруппаПоУмолчанию = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Группа, "ПоУмолчанию",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию,
			"Объект.Топики.ТипДесериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию, "Объект.ТипДесериализации",
			Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик);
		//	* Отбор/ИмяМетодаДесериализации
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"Объект.Топики.ИмяМетодаДесериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	//  * ИмяМодуляДесериализации
	Если Не ПустаяСтрока(Объект.ИмяМодуляДесериализации) Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		//	* Оформление
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Объект.ИмяМодуляДесериализации);
		//	* Поля
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
			Элементы.ТопикиИмяМодуляДесериализации.Имя);
		//	* Отбор/КонвертацияДанных
		// КонвертацияДанных:
		//		Строка.ТипДесериализации=КонвертацияДанных
		//		ИЛИ (Строка.ТипДесериализации=ПустаяСсылка И ТипДесериализации=КонвертацияДанных)
		Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор, "Условие",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		//	* Отбор/КонвертацияДанных: Строка.ТипДесериализации=КонвертацияДанных
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Объект.Топики.ТипДесериализации",
			Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
		//	* Отбор/КонвертацияДанных: Строка.ТипДесериализации=ПустаяСсылка И ТипДесериализации=КонвертацияДанных
		ГруппаПоУмолчанию = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Группа, "ПоУмолчанию",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию,
			"Объект.Топики.ТипДесериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию, "Объект.ТипДесериализации",
			Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
		//	* Отбор/ИмяМодуляДесериализации
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"Объект.Топики.ИмяМодуляДесериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	//  * ФорматДесериализации
	Если Не ПустаяСтрока(Объект.ФорматДесериализации) Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		//	* Оформление
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Объект.ФорматДесериализации);
		//	* Поля
		Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(
			Элементы.ТопикиФорматДесериализации.Имя);
		//	* Отбор/КонвертацияДанных
		// КонвертацияДанных:
		//		Строка.ТипДесериализации=КонвертацияДанных
		//		ИЛИ (Строка.ТипДесериализации=ПустаяСсылка И ТипДесериализации=КонвертацияДанных)
		Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор, "Условие",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		//	* Отбор/КонвертацияДанных: Строка.ТипДесериализации=КонвертацияДанных
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Объект.Топики.ТипДесериализации",
			Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
		//	* Отбор/КонвертацияДанных: Строка.ТипДесериализации=ПустаяСсылка И ТипДесериализации=КонвертацияДанных
		ГруппаПоУмолчанию = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Группа, "ПоУмолчанию",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию,
			"Объект.Топики.ТипДесериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаПоУмолчанию, "Объект.ТипДесериализации",
			Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
		//	* Отбор/ФорматДесериализации
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
			"Объект.Топики.ФорматДесериализации", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
