///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура ИспользоватьПакетнуюПубликациюПриИзменении(Элемент)
	
	Если Не Объект.ИспользоватьПакетнуюПубликацию Тогда
		Возврат;
	КонецЕсли;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
	Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Отмена'"));
	
	//@skip-check new-font
	ТекстВопроса = Новый ФорматированнаяСтрока(
		БиблиотекаКартинок.ОформлениеВосклицательныйЗнак, БиблиотекаКартинок.ОформлениеВосклицательныйЗнак,
			БиблиотекаКартинок.ОформлениеВосклицательныйЗнак, Символы.Таб,
		Новый ФорматированнаяСтрока(НСтр("ru = 'Пакетная публикация не гарантирует отправку всех сообщений!'"),
																					Новый Шрифт(,, Истина)), Символы.ПС,
		Символы.ПС,
		Новый ФорматированнаяСтрока(НСтр("ru = 'Подробнее см. Simple Kafka Connector 1C'"), , , ,
																"https://github.com/NuclearAPK/Simple-Kafka_Adapter"));
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, Кнопки, 30, КодВозвратаДиалога.Нет, НСтр("ru = 'Пакетная публикация'"),
		КодВозвратаДиалога.Нет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.ИспользоватьПакетнуюПубликацию = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
