///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяФорма = Метаданные.Обработки.кфкПанельАдминистрирования.ОсновнаяФорма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПараметры() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Использовать", Ложь);
	
	Результат.Вставить("АдресСервиса", "");
	Результат.Вставить("Префикс", "");
	
	// ИсходящиеСообщения
	Результат.Вставить("ВыгружатьИсходныеДанныеИсходящих", Ложь);
	Результат.Вставить("ВыгружатьЗаголовкиСообщенияИсходящих", Ложь);
	Результат.Вставить("ВыгружатьТелоСообщенияИсходящих", Ложь);
	
	// ВходящиеСообщения
	Результат.Вставить("ВыгружатьЗаголовкиСообщенияВходящих", Ложь);
	Результат.Вставить("ВыгружатьТелоСообщенияВходящие", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПараметрыЛогирования.Использовать КАК Использовать,
	|	кфкПараметрыЛогирования.АдресСервиса КАК АдресСервиса,
	|	кфкПараметрыЛогирования.Префикс КАК Префикс,
	|	кфкПараметрыЛогирования.ВыгружатьЗаголовкиСообщенияВходящих КАК ВыгружатьЗаголовкиСообщенияВходящих,
	|	кфкПараметрыЛогирования.ВыгружатьЗаголовкиСообщенияИсходящих КАК ВыгружатьЗаголовкиСообщенияИсходящих,
	|	кфкПараметрыЛогирования.ВыгружатьИсходныеДанныеИсходящих КАК ВыгружатьИсходныеДанныеИсходящих,
	|	кфкПараметрыЛогирования.ВыгружатьТелоСообщенияВходящие КАК ВыгружатьТелоСообщенияВходящие,
	|	кфкПараметрыЛогирования.ВыгружатьТелоСообщенияИсходящих КАК ВыгружатьТелоСообщенияИсходящих
	|ИЗ
	|	РегистрСведений.кфкПараметрыЛогирования КАК кфкПараметрыЛогирования";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	ИначеЕсли кфкОбщегоНазначенияСлужебный.ЭтоПолноправныйПользователь() Тогда
		ОбновитьПараметры(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьПараметры(НовыеПараметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(Набор.Добавить(), НовыеПараметры);
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать();
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
