///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнициализацияОбмена

// Инициализирует компоненты обмена.
//
// Параметры:
//	НаправлениеОбмена - Строка - направление выполнения обмена: "Отправка" | "Получение".
//
// Возвращаемое значение:
//	Структура - содержит компоненты обмена (правила обмена и параметры обмена):
//	 * НаправлениеОбмена - Строка - "Отправка" или "Получение".
//	 
//	 * ВерсияФорматаОбмена - Строка - номер версии формата обмена.
//	 * XMLСхема - Строка - пространство имен формата обмена.
//	 * ЭтоEnterpriseData - Булево - признак того, что обмен выполняется с EnterpriseData.
//	 * БазовыеСхемыФормата - Соответствие Из КлючИЗначение - содержит соответствие пространств имена базовых схем формата
//	
//	 * МенеджерОбмена - Неопределено, ОбщийМодуль - модуль с правилами конвертации.
//	 * ЭтоМенеджерОбменКФК - Булево - модуль с правилами конвертации является частью КФК
//	 * ВерсияФорматаМенеджераОбмена - Строка - номер версии формата модуля с правилами конвертации.
//	 
//	 * КлючСообщения - Строка - ключ сообщения Kafka.
//	 * СвойстваСообщения - Структура - Дополнительные свойства сообщения.
//	 * ЗаголовкиСообщения - Соответствие Из КлючИЗначение - Заголовки сообщения Kafka.
//	 
//	 * ФлагОшибки - Булево - признак наличия ошибки при выполнении действия обмена.
//	 * ФлагПропустить - Булево - признак пропуска выполнения действия обмена.
//	 * ПротоколКонвертации - Массив Из Строка - список сообщений обмена данными.
//	 * НавигационнаяСсылка - Булево - (Получение) добавление навигационной ссылки в протокол конвертации.
//	 
//	 * ОтключитьПреобразованиеВNull - Булево - (Отправка) 'Истина' cохранять пустые значения без преобразования в null. По умолчанию Ложь (преобразование в null)
//	 * ИспользоватьТранзакции - Булево - (Получение) признак использования транзакций при записи полученных данных.
//	 * ОбменДаннымиЗагрузка - Булево - (Получение) значение устанавливаемого свойства "ОбменДанными.Загрузка".
//	 * ОтключитьМеханизмРегистрации - Булево - (Получение) признак необходимости регистрации данных к обратной отправке.
//
Функция ИнициализироватьКомпонентыОбмена(НаправлениеОбмена) Экспорт
	
	КомпонентыОбмена = Новый Структура;
	КомпонентыОбмена.Вставить("НаправлениеОбмена", НаправлениеОбмена);
	
	// схема обмена
	КомпонентыОбмена.Вставить("ВерсияФорматаОбмена", ""); // для совместимости с КД.Обработки.ВерсияФорматаОбмена.ШаблоныТекстовМодулей.Служебные_ИнициализацияУсловийПримененияПравил
	КомпонентыОбмена.Вставить("XMLСхема", "");
	КомпонентыОбмена.Вставить("ЭтоEnterpriseData", Ложь);
	КомпонентыОбмена.Вставить("БазовыеСхемыФормата", Новый Соответствие);
	
	// правила обмена
	КомпонентыОбмена.Вставить("МенеджерОбмена", Неопределено);
	КомпонентыОбмена.Вставить("ЭтоМенеджерОбменКФК", Ложь);
	КомпонентыОбмена.Вставить("ВерсияФорматаМенеджераОбмена", "");
	
	// Параметры сообщения и дополнительные свойства сообщения.
	КомпонентыОбмена.Вставить("КлючСообщения", "");
	КомпонентыОбмена.Вставить("СвойстваСообщения", Новый Структура);
	КомпонентыОбмена.Вставить("ЗаголовкиСообщения", Новый Соответствие);
	
	// логирование
	КомпонентыОбмена.Вставить("ФлагОшибки", Ложь);
	КомпонентыОбмена.Вставить("ФлагПропустить", Ложь);
	КомпонентыОбмена.Вставить("ПротоколКонвертации", Новый Массив);
	
	ПользовательскиеНастройкиКонвертации(КомпонентыОбмена);
	
	//@skip-check constructor-function-return-section
	Возврат КомпонентыОбмена;
	
КонецФункции

// Инициализирует таблицы значений с правилами обмена и помещает их в КомпонентыОбмена.
//
// Параметры:
//  КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//
Процедура ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена) Экспорт
	
	// Определение схемы формата обмена.
	КомпонентыОбмена.БазовыеСхемыФормата.Вставить(КомпонентыОбмена.XMLСхема, Истина);
	КомпонентыОбмена.БазовыеСхемыФормата.Вставить(XMLБазоваяСхема(), Истина);
	КомпонентыОбмена.ЭтоEnterpriseData = СтрНачинаетсяС(НРег(КомпонентыОбмена.XMLСхема),
		НРег("http://v8.1c.ru/edi/edi_stnd/EnterpriseData/"));
	
	// Определение версии формата обмена.
	ВерсияМенеджера = КомпонентыОбмена.МенеджерОбмена.ВерсияФорматаМенеджераОбмена(); // Строка
	КомпонентыОбмена.ВерсияФорматаМенеджераОбмена = СтрРазделить(ВерсияМенеджера, ".")[0];
	КомпонентыОбмена.ЭтоМенеджерОбменКФК = СтрЗаканчиваетсяНа(ВРег(ВерсияМенеджера), ".КФК");
	// Проверка поддержки версии формата обмена.
	Если КомпонентыОбмена.ВерсияФорматаМенеджераОбмена <> "2" Тогда
		ВызватьИсключение НСтр("ru = 'Неподдерживаемая версия формата обмена.'");
	КонецЕсли;
	
	// Инициализация таблиц правил обмена.
	КомпонентыОбмена.Вставить("ПравилаОбработкиДанных",     ТаблицаПравилОбработкиДанных(КомпонентыОбмена));
	КомпонентыОбмена.Вставить("ПравилаКонвертацииОбъектов", ТаблицаПравилКонвертации(КомпонентыОбмена));
	
	КомпонентыОбмена.Вставить("ПравилаКонвертацииПредопределенныхДанных", ТаблицаПравилКонвертацииПредопределенныхДанных(КомпонентыОбмена));
	
	КомпонентыОбмена.Вставить("ПараметрыКонвертации", СтруктураПараметровКонвертации(КомпонентыОбмена.МенеджерОбмена));
	
КонецПроцедуры

// Таблица правил обработки данных.
// 
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица правил обработки (ПОД):
// * Имя - Строка - 
// * ОбъектВыборкиФормат - Строка - 
// * ТипСсылкиXDTO - ТипЗначенияXDTO - 
// * ОбъектВыборкиМетаданные - ОбъектМетаданных - 
// * ВыборкаДанных - Строка - 
// * ИмяТаблицыДляВыборки - Строка - 
// * ПриОбработке - Строка - 
// * ИспользуемыеПКО - Массив из Строка - 
Функция ТаблицаПравилОбработкиДанных(КомпонентыОбмена) Экспорт
	
	XMLСхема = КомпонентыОбмена.XMLСхема;
	
	// Инициализация таблицы правил обработки данных.
	ПравилаОбработкиДанных = Новый ТаблицаЗначений;
	ПравилаОбработкиДанных.Колонки.Добавить("Имя");
	ПравилаОбработкиДанных.Колонки.Добавить("ОбъектВыборкиФормат");
	ПравилаОбработкиДанных.Колонки.Добавить("ТипСсылкиXDTO");
	ПравилаОбработкиДанных.Колонки.Добавить("ОбъектВыборкиМетаданные");
	ПравилаОбработкиДанных.Колонки.Добавить("ВыборкаДанных");
	ПравилаОбработкиДанных.Колонки.Добавить("ИмяТаблицыДляВыборки");
	ПравилаОбработкиДанных.Колонки.Добавить("ПриОбработке",    Новый ОписаниеТипов("Строка"));
	
	// ИспользуемыеПКО - массив, содержащий в себе имена ПКО, в которые может быть направлен объект из данного ПОД.
	ПравилаОбработкиДанных.Колонки.Добавить("ИспользуемыеПКО",    Новый ОписаниеТипов("Массив"));
	
	КомпонентыОбмена.МенеджерОбмена.ЗаполнитьПравилаОбработкиДанных(КомпонентыОбмена.НаправлениеОбмена, ПравилаОбработкиДанных);
	
	КоличествоСтрок = ПравилаОбработкиДанных.Количество();
	Для НомерИтерации = 1 По КоличествоСтрок Цикл
		
		ИндексСтроки = КоличествоСтрок - НомерИтерации;
		ПОД = ПравилаОбработкиДанных.Получить(ИндексСтроки);
		
		Если КомпонентыОбмена.НаправлениеОбмена = "Получение" Тогда
			
			ТипXDTO = ФабрикаXDTO.Тип(XMLСхема, ПОД.ОбъектВыборкиФормат);
			Если ТипXDTO = Неопределено Тогда
				
				ПравилаОбработкиДанных.Удалить(ПОД);
				Продолжить;
				
			КонецЕсли;
			
			Если КомпонентыОбмена.ЭтоEnterpriseData Тогда
				КлючевыеСвойства = ТипXDTO.Свойства.Получить(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата());
				Если КлючевыеСвойства <> Неопределено Тогда
					
					ТипКлючевыхСвойствОбъектаXDTO = КлючевыеСвойства.Тип;
					СвойствоСсылкаXDTO = ТипКлючевыхСвойствОбъектаXDTO.Свойства.Получить(КлассСсылкаФормата(КомпонентыОбмена, Неопределено));
					Если СвойствоСсылкаXDTO <> Неопределено Тогда
						ПОД.ТипСсылкиXDTO = СвойствоСсылкаXDTO.Тип;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ПОД.ОбъектВыборкиМетаданные <> Неопределено Тогда
			ПОД.ИмяТаблицыДляВыборки = ПОД.ОбъектВыборкиМетаданные.ПолноеИмя();
		КонецЕсли;
		
	КонецЦикла;
	
	Если КомпонентыОбмена.НаправлениеОбмена = "Отправка" Тогда
		ПравилаОбработкиДанных.Индексы.Добавить("Имя");
		ПравилаОбработкиДанных.Индексы.Добавить("ОбъектВыборкиМетаданные");
	Иначе
		ПравилаОбработкиДанных.Индексы.Добавить("ОбъектВыборкиФормат");
		ПравилаОбработкиДанных.Индексы.Добавить("ТипСсылкиXDTO");
	КонецЕсли;
	
	Возврат ПравилаОбработкиДанных;
	
КонецФункции

// Добавляет строку в таблицу правил конвертации и инициализирует значение в колонке "Свойства".
// Используется в модуле менеджера обмена при заполнении таблицы правил конвертации объектов.
//
// Параметры:
//  ПравилаКонвертации - см. КоллекцияПравилКонвертации
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - строка таблицы правил конвертации.
//
Функция ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации) Экспорт
	
	ПравилоКонвертации = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.Свойства = ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	Возврат ПравилоКонвертации;
	
КонецФункции

// Инициализирует таблицу значений для хранения правил конвертации свойств объекта.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица для хранения правил конвертации свойств:
//     * СвойствоКонфигурации - Строка
//     * СвойствоФормата - Строка
//     * ПравилоКонвертацииСвойства - Строка
//     * ИспользуетсяАлгоритмКонвертации - Булево
//     * ОбработкаКлючевогоСвойства - Булево
//     * ОбработкаПоисковогоСвойства - Булево
//     * ИмяТЧ - Строка
//
Функция ИнициализироватьТаблицуСвойствДляПравилаКонвертации() Экспорт
	
	ТаблицаПКС = Новый ТаблицаЗначений;
	ТаблицаПКС.Колонки.Добавить("СвойствоКонфигурации", Новый ОписаниеТипов("Строка"));
	ТаблицаПКС.Колонки.Добавить("СвойствоФормата",      Новый ОписаниеТипов("Строка"));
	
	ТаблицаПКС.Колонки.Добавить("ПравилоКонвертацииСвойства",      Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	ТаблицаПКС.Колонки.Добавить("ИспользуетсяАлгоритмКонвертации", Новый ОписаниеТипов("Булево"));
	
	ТаблицаПКС.Колонки.Добавить("ОбработкаКлючевогоСвойства",  Новый ОписаниеТипов("Булево"));
	ТаблицаПКС.Колонки.Добавить("ОбработкаПоисковогоСвойства", Новый ОписаниеТипов("Булево"));
	
	ТаблицаПКС.Колонки.Добавить("ИмяТЧ", Новый ОписаниеТипов("Строка"));
	
	ТаблицаПКС.Колонки.Добавить("ПространствоИмен", Новый ОписаниеТипов("Строка"));
	
	ТаблицаПКС.Индексы.Добавить("ПространствоИмен");
	ТаблицаПКС.Индексы.Добавить("СвойствоКонфигурации");

	Возврат ТаблицаПКС;
	
КонецФункции

// Заполняет колонку со свойствами табличных частей пустой таблицей значений с определенными колонками.
// Используется в текущем модуле, а также в модуле менеджера обмена при заполнении таблицы правил конвертации объектов.
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - правило конвертации объектов.
//  ИмяКолонки - Строка - имя заполняемой колонки таблицы правил конвертации.
//
Процедура ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации, ИмяКолонки = "СвойстваТабличныхЧастей") Экспорт
	
	СвойстваТабличныхЧастей = Новый ТаблицаЗначений;
	СвойстваТабличныхЧастей.Колонки.Добавить("ТЧКонфигурации",          Новый ОписаниеТипов("Строка"));
	СвойстваТабличныхЧастей.Колонки.Добавить("ТЧФормата",               Новый ОписаниеТипов("Строка"));
	СвойстваТабличныхЧастей.Колонки.Добавить("Свойства",                Новый ОписаниеТипов("ТаблицаЗначений"));
	СвойстваТабличныхЧастей.Колонки.Добавить("ИспользуетсяАлгоритмКонвертации", Новый ОписаниеТипов("Булево"));
	
	СвойстваТабличныхЧастей.Колонки.Добавить("ПространствоИмен",        Новый ОписаниеТипов("Строка"));
	СвойстваТабличныхЧастей.Индексы.Добавить("ПространствоИмен");
	
	ПравилоКонвертации[ИмяКолонки] = СвойстваТабличныхЧастей;
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// Формирует сообщение для отправки в очередь Kafka.
//
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	Источник - СправочникОбъект, ДокументОбъект, ЛюбаяСсылка, Структура - выгружаемые данные
//	ИмяПОД - Строка - Имя ПОД
//
// Возвращаемое значение:
//	Неопределено, Структура - Сообщение для отправки в очередь Kafka
Функция ПроизвестиВыгрузкуДанных(КомпонентыОбмена, Источник, ИмяПОД) Экспорт
	
	// Инициализация
	Результат = Неопределено;
	СброситьРезультатКонвертации(КомпонентыОбмена);
	
	Попытка
		
		// ПередКонвертацией
		ПередКонвертацией(КомпонентыОбмена, Источник);
		
		// Формирование сообщения	
		Результат = ВыгрузкаОбъектаВыборки(КомпонентыОбмена, Источник, ИмяПОД); // Неопределено, Структура
		
		// ПослеКонвертации
		ПослеКонвертации(КомпонентыОбмена, Источник, Результат);
		
	Исключение
		
		Результат = Неопределено;
		
		ОбработатьИсключениеКонвертации(КомпонентыОбмена, ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Если Результат = Неопределено И Не (КомпонентыОбмена.ФлагОшибки Или КомпонентыОбмена.ФлагПропустить) Тогда
		ЗаписатьВПротоколВыполнения(КомпонентыОбмена, НСтр("ru = 'Не удалось произвести конвертацию данных'"), Истина);
	КонецЕсли;
	
	// Результат
	Возврат Результат;
	
КонецФункции

// Произвести чтение данных.
// 
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	ТелоСообщения - Строка - Тело сообщения
//	ИмяПОД - Строка - Имя ПОД
//
// Возвращаемое значение:
//	Неопределено, ЛюбаяСсылка, РегистрСведенийКлючЗаписи - Результат загрузки данных
Функция ПроизвестиЧтениеДанных(КомпонентыОбмена, ТелоСообщения, ИмяПОД) Экспорт
	
	// Инициализация
	СброситьРезультатКонвертации(КомпонентыОбмена);
	
	Попытка
		
		// ПередКонвертацией
		ПередКонвертацией(КомпонентыОбмена, ТелоСообщения);
		
		// Формирование сообщения
		Результат = ПрочитатьСообщениеОбмена(КомпонентыОбмена, ТелоСообщения, ИмяПОД); // Неопределено, СправочникОбъект, ДокументОбъект, ЛюбаяСсылка, РегистрСведенийНаборЗаписейИмяРегистраСведений
		Если Результат <> Неопределено И КомпонентыОбмена.НавигационнаяСсылка Тогда
			ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ПолучитьНавигационнуюСсылку(Результат));
		КонецЕсли;
		
		// ПослеКонвертации
		ПослеКонвертации(КомпонентыОбмена, ТелоСообщения, Результат);
		
	Исключение
		
		ОбработатьИсключениеКонвертации(КомпонентыОбмена, ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияОбмена

Процедура ПользовательскиеНастройкиКонвертации(КомпонентыОбмена)
	
	// * Отправка:
	КомпонентыОбмена.Вставить("ОтключитьПреобразованиеВNull", Ложь);
	
	// * Получение:
	//	** Параметры записи
	КомпонентыОбмена.Вставить("ИспользоватьТранзакции", Истина);
	КомпонентыОбмена.Вставить("ОбменДаннымиЗагрузка", Истина);
	КомпонентыОбмена.Вставить("ОтключитьМеханизмРегистрации", Истина);
	//	** логирование
	КомпонентыОбмена.Вставить("НавигационнаяСсылка", Истина);
	
КонецПроцедуры

// Коллекция правил конвертации.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица правил конвертации:
// * ИмяПКО - Строка - 
// * ОбъектДанных - Произвольный - 
// * ОбъектФормата - Строка - 
// * ТипПолученныхДанныхСтрокой - Строка - 
// * ИмяТаблицыПолученныхДанных - Строка - 
// * ПредставлениеТипаПолученныхДанных - Строка - 
// * Свойства - ТаблицаЗначений - 
// * ПоляПоиска - Массив из Строка - 
// * ПоляПредставленияОбъекта - Строка - 
// * РеквизитыШапкиПолученныхДанных - Массив из Строка - 
// * ПриОтправкеДанных - Строка - 
// * ПриКонвертацииДанныхXDTO - Строка - 
// * ПередЗаписьюПолученныхДанных - Строка - 
// * ПослеЗагрузкиВсехДанных - Строка - 
// * ПравилоДляГруппыСправочника - Булево - 
// * ВариантИдентификации - Строка - 
// * РазрешитьСоздаватьОбъектИзСтруктуры - Произвольный - 
// * СвойстваТабличныхЧастейОбработанные - ТаблицаЗначений - 
// * СвойстваТабличныхЧастей - Структура - 
Функция КоллекцияПравилКонвертации()
	
	// Инициализация таблицы правил конвертации.
	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("ИмяПКО", Новый ОписаниеТипов("Строка"));
	ПравилаКонвертации.Колонки.Добавить("ОбъектДанных");
	ПравилаКонвертации.Колонки.Добавить("ОбъектФормата",                         Новый ОписаниеТипов("Строка"));
	ПравилаКонвертации.Колонки.Добавить("ТипПолученныхДанныхСтрокой",            Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(300)));
	ПравилаКонвертации.Колонки.Добавить("ИмяТаблицыПолученныхДанных",            Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(300)));
	ПравилаКонвертации.Колонки.Добавить("ПредставлениеТипаПолученныхДанных",     Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(300)));
	ПравилаКонвертации.Колонки.Добавить("Свойства",                              Новый ОписаниеТипов("ТаблицаЗначений"));
	ПравилаКонвертации.Колонки.Добавить("ПоляПоиска",                            Новый ОписаниеТипов("Массив"));
	ПравилаКонвертации.Колонки.Добавить("ПоляПредставленияОбъекта",              Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(300)));
	ПравилаКонвертации.Колонки.Добавить("РеквизитыШапкиПолученныхДанных",        Новый ОписаниеТипов("Массив"));
	ПравилаКонвертации.Колонки.Добавить("ПриОтправкеДанных",                     Новый ОписаниеТипов("Строка"));
	ПравилаКонвертации.Колонки.Добавить("ПриКонвертацииДанныхXDTO",              Новый ОписаниеТипов("Строка"));
	ПравилаКонвертации.Колонки.Добавить("ПередЗаписьюПолученныхДанных",          Новый ОписаниеТипов("Строка"));
	ПравилаКонвертации.Колонки.Добавить("ПослеЗагрузкиВсехДанных",               Новый ОписаниеТипов("Строка"));
	ПравилаКонвертации.Колонки.Добавить("ПравилоДляГруппыСправочника",           Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ВариантИдентификации",                  Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(60)));
	ПравилаКонвертации.Колонки.Добавить("ПространствоИмен",                      Новый ОписаниеТипов("Строка"));
	ПравилаКонвертации.Колонки.Добавить("РазрешитьСоздаватьОбъектИзСтруктуры");
	ПравилаКонвертации.Колонки.Добавить("СвойстваТабличныхЧастей",               Новый ОписаниеТипов("ТаблицаЗначений"));
	
	// Добавляем служебные поля таблицы правил конвертации.
	ПравилаКонвертации.Колонки.Добавить("ТипXDTO");
	ПравилаКонвертации.Колонки.Добавить("ТипСсылкиXDTO");
	ПравилаКонвертации.Колонки.Добавить("ТипКлючевыхСвойствОбъектаXDTO");
	ПравилаКонвертации.Колонки.Добавить("ТипДанных");
	
	ПравилаКонвертации.Колонки.Добавить("МенеджерОбъекта");
	ПравилаКонвертации.Колонки.Добавить("ПолноеИмя");
	
	ПравилаКонвертации.Колонки.Добавить("ЭтоДокумент",               Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЭтоРегистр",                Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЭтоСправочник",             Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЭтоПеречисление",           Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЭтоПланВидовХарактеристик", Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЭтоБизнесПроцесс",          Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЭтоЗадача",                 Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЭтоПланСчетов",             Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЭтоПланВидовРасчета",       Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЭтоКонстанта",              Новый ОписаниеТипов("Булево"));
	
	ПравилаКонвертации.Колонки.Добавить("ДокументМожетПроводиться", Новый ОписаниеТипов("Булево"));
	
	ПравилаКонвертации.Колонки.Добавить("ЭтоСсылочныйТип", Новый ОписаниеТипов("Булево"));
	
	ПравилаКонвертации.Колонки.Добавить("ЕстьОбработчикПриОтправкеДанных",            Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЕстьОбработчикПриКонвертацииДанныхXDTO",     Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЕстьОбработчикПередЗаписьюПолученныхДанных", Новый ОписаниеТипов("Булево"));
	ПравилаКонвертации.Колонки.Добавить("ЕстьОбработчикПослеЗагрузкиВсехДанных",      Новый ОписаниеТипов("Булево"));
	
	Возврат ПравилаКонвертации;
	
КонецФункции

Функция ТаблицаПравилКонвертации(КомпонентыОбмена)
	
	// Инициализация таблицы правил конвертации.
	ПравилаКонвертации = КоллекцияПравилКонвертации();
	
	КомпонентыОбмена.МенеджерОбмена.ЗаполнитьПравилаКонвертацииОбъектов(КомпонентыОбмена.НаправлениеОбмена, ПравилаКонвертации);
	
	Если КомпонентыОбмена.НаправлениеОбмена = "Получение" Тогда
		
		// Отберем строки правил конвертации, у которых не заполнен реквизит "РазрешитьСоздаватьОбъектИзСтруктуры".
		ПараметрыОтбора = Новый Структура("РазрешитьСоздаватьОбъектИзСтруктуры", Неопределено);
		СтрокиДляОбработки = ПравилаКонвертации.НайтиСтроки(ПараметрыОтбора);
		
		// Для найденных строк необходимо заполнить реквизит "РазрешитьСоздаватьОбъектИзСтруктуры".
		// Реквизит заполняется по следующему алгоритму:
		// если правило конвертации объекта формата не указано
		// в правилах обработки данных для данного объекта формата, 
		// тогда реквизит заполняется значением "Истина", 
		// т.к. полученные по этому ПКО данные не смогут быть загружены самостоятельно,
		// иначе заполняем значением "Ложь".
		Для Каждого СтрокаОбработки Из СтрокиДляОбработки Цикл
			СтрокаОбработки.РазрешитьСоздаватьОбъектИзСтруктуры = Истина;
			СтрокаПравилОбработкиДанных = КомпонентыОбмена.ПравилаОбработкиДанных.Найти(СтрокаОбработки.ОбъектФормата, "ОбъектВыборкиФормат");
			Если СтрокаПравилОбработкиДанных <> Неопределено Тогда
				МассивИспользуемыхПКО = СтрокаПравилОбработкиДанных.ИспользуемыеПКО;
				СтрокаОбработки.РазрешитьСоздаватьОбъектИзСтруктуры = МассивИспользуемыхПКО.Найти(СтрокаОбработки.ИмяПКО) = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	РазрешитьПроведениеДокумента = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
	
	КоличествоСтрок = ПравилаКонвертации.Количество();
	Для НомерИтерации = 1 По КоличествоСтрок Цикл
		
		ИндексСтроки = КоличествоСтрок - НомерИтерации;
		ПравилоКонвертации = ПравилаКонвертации.Получить(ИндексСтроки);
		
		ЭтоБазоваяСхема  = ЭтоБазоваяСхема(КомпонентыОбмена, ПравилоКонвертации.ПространствоИмен);
		ПространствоИмен = ?(ЭтоБазоваяСхема, КомпонентыОбмена.XMLСхема, ПравилоКонвертации.ПространствоИмен);
		
		Если ЗначениеЗаполнено(ПравилоКонвертации.ОбъектФормата) Тогда
			ПравилоКонвертации.ТипXDTO = ФабрикаXDTO.Тип(ПространствоИмен, ПравилоКонвертации.ОбъектФормата);
			
			Если ПравилоКонвертации.ТипXDTO = Неопределено Тогда
				ПравилаКонвертации.Удалить(ПравилоКонвертации);
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		Если КомпонентыОбмена.НаправлениеОбмена = "Получение" Тогда
			
			МетаданныеОбъекта = ПравилоКонвертации.ОбъектДанных; // ОбъектМетаданныхСправочник, и др.
		
			ПравилоКонвертации.ИмяТаблицыПолученныхДанных = МетаданныеОбъекта.ПолноеИмя();
			ПравилоКонвертации.ПредставлениеТипаПолученныхДанных = МетаданныеОбъекта.Представление();
			ПравилоКонвертации.ТипПолученныхДанныхСтрокой = ИмяТипаДанныхПоОбъектуМетаданных(ПравилоКонвертации.ОбъектДанных);
		
			ПравилоКонвертации.ПоляПредставленияОбъекта = ?(ПравилоКонвертации.ПоляПоиска.Количество() = 0, "", ПравилоКонвертации.ПоляПоиска[0]);
			
			// Реквизиты объекта получаемых данных.
			РеквизитыМассив = Новый Массив;
			Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
				Если Реквизит.Имя = "Наименование"
					ИЛИ Реквизит.Имя = "Код"
					ИЛИ Реквизит.Имя = "ЭтоГруппа"
					ИЛИ Реквизит.Имя = "Родитель"
					ИЛИ Реквизит.Имя = "Владелец"
					ИЛИ Реквизит.Имя = "Дата"
					ИЛИ Реквизит.Имя = "Номер" Тогда
					РеквизитыМассив.Добавить(Реквизит.Имя);
				КонецЕсли;
			КонецЦикла;
			Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
				РеквизитыМассив.Добавить(Реквизит.Имя);
			КонецЦикла;

			ПравилоКонвертации.РеквизитыШапкиПолученныхДанных = РеквизитыМассив;
			
			ПравилоКонвертации.ЕстьОбработчикПриКонвертацииДанныхXDTO     = Не ПустаяСтрока(ПравилоКонвертации.ПриКонвертацииДанныхXDTO);
			ПравилоКонвертации.ЕстьОбработчикПередЗаписьюПолученныхДанных = Не ПустаяСтрока(ПравилоКонвертации.ПередЗаписьюПолученныхДанных);
			ПравилоКонвертации.ЕстьОбработчикПослеЗагрузкиВсехДанных      = Не ПустаяСтрока(ПравилоКонвертации.ПослеЗагрузкиВсехДанных);
		Иначе
			ПравилоКонвертации.ЕстьОбработчикПриОтправкеДанных            = Не ПустаяСтрока(ПравилоКонвертации.ПриОтправкеДанных);
		КонецЕсли;
		
		Если ПравилоКонвертации.ОбъектДанных <> Неопределено Тогда
			
			ПравилоКонвертации.ПолноеИмя                  = ПравилоКонвертации.ОбъектДанных.ПолноеИмя();
			ПравилоКонвертации.МенеджерОбъекта            = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПравилоКонвертации.ПолноеИмя);
			
			ПравилоКонвертации.ЭтоРегистр = Ложь;
			ПравилоКонвертации.ЭтоДокумент = Ложь;
			ПравилоКонвертации.ЭтоСправочник = Ложь;
			ПравилоКонвертации.ЭтоПеречисление = Ложь;
			ПравилоКонвертации.ЭтоПланВидовХарактеристик = Ложь;
			ПравилоКонвертации.ЭтоБизнесПроцесс = Ложь;
			ПравилоКонвертации.ЭтоЗадача = Ложь;
			ПравилоКонвертации.ЭтоПланСчетов = Ложь;
			ПравилоКонвертации.ЭтоПланВидовРасчета = Ложь;
			ПравилоКонвертации.ЭтоКонстанта = Ложь;
	
			Если ОбменДаннымиПовтИсп.ЭтоСправочник(ПравилоКонвертации.ПолноеИмя) Тогда
				ПравилоКонвертации.ЭтоСправочник = Истина;
			ИначеЕсли ОбменДаннымиПовтИсп.ЭтоДокумент(ПравилоКонвертации.ПолноеИмя) Тогда
				ПравилоКонвертации.ЭтоДокумент = Истина;
			ИначеЕсли ОбменДаннымиПовтИсп.ЭтоПеречисление(ПравилоКонвертации.ПолноеИмя) Тогда
				ПравилоКонвертации.ЭтоПеречисление = Истина;
			ИначеЕсли ОбменДаннымиПовтИсп.ЭтоРегистр(ПравилоКонвертации.ПолноеИмя) Тогда
				ПравилоКонвертации.ЭтоРегистр = Истина;
			ИначеЕсли ОбменДаннымиПовтИсп.ЭтоПланВидовХарактеристик(ПравилоКонвертации.ПолноеИмя) Тогда
				ПравилоКонвертации.ЭтоПланВидовХарактеристик = Истина;
			ИначеЕсли ОбменДаннымиПовтИсп.ЭтоБизнесПроцесс(ПравилоКонвертации.ПолноеИмя) Тогда
				ПравилоКонвертации.ЭтоБизнесПроцесс = Истина;
			ИначеЕсли ОбменДаннымиПовтИсп.ЭтоЗадача(ПравилоКонвертации.ПолноеИмя) Тогда
				ПравилоКонвертации.ЭтоЗадача = Истина;
			ИначеЕсли ОбменДаннымиПовтИсп.ЭтоПланСчетов(ПравилоКонвертации.ПолноеИмя) Тогда
				ПравилоКонвертации.ЭтоПланСчетов = Истина;
			ИначеЕсли ОбменДаннымиПовтИсп.ЭтоПланВидовРасчета(ПравилоКонвертации.ПолноеИмя) Тогда
				ПравилоКонвертации.ЭтоПланВидовРасчета = Истина;
			ИначеЕсли ОбменДаннымиПовтИсп.ЭтоКонстанта(ПравилоКонвертации.ПолноеИмя) Тогда
				ПравилоКонвертации.ЭтоКонстанта = Истина;
			КонецЕсли;
			
			ПравилоКонвертации.ТипДанных = Тип(ИмяТипаДанныхПоОбъектуМетаданных(ПравилоКонвертации.ОбъектДанных));
			
			Если ПравилоКонвертации.ЭтоДокумент Тогда
				ПравилоКонвертации.ДокументМожетПроводиться = ПравилоКонвертации.ОбъектДанных.Проведение = РазрешитьПроведениеДокумента;
			КонецЕсли;
			
		КонецЕсли;
		
		ПравилоКонвертации.ЭтоСсылочныйТип = ПравилоКонвертации.ЭтоДокумент
			Или ПравилоКонвертации.ЭтоСправочник
			Или ПравилоКонвертации.ЭтоПланВидовХарактеристик
			Или ПравилоКонвертации.ЭтоБизнесПроцесс
			Или ПравилоКонвертации.ЭтоЗадача
			Или ПравилоКонвертации.ЭтоПланСчетов
			Или ПравилоКонвертации.ЭтоПланВидовРасчета;
		
		ОтметитьКлючевыеСвойстваПравилаКонвертации(КомпонентыОбмена, ПравилоКонвертации);
		
		Если ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска"
			Или ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска" Тогда
			
			ТаблицаПКС = ПравилоКонвертации.Свойства;
			Для Каждого ПКС Из ТаблицаПКС Цикл
				
				Если ЗначениеЗаполнено(ПравилоКонвертации.ПоляПоиска) Тогда
					Для Каждого ЭлементПолейПоиска Из ПравилоКонвертации.ПоляПоиска Цикл
						ПоляПоискаМассивом = СтрРазделить(ЭлементПолейПоиска, ",");
						Для Каждого ПолеПоиска Из ПоляПоискаМассивом Цикл
							ПолеПоиска = СокрЛП(ПолеПоиска);
							Если ПолеПоиска = ПКС.СвойствоКонфигурации Тогда
								ПКС.ОбработкаПоисковогоСвойства = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Заполнение информации о конвертации свойств табличных частей.
		Для Каждого ПКСТЧ Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
			Для Каждого ПКС Из ПКСТЧ.Свойства Цикл
				Если ПКС.ИспользуетсяАлгоритмКонвертации Тогда
					ПКСТЧ.ИспользуетсяАлгоритмКонвертации = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	// Добавляем индексы таблицы правил конвертации.
	ПравилаКонвертации.Индексы.Добавить("ИмяПКО");
	ПравилаКонвертации.Индексы.Добавить("ТипДанных");
	ПравилаКонвертации.Индексы.Добавить("ТипXDTO");
	Если КомпонентыОбмена.НаправлениеОбмена = "Получение" Тогда
		ПравилаКонвертации.Индексы.Добавить("ТипСсылкиXDTO");
	КонецЕсли;
	
	Возврат ПравилаКонвертации;
	
КонецФункции

Функция ТаблицаПравилКонвертацииПредопределенныхДанных(КомпонентыОбмена)
	
	XMLСхема = КомпонентыОбмена.XMLСхема;
	
	// Инициализация таблицы правил конвертации.
	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("ТипДанных");
	ПравилаКонвертации.Колонки.Добавить("ТипXDTO");
	ПравилаКонвертации.Колонки.Добавить("КонвертацииЗначенийПриПолучении");
	ПравилаКонвертации.Колонки.Добавить("КонвертацииЗначенийПриОтправке");
	
	ПравилаКонвертации.Колонки.Добавить("ИмяПКПД", Новый ОписаниеТипов("Строка"));
	
	КомпонентыОбмена.МенеджерОбмена.ЗаполнитьПравилаКонвертацииПредопределенныхДанных(КомпонентыОбмена.НаправлениеОбмена, ПравилаКонвертации);

	Для Каждого ПравилоКонвертации Из ПравилаКонвертации Цикл
		ПравилоКонвертации.ТипXDTO = ФабрикаXDTO.Тип(XMLСхема, ПравилоКонвертации.ТипXDTO);
		ПравилоКонвертации.ТипДанных = Тип(ИмяТипаДанныхПоОбъектуМетаданных(ПравилоКонвертации.ТипДанных));
	КонецЦикла;
	
	ПравилаКонвертации.Индексы.Добавить("ИмяПКПД");
	ПравилаКонвертации.Индексы.Добавить("ТипДанных");
	ПравилаКонвертации.Индексы.Добавить("ТипДанных,ТипXDTO");
	
	Возврат ПравилаКонвертации;
	
КонецФункции

Функция СтруктураПараметровКонвертации(МенеджерОбмена)
	
	// Инициализация структуры с параметрами конвертации.
	//	Возможно, в будущем понадобится не структура, а таблица (если потребуется передавать параметры из одной базы в другую).
	
	ПараметрыКонвертации = Новый Структура();
	МенеджерОбмена.ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации);
	
	Возврат ПараметрыКонвертации;
	
КонецФункции

Процедура ОтметитьКлючевыеСвойстваПравилаКонвертации(КомпонентыОбмена, ПравилоКонвертации)
	
	Если Не КомпонентыОбмена.ЭтоEnterpriseData Или ПустаяСтрока(ПравилоКонвертации.ОбъектФормата) Тогда
		Возврат;
	КонецЕсли;
	
	КлючевыеСвойства = ПравилоКонвертации.ТипXDTO.Свойства.Получить(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата());
	Если КлючевыеСвойства = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипКлючевыхСвойствОбъектаXDTO = КлючевыеСвойства.Тип;
	ПравилоКонвертации.ТипКлючевыхСвойствОбъектаXDTO = ТипКлючевыхСвойствОбъектаXDTO;
	
	МассивКлючевыхСвойств = Новый Массив;
	ЗаполнитьСписокСвойствОбъектаXDTO(ТипКлючевыхСвойствОбъектаXDTO, МассивКлючевыхСвойств);
	
	ПКСДляДобавления = Новый Массив;
	
	ТаблицаПКС = ПравилоКонвертации.Свойства;
	Для Каждого ПКС Из ТаблицаПКС Цикл
		
		Если МассивКлючевыхСвойств.Найти(ПКС.СвойствоФормата) <> Неопределено Тогда
			ПКС.ОбработкаКлючевогоСвойства = Истина;
			
			Если ПравилоКонвертации.ТипXDTO.Свойства.Получить(ПКС.СвойствоФормата) <> Неопределено Тогда
				ПКСДляДобавления.Добавить(ПКС);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ПКС Из ПКСДляДобавления Цикл
		НовоеПКС = ТаблицаПКС.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеПКС, ПКС, , "ОбработкаКлючевогоСвойства");
	КонецЦикла;
	
	КлассСсылкаФормата = КлассСсылкаФормата(КомпонентыОбмена, ПравилоКонвертации.Свойства);
	СвойствоСсылкаXDTO = ТипКлючевыхСвойствОбъектаXDTO.Свойства.Получить(КлассСсылкаФормата);
	Если СвойствоСсылкаXDTO <> Неопределено Тогда
		
		ПравилоКонвертации.ТипСсылкиXDTO = СвойствоСсылкаXDTO.Тип;
		
		Если ПравилоКонвертации.ЭтоСсылочныйТип
			И КомпонентыОбмена.НаправлениеОбмена = "Отправка" Тогда
			ПКСДляСсылки = ТаблицаПКС.Добавить();
			ПКСДляСсылки.СвойствоКонфигурации = КлассСсылка();
			ПКСДляСсылки.СвойствоФормата = КлассСсылкаФормата;
			ПКСДляСсылки.ОбработкаКлючевогоСвойства = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает строковое представление типа, свойственного для данных,
// соответствующих переданному объекту метаданных.
// Может быть использован как значение параметра встроенной функции Тип().
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - по которому необходимо определить имя типа;
//
// Возвращаемое значение:
//  Строка - например, "СправочникСсылка.Номенклатура".
//
Функция ИмяТипаДанныхПоОбъектуМетаданных(Знач ОбъектМетаданных)
	
	ЛитералыТипа = СтрРазделить(ОбъектМетаданных.ПолноеИмя(), ".");
	ТипТаблицы = ЛитералыТипа[0];
	
	Если ТипТаблицы = "Константа" Тогда
		
		ШаблонИмениТипа = "[ТипТаблицы]МенеджерЗначения.[ИмяТаблицы]";
		
	ИначеЕсли ТипТаблицы = "РегистрСведений"
		Или ТипТаблицы = "РегистрНакопления"
		Или ТипТаблицы = "РегистрБухгалтерии"
		Или ТипТаблицы = "РегистрРасчета" Тогда
		
		ШаблонИмениТипа = "[ТипТаблицы]НаборЗаписей.[ИмяТаблицы]";
		
	Иначе
		ШаблонИмениТипа = "[ТипТаблицы]Ссылка.[ИмяТаблицы]";
	КонецЕсли;
	
	ШаблонИмениТипа = СтрЗаменить(ШаблонИмениТипа, "[ТипТаблицы]", ЛитералыТипа[0]);
	Результат = СтрЗаменить(ШаблонИмениТипа, "[ИмяТаблицы]", ЛитералыТипа[1]);
	Возврат Результат;
	
КонецФункции

// Параметры:
//   ТипОбъектаXDTO - ТипОбъектаXDTO
//   Свойства - Массив из Строка
// 
Процедура ЗаполнитьСписокСвойствОбъектаXDTO(ТипОбъектаXDTO, Свойства)
	
	Для Каждого ДочернееСвойство Из ТипОбъектаXDTO.Свойства Цикл
		Если ТипЗнч(ДочернееСвойство.Тип) = Тип("ТипОбъектаXDTO")
			И СтрНачинаетсяС(ДочернееСвойство.Тип.Имя, КлассОбщиеСвойства()) Тогда
			ЗаполнитьСписокСвойствОбъектаXDTO(ДочернееСвойство.Тип, Свойства);
		Иначе
			Свойства.Добавить(ДочернееСвойство.Имя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВедениеПротокола

// Сохраняет в протокол выполнения.
//
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	ТекстСообщения - Строка - текст сообщения.
//	ВзвестиФлагОшибок - Булево - если истина, то - это сообщение об ошибке. Взводится ФлагОшибки.
//	ВзвестиФлагПропустить - Булево - если истина, то - это сообщение о пропуске данных. Взводится ФлагПропустить.
//
Процедура ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстСообщения = Неопределено, ВзвестиФлагОшибок = Ложь,
	ВзвестиФлагПропустить = Ложь)
	
	Если ВзвестиФлагОшибок Тогда
		КомпонентыОбмена.ФлагОшибки = Истина;
		
	ИначеЕсли ВзвестиФлагПропустить Тогда
		КомпонентыОбмена.ФлагПропустить = Истина;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		
		КомпонентыОбмена.ПротоколКонвертации.Добавить(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьИсключение(ИнформацияОбОшибке, Заголовок = Неопределено);
	
	Если ПустаяСтрока(Заголовок) Тогда
		Заголовок = НСтр("ru = 'Ошибка выполнения...'");
	КонецЕсли;
	
	ВызватьИсключение(Заголовок, , КодЗаголовокИсключения(), , ИнформацияОбОшибке);
	
КонецПроцедуры

Процедура ОбработатьИсключениеОбработчика(ИнформацияОбОшибке, ИмяОбработчика)
	
	ОбработатьИсключение(ИнформацияОбОшибке, СтрШаблон(НСтр("ru = 'Обработчик: ''%1''. Ошибка выполнения обработчика.'"), ИмяОбработчика));
	
КонецПроцедуры

Процедура ОбработатьИсключениеКонвертации(КомпонентыОбмена, ИнформацияОбОшибке)
	
	//@skip-check undefined-variable
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Категория = КатегорияОшибки.ПринудительноеЗавершениеРаботы;
	Если КомпонентыОбмена.ФлагПропустить И ИнформацияОбОшибке.ЯвляетсяОшибкойКатегории(Категория) // принудительное завершение из обработчика события
		Или КомпонентыОбмена.ФлагОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ПредставлениеОшибки(ИнформацияОбОшибке), Истина);
	
КонецПроцедуры

Функция ПредставлениеОшибки(ИнформацияОбОшибке)
	
	Если ИнформацияОбОшибке = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Заголовоки = Новый Массив;
	Ошибка = ПервичнаяОшибка(ИнформацияОбОшибке, Заголовоки);
	
	// Описание
	Результат = ?(ПустаяСтрока(Ошибка.Описание), НСтр("ru = 'Неизвестная ошибка'"), СокрЛП(Ошибка.Описание));
	
	// Код
	Если Не ПустаяСтрока(Ошибка.Код) Тогда
		Результат = Результат + Символы.ПС
			+ Символы.ПС
			+ СтрШаблон(НСтр("ru = 'Код: %1'"), СокрЛП(Ошибка.Код));
	КонецЕсли;
	
	// ИсходнаяСтрока
	Если Не ПустаяСтрока(Ошибка.ИмяМодуля) Тогда
		Результат = Результат + Символы.ПС
			+ Символы.ПС
			+ СтрШаблон("{%1(%2)}: %3",
				СокрЛП(Ошибка.ИмяМодуля), XMLСтрока(Ошибка.НомерСтроки), СокрЛП(Ошибка.ИсходнаяСтрока));
	КонецЕсли;
	
	// ДополнительнаяИнформация
	Если Не ПустаяСтрока(Ошибка.ДополнительнаяИнформация) Тогда
		Результат = Результат + Символы.ПС
			+ Символы.ПС
			+ СтрШаблон(НСтр("ru = 'Дополнительная информация:
			|	%1'"), СокрЛП(Ошибка.ДополнительнаяИнформация));
			
	ИначеЕсли Заголовоки.Количество() Тогда
		Результат = Результат + Символы.ПС
			+ Символы.ПС
			+ СтрШаблон(НСтр("ru = 'Дополнительная информация:
			|	%1'"), СтрСоединить(Заголовоки, Символы.ПС + Символы.Таб)); 
		 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПервичнаяОшибка(Ошибка, Заголовоки)
	
	Если Ошибка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ошибка.Код = КодЗаголовокИсключения() И Не ПустаяСтрока(Ошибка.Описание) Тогда
		Заголовоки.Добавить(СокрЛП(Ошибка.Описание));
	КонецЕсли;
	
	Возврат ?(Ошибка.Причина = Неопределено, Ошибка,
		ПервичнаяОшибка(Ошибка.Причина, Заголовоки));
	
КонецФункции

Функция КодЗаголовокИсключения()
	Возврат "HEADER";
КонецФункции

#КонецОбласти

#Область ОтправкаДанных

// Выполняет выгрузку объекта информационной базы.
//
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	Источник - СправочникОбъект, ДокументОбъект, ЛюбаяСсылка, Структура - Выгружаемые данные
//	ИмяПОД - Строка - Имя правила обработки данных.
//
// Возвращаемое значение:
//	Неопределено, Структура - Описание сообщения, кфкИнтеграция.ПараметрыСообщения():
Функция ВыгрузкаОбъектаВыборки(КомпонентыОбмена, Источник, ИмяПОД)
	
	// Поиск правила обработки данных
	ПравилоОбработки = ПОДПоИмени(КомпонентыОбмена, ИмяПОД);
	
	// Отработка ПОД
	ИспользованиеПКО = Новый Структура;
	Для Каждого ТекущееПКО Из ПравилоОбработки.ИспользуемыеПКО Цикл
		ИспользованиеПКО.Вставить(ТекущееПКО, Истина);
	КонецЦикла;
	ПриОбработкеПОД(КомпонентыОбмена,
		ПравилоОбработки, ИспользованиеПКО,
		Источник);
		
	// Поиск правила конвертации.
	ПравилоКонвертации = Неопределено;
	Для Каждого ТекущееПКО Из ИспользованиеПКО Цикл
		Если ТекущееПКО.Значение Тогда // TODO: Допустимо указание ПКО, не предназначенного для текущей версии формата данных.
			ПравилоКонвертации = ПКОПоИмени(КомпонентыОбмена, ТекущееПКО.Ключ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ПравилоКонвертации = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не найдено правило конвертации данных.'");
	КонецЕсли;
	
	// Выполнение ПКО
	Попытка
		
		// 1. Конвертируем Данные в Структуру по правилам конвертации.
		ДанныеXDTO = ДанныеXDTOИзДанныхИБ(КомпонентыОбмена, ПравилоКонвертации, Источник);
		Если ДанныеXDTO = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось выполнить конвертацию данных.'");
		КонецЕсли;
		
		// 2. Конвертируем Структуру в ОбъектXDTO.
		ОбъектXDTO = ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, ДанныеXDTO, ПравилоКонвертации.ТипXDTO);
		
	Исключение
		ШаблонЗаголовка = НСтр("ru = 'Ошибка при конвертации данных!
			|ПОД: %1
			|ПКО: %2
			|Тип XDTO: %3'");
		ОбработатьИсключение(ИнформацияОбОшибке(), СтрШаблон(ШаблонЗаголовка, ИмяПОД, ПравилоКонвертации.ИмяПКО,
			ПравилоКонвертации.ТипXDTO.Имя));
		Возврат Неопределено;
	КонецПопытки;
		
	Контекст = Новый Структура;
	Контекст.Вставить("ИмяПОД", ПравилоОбработки.Имя);
	Контекст.Вставить("ИмяПКО", ПравилоКонвертации.ИмяПКО);
	ПроверитьОбъектXDTOПоСхеме(КомпонентыОбмена, ОбъектXDTO, ПравилоКонвертации.ТипXDTO, Контекст);
	
	Возврат СообщениеИзОбъектаXDTO(КомпонентыОбмена, ОбъектXDTO);
	
КонецФункции

#Область ДанныхИБ_Структура

Функция ДанныеXDTOИзДанныхИБ(КомпонентыОбмена, Знач ПравилоКонвертации, Источник, СтекВыгрузки = Неопределено)
	
	Приемник = Новый Структура;
	
	Если СтекВыгрузки = Неопределено Тогда
		СтекВыгрузки = Новый Массив;
	КонецЕсли;
	
	Если ПравилоКонвертации.ЭтоСсылочныйТип Тогда
		
		ПозицияВСтеке = СтекВыгрузки.Найти(Источник.Ссылка);
		
		// Проверяем, выгружался ли объект по ссылке, чтобы не допустить зацикливания.
		Если ПозицияВСтеке <> Неопределено Тогда
			
			Если ПозицияВСтеке > 0 Тогда
				Возврат Неопределено;
			ИначеЕсли СтекВыгрузки.Количество() > 1 Тогда
				// Необходимо искать перебором.
				ПерваяИтерация = Истина;
				Для Каждого ЭлементСтека Из СтекВыгрузки Цикл
					Если ПерваяИтерация Тогда
						ПерваяИтерация = Ложь;
						Продолжить;
					КонецЕсли;
					Если ЭлементСтека = Источник.Ссылка Тогда
						Возврат Неопределено;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		СтекВыгрузки.Добавить(Источник.Ссылка);
		
		Если КомпонентыОбмена.ЭтоEnterpriseData И Не ОбщегоНазначения.СсылкаСуществует(Источник.Ссылка) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		СтекВыгрузки.Добавить(Источник);
	КонецЕсли;
	
	Если ПравилоКонвертации.ЭтоКонстанта Тогда
		
		ТипОбъекта = ПравилоКонвертации.ТипXDTO; // ТипОбъектаXDTO
		
		Если ТипОбъекта.Свойства.Количество() = 1 Тогда
			
			Приемник.Вставить(ТипОбъекта.Свойства[0].Имя, Источник.Значение);
			
		Иначе
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Ошибка XML-схемы. Для приемника должно быть задано одно свойство.
				|Тип источника: %1
				|Тип приемника: %2'"),
				Строка(ТипЗнч(Источник)),
				ПравилоКонвертации.ТипXDTO);
		КонецЕсли;
		
	Иначе
		
		// Выполнение ПКС, 1-й этап
		Для Каждого ПКС Из ПравилоКонвертации.Свойства Цикл
			
			Если ПравилоКонвертации.ОбъектДанных <> Неопределено
				И ПКС.СвойствоКонфигурации = ""
				И ПКС.ИспользуетсяАлгоритмКонвертации Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтекВыгрузки.Количество() > 1 И Не ПКС.ОбработкаКлючевогоСвойства Тогда
				Продолжить;
			КонецЕсли;
			
			ВыгрузитьСвойство(
				КомпонентыОбмена,
				Источник,
				Приемник,
				ПКС,
				СтекВыгрузки,
				1);
		КонецЦикла;
		
		// Выполнение ПКС для ТЧ (прямая конвертация).
		Если СтекВыгрузки.Количество() = 1 Тогда
			Для Каждого ТЧИСвойства Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
				Если НЕ (ЗначениеЗаполнено(ТЧИСвойства.ТЧКонфигурации) И ЗначениеЗаполнено(ТЧИСвойства.ТЧФормата)) Тогда
					Продолжить;
				КонецЕсли;
				// ТЧ пустая.
				Если Источник[ТЧИСвойства.ТЧКонфигурации].Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				НоваяТЧПриемника = СоздатьТЧПриемникаПоПКС(ТЧИСвойства.Свойства);
				Для Каждого СтрокаТЧКонфигурации Из Источник[ТЧИСвойства.ТЧКонфигурации] Цикл
					СтрокаТЧПриемник = НоваяТЧПриемника.Добавить();
					Для Каждого ПКС Из ТЧИСвойства.Свойства Цикл
						Если ПКС.ИспользуетсяАлгоритмКонвертации Тогда
							Продолжить;
						КонецЕсли;
						ВыгрузитьСвойство(
							КомпонентыОбмена,
							СтрокаТЧКонфигурации,
							СтрокаТЧПриемник,
							ПКС,
							СтекВыгрузки,
							1);
					КонецЦикла;
				КонецЦикла;
				Приемник.Вставить(ТЧИСвойства.ТЧФормата, НоваяТЧПриемника);
			КонецЦикла;
		КонецЕсли;
		
		// {Обработчик: ПриОтправкеДанных} Начало
		Если ПравилоКонвертации.ЕстьОбработчикПриОтправкеДанных Тогда
			
			Если КомпонентыОбмена.ЭтоEnterpriseData И Не Приемник.Свойство(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()) Тогда
				Приемник.Вставить(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства(), Новый Структура);
			КонецЕсли;
			
			ПриОтправкеДанных(Источник, Приемник, ПравилоКонвертации.ПриОтправкеДанных, КомпонентыОбмена, СтекВыгрузки);
			
			Если Приемник = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			Если КомпонентыОбмена.ЭтоEnterpriseData И СтекВыгрузки.Количество() > 1 Тогда
				Для Каждого КлючевоеСвойство Из Приемник[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()] Цикл
					Приемник.Вставить(КлючевоеСвойство.Ключ, КлючевоеСвойство.Значение);
				КонецЦикла;
				Приемник.Удалить(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства());
			КонецЕсли;
			
			// Выполнение ПКС, 2-й этап
			Для Каждого ПКС Из ПравилоКонвертации.Свойства Цикл
				Если ПКС.СвойствоФормата = "" 
					Или (СтекВыгрузки.Количество() > 1 И Не ПКС.ОбработкаКлючевогоСвойства) Тогда
					Продолжить;
				КонецЕсли;
				
				// Выполняем конвертацию, если в свойство помещена инструкция.
				ЗначениеСвойства = Неопределено;
				Если ПКС.ОбработкаКлючевогоСвойства И СтекВыгрузки.Количество() = 1 Тогда
					Приемник[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()].Свойство(ПКС.СвойствоФормата, ЗначениеСвойства);
				Иначе
					СвойствоФормата_Имя = СокрЛП(ПКС.СвойствоФормата);
					ВложенныеСвойства = СтрРазделить(СвойствоФормата_Имя,".",Ложь);
					// Указано полное имя свойства, входящего в группу общих свойств.
					Если ВложенныеСвойства.Количество() > 1 Тогда
						ПолучитьЗначениеВложенныхСвойств(Приемник, ВложенныеСвойства, ЗначениеСвойства);
					Иначе
						Приемник.Свойство(СвойствоФормата_Имя, ЗначениеСвойства);
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеСвойства = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПКС.ИспользуетсяАлгоритмКонвертации Тогда
					
					Если ТипЗнч(ЗначениеСвойства) = Тип("Структура")
						И ЗначениеСвойства.Свойство("Значение")
						И ЗначениеСвойства.Свойство("ИмяПКО")
						Или ПКС.ПравилоКонвертацииСвойства <> ""
						И ТипЗнч(ЗначениеСвойства) <> Тип("Структура") Тогда
						
						ВыгрузитьСвойство(
							КомпонентыОбмена,
							Источник,
							Приемник,
							ПКС,
							СтекВыгрузки,
							2);
							
					КонецЕсли;
						
				КонецЕсли;
			КонецЦикла;
			
			// Выполнение ПКС для ТЧ
			Если СтекВыгрузки.Количество() = 1 Тогда
				
				// Формируем структуру новых табличных частей по ПКС.
				СвойстваТЧПриемника = Новый Структура;
				Для Каждого ТЧИСвойства Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
					
					ИмяТЧПриемника = ТЧИСвойства.ТЧФормата;
					
					Если ПустаяСтрока(ИмяТЧПриемника) Тогда
						Продолжить;
					КонецЕсли;
					
					Если Не СвойстваТЧПриемника.Свойство(ИмяТЧПриемника) Тогда
						ТаблицаПКС = Новый ТаблицаЗначений;
						ТаблицаПКС.Колонки.Добавить("СвойствоФормата", Новый ОписаниеТипов("Строка"));
						
						СвойстваТЧПриемника.Вставить(ИмяТЧПриемника, ТаблицаПКС);
					КонецЕсли;
					
					ТаблицаПКС = СвойстваТЧПриемника[ИмяТЧПриемника];
					Для Каждого ПКС Из ТЧИСвойства.Свойства Цикл
						СтрокаСвойство = ТаблицаПКС.Добавить();
						СтрокаСвойство.СвойствоФормата = ПКС.СвойствоФормата;
					КонецЦикла;
					
				КонецЦикла;
				
				Для Каждого ТЧИСвойства Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
					
					Если Не ТЧИСвойства.ИспользуетсяАлгоритмКонвертации Тогда
						Продолжить;
					КонецЕсли;
					
					ПКСДляТЧ = ТЧИСвойства.Свойства;
					ИмяТЧПриемника = ТЧИСвойства.ТЧФормата;
					
					ТЧПриемника = Неопределено; // ТаблицаЗначений
					Если Не ЗначениеЗаполнено(ИмяТЧПриемника)
						Или Не Приемник.Свойство(ИмяТЧПриемника, ТЧПриемника) Тогда
						Продолжить;
					КонецЕсли;
					
					// Создаем новую ТЗ, в которой нет ограничений типа для колонок.
					НоваяТЧПриемника = СоздатьТЧПриемникаПоПКС(СвойстваТЧПриемника[ИмяТЧПриемника]);
					
					// Копируем данные в новую таблицу приемника.
					Для Каждого СтрокаТЧПриемника Из ТЧПриемника Цикл
						СтрокаНовойТЧПриемника = НоваяТЧПриемника.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНовойТЧПриемника, СтрокаТЧПриемника);
					КонецЦикла;
					Приемник[ИмяТЧПриемника] = НоваяТЧПриемника;
					
					Для Каждого Строка Из НоваяТЧПриемника Цикл
						
						Для Каждого ПКС Из ПКСДляТЧ Цикл
							
							Если НЕ ПКС.ИспользуетсяАлгоритмКонвертации Тогда
								Продолжить;
							КонецЕсли;
							
							ВыгрузитьСвойство(
								КомпонентыОбмена,
								Источник,
								Строка,
								ПКС,
								СтекВыгрузки,
								2);
								
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		// {Обработчик: ПриОтправкеДанных} Окончание
		
		Если КомпонентыОбмена.ЭтоEnterpriseData И СтекВыгрузки.Количество() > 1 Тогда
			Приемник.Вставить("ТипСоставногоСвойства", ПравилоКонвертации.ТипКлючевыхСвойствОбъектаXDTO);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

// Выгружает свойство объекта информационной базы в соответствии с правилами.
//
// Параметры:
//  КомпонентыОбмена   - Структура - содержит все правила и параметры обмена.
//  ДанныеИБ           - ЛюбаяСсылка - ссылка на выгружаемый объект информационной базы.
//  ПолучательСвойства - Структура - получатель данных типа Структура, в которой должно храниться значение выгруженного свойства.
//                     - СтрокаТаблицыЗначений.
//  ПКС                - СтрокаТаблицыЗначений - строка таблицы правил конвертации свойств, в соответствии с которой
//                                               выполняется преобразование.
//  СтекВыгрузки       - Массив из ЛюбаяСсылка - ссылки на выгружаемые объекты с учетом вложенности.
//  ЭтапВыгрузки       - Число - содержит информацию об этапе выгрузки:
//     1 - выгрузка до выполнения алгоритма ПриОтправкеДанных, 
//     2 - выгрузка после выполнения алгоритма ПриОтправкеДанных.
//
Процедура ВыгрузитьСвойство(КомпонентыОбмена, ДанныеИБ, ПолучательСвойства, ПКС, СтекВыгрузки, ЭтапВыгрузки = 1)
	
	// Свойство формата не указано - данное ПКС используется только при загрузке.
	Если СокрЛП(ПКС.СвойствоФормата) = "" Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоФормата_Имя = СокрЛП(ПКС.СвойствоФормата);
	ВложенныеСвойства = СтрРазделить(СвойствоФормата_Имя,".",Ложь);
	// Указано полное имя свойства, входящего в группу общих свойств.
	УказаноПолноеИмяСвойства = Ложь;
	Если ВложенныеСвойства.Количество() > 1 Тогда
		УказаноПолноеИмяСвойства = Истина;
		СвойствоФормата_Имя = ВложенныеСвойства[ВложенныеСвойства.Количество()-1];
	КонецЕсли;
	
	ЗначениеСвойства = Неопределено;
	Если ЭтапВыгрузки = 1 Тогда
		Если ЗначениеЗаполнено(ПКС.СвойствоКонфигурации) Тогда
			ЗначениеСвойства = ДанныеИБ[ПКС.СвойствоКонфигурации];
		ИначеЕсли ТипЗнч(ДанныеИБ) = Тип("Структура") Тогда
			// Это ПКС из ПКО с источником-структурой
			Если УказаноПолноеИмяСвойства Тогда
				ПолучитьЗначениеВложенныхСвойств(ДанныеИБ, ВложенныеСвойства, ЗначениеСвойства);
			Иначе
				ДанныеИБ.Свойство(СвойствоФормата_Имя, ЗначениеСвойства);
			КонецЕсли;
			Если ЗначениеСвойства = Неопределено Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		Если ТипЗнч(ПолучательСвойства) = Тип("СтрокаТаблицыЗначений") Тогда
			КолонкиТЧ = ПолучательСвойства.Владелец().Колонки;
			УровеньМаксимальный = ВложенныеСвойства.Количество() - 1;
			Если УказаноПолноеИмяСвойства Тогда
				Для Уровень = 0 По УровеньМаксимальный Цикл
					ИмяКолонки = ВложенныеСвойства[Уровень];
					Если КолонкиТЧ.Найти(ИмяКолонки) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					ЗначениеВКолонке = ПолучательСвойства[ИмяКолонки];
					Если Уровень = УровеньМаксимальный Тогда
						ЗначениеСвойства = ЗначениеВКолонке;
					ИначеЕсли ТипЗнч(ЗначениеВКолонке) = Тип("Структура") Тогда
						// Значение вложенного свойства упаковано в структуру, которая может быть многоуровневой.
						ИсточникВложенногоСвойства = ЗначениеВКолонке;
						ЗначениеВложенногоСвойства = Неопределено;
						Для УровеньПодчиненный = Уровень + 1 По УровеньМаксимальный Цикл
							ИмяВложенногоСвойства = ВложенныеСвойства[УровеньПодчиненный];
							Если НЕ ИсточникВложенногоСвойства.Свойство(ИмяВложенногоСвойства, ЗначениеВложенногоСвойства) Тогда
								Продолжить;
							КонецЕсли;
							Если УровеньПодчиненный = УровеньМаксимальный Тогда
								ЗначениеСвойства = ЗначениеВложенногоСвойства;
							ИначеЕсли ТипЗнч(ЗначениеВложенногоСвойства) = Тип("Структура") Тогда
								ИсточникВложенногоСвойства = ЗначениеВложенногоСвойства;
								ЗначениеВложенногоСвойства = Неопределено;
							Иначе
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если КолонкиТЧ.Найти(СвойствоФормата_Имя) = Неопределено Тогда
					Возврат;
				Иначе
					ЗначениеСвойства = ПолучательСвойства[СвойствоФормата_Имя];
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если УказаноПолноеИмяСвойства Тогда
				ПолучитьЗначениеВложенныхСвойств(ДанныеИБ, ВложенныеСвойства, ЗначениеСвойства);
			Иначе
				ПолучательСвойства.Свойство(СвойствоФормата_Имя, ЗначениеСвойства);
			КонецЕсли;
			Если КомпонентыОбмена.ЭтоEnterpriseData И ЗначениеСвойства = Неопределено
				И Не (СтекВыгрузки.Количество() = 1 И ПолучательСвойства[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()].Свойство(СвойствоФормата_Имя, ЗначениеСвойства)) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	ПравилоКонвертацииСвойства = ПКС.ПравилоКонвертацииСвойства;
	
	// Значение может быть в формате инструкции.
	Если ТипЗнч(ЗначениеСвойства) = Тип("Структура") Тогда
		Если ЗначениеСвойства.Свойство("ИмяПКО") Тогда
			ПравилоКонвертацииСвойства = ЗначениеСвойства.ИмяПКО;
		КонецЕсли;
		Если ЗначениеСвойства.Свойство("Значение") Тогда
			ЗначениеСвойства = ЗначениеСвойства.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
	
		Если Не ПустаяСтрока(ПравилоКонвертацииСвойства) Тогда
			
			ПКПД = КомпонентыОбмена.ПравилаКонвертацииПредопределенныхДанных.Найти(ПравилоКонвертацииСвойства, "ИмяПКПД");
			Если ПКПД <> Неопределено Тогда
				
				Если ТипЗнч(ЗначениеСвойства) = Тип("Строка") Тогда
					Возврат;
				КонецЕсли;
				
				ЗначениеСвойства = ПКПД.КонвертацииЗначенийПриОтправке.Получить(ЗначениеСвойства);
			
			Иначе
			
				ПравилоКонвертации = ПКОПоИмени(КомпонентыОбмена, ПравилоКонвертацииСвойства);
				
				ОтветвлениеСтекаВыгрузки = Новый Массив;
				Для Каждого Элемент Из СтекВыгрузки Цикл
					ОтветвлениеСтекаВыгрузки.Добавить(Элемент);
				КонецЦикла;
				
				ЗначениеСвойства = ДанныеXDTOИзДанныхИБ(
					КомпонентыОбмена,
					ПравилоКонвертации,
					ЗначениеСвойства,
					ОтветвлениеСтекаВыгрузки);
					
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Не КомпонентыОбмена.ЭтоМенеджерОбменКФК Или Не КомпонентыОбмена.ОтключитьПреобразованиеВNull
			Или ЗначениеСвойства = Null Тогда
		ЗначениеСвойства = Неопределено;
	КонецЕсли;
	
	Если СтекВыгрузки.Количество() = 1 И ПКС.ОбработкаКлючевогоСвойства Тогда
		Если Не ПолучательСвойства.Свойство(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()) Тогда
			ПолучательСвойства.Вставить(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства(), Новый Структура);
		КонецЕсли;
		ПолучательСвойства[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()].Вставить(СвойствоФормата_Имя, ЗначениеСвойства);
	Иначе
		Если ТипЗнч(ПолучательСвойства) = Тип("СтрокаТаблицыЗначений") Тогда
			Если УказаноПолноеИмяСвойства Тогда
				ПоместитьЗначениеВложенныхСвойств(ПолучательСвойства, ВложенныеСвойства, ЗначениеСвойства, Истина);
			Иначе
				ПолучательСвойства[СвойствоФормата_Имя] = ЗначениеСвойства;
			КонецЕсли;
		Иначе
			Если УказаноПолноеИмяСвойства Тогда
				ПоместитьЗначениеВложенныхСвойств(ПолучательСвойства, ВложенныеСвойства, ЗначениеСвойства, Ложь);
			Иначе
				ПолучательСвойства.Вставить(СвойствоФормата_Имя, ЗначениеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьТЧПриемникаПоПКС(ПКСДляТЧ)
	
	НоваяТЧПриемника = Новый ТаблицаЗначений;
	Для Каждого ПКС Из ПКСДляТЧ Цикл
		ИмяКолонки = СокрЛП(ПКС.СвойствоФормата);
		// Возможно, это ПКС для вложенных свойств.
		Если СтрНайти(ИмяКолонки, ".") > 0 Тогда
			ВложенныеСвойства = СтрРазделить(ИмяКолонки,".",Ложь);
			МаксимальныйИндекс = ВложенныеСвойства.Количество() - 1;
			Для Индекс = 0 По МаксимальныйИндекс Цикл
				ИмяВложенногоСвойства = ВложенныеСвойства[Индекс];
				Если НоваяТЧПриемника.Колонки.Найти(ИмяВложенногоСвойства) = Неопределено Тогда
					НоваяТЧПриемника.Колонки.Добавить(ИмяВложенногоСвойства);
				КонецЕсли;
			КонецЦикла;
		Иначе
			НоваяТЧПриемника.Колонки.Добавить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НоваяТЧПриемника;
	
КонецФункции

#КонецОбласти

#Область Структура_ОбъектXDTO

// Выполняет преобразование структуры с данными в объект XDTO указанного типа в соответствии с правилами.
//
// Параметры:
//   КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//   Источник         - Структура - источник данных, которые необходимо преобразовать в объект XDTO.
//   ТипXDTO          - ТипЗначенияXDTO, ТипОбъектаXDTO - тип объекта или тип значения XDTO, к которому надо преобразовать данные.
//   ПроведеноЗаполнениеСвойств - Булево - параметр для определения заполненности общих составных свойств.
//
// Возвращаемое значение:
//   ОбъектXDTO - результат преобразования. 
// 
Функция ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, Знач Источник, Знач ТипXDTO, ПроведеноЗаполнениеСвойств = Ложь)
	
	Приемник = ФабрикаXDTO.Создать(ТипXDTO);
	
	СвойстваИсточника = Новый Массив;
	Для Каждого Свойство Из ТипXDTO.Свойства Цикл
		СвойстваИсточника.Добавить(Свойство);
	КонецЦикла;
	
	Для Каждого Свойство Из СвойстваИсточника Цикл
		
		Если Свойство.ВозможноПустое Тогда
			Приемник[Свойство.Имя] = Неопределено;
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		СвойствоНайдено = Ложь;
		
		Если ТипЗнч(Источник) = Тип("Структура") Тогда
			СвойствоНайдено = Источник.Свойство(Свойство.Имя, ЗначениеСвойства);
		ИначеЕсли ТипЗнч(Источник) = Тип("СтрокаТаблицыЗначений")
			И Источник.Владелец().Колонки.Найти(Свойство.Имя) <> Неопределено Тогда
			СвойствоНайдено = Истина;
			ЗначениеСвойства = Источник[Свойство.Имя];
		КонецЕсли;
		
		ТипСвойства = Неопределено;
		ТипСвойстваПоИмениИЗначениюСвойства(ТипXDTO, СвойствоНайдено, Свойство, ЗначениеСвойства, ТипСвойства);
		
		Попытка
			Если ТипСвойства = "ОбщееСоставноеСвойство" Тогда
				
				ПроведеноЗаполнениеВложенныхСвойств = Ложь;
				Если ТипЗнч(Источник) = Тип("Структура") И СвойствоНайдено Тогда
					
					ЗначениеXDTO = ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, ЗначениеСвойства,
						Свойство.Тип, ПроведеноЗаполнениеВложенныхСвойств);
						
				Иначе
					
					ЗначениеXDTO = ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, Источник,
						Свойство.Тип, ПроведеноЗаполнениеВложенныхСвойств);
						
				КонецЕсли;
				
				Если Не ПроведеноЗаполнениеВложенныхСвойств И Свойство.ВозможноПустое Тогда
					Продолжить;
				КонецЕсли;
				
			Иначе
				
				// Проверка на заполненность.
				Если Не СвойствоНайдено Или ЗначениеСвойства = Null Или ЗначениеСвойства = Неопределено
					Или Не (КомпонентыОбмена.ОтключитьПреобразованиеВNull Или ЗначениеЗаполнено(ЗначениеСвойства)) Тогда
					Продолжить;
				КонецЕсли;
				
				ЗначениеXDTO = Неопределено;
				Если ТипСвойства = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства() Тогда
					
					ЗначениеXDTO = ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, ЗначениеСвойства, Свойство.Тип);
					
				ИначеЕсли ТипСвойства = "ОбычноеСвойство" Тогда
					
					СвойствоТипЗначения = Свойство.Тип; // ТипЗначенияXDTO
					
					Если ЭтоСсылкаXDTO(СвойствоТипЗначения) Тогда // Конвертация ссылки
						
						ЗначениеXDTO = ЗначениеВСтроку(ЗначениеСвойства);
						
					ИначеЕсли СвойствоТипЗначения.Фасеты <> Неопределено
						И СвойствоТипЗначения.Фасеты.Перечисления <> Неопределено
						И СвойствоТипЗначения.Фасеты.Перечисления.Количество() > 0 Тогда // Конвертация перечисления
						ЗначениеXDTO = КонвертироватьПеречислениеВXDTO(КомпонентыОбмена, ЗначениеСвойства,
							СвойствоТипЗначения);
						
					ИначеЕсли кфкОбщегоНазначенияСлужебный.ЭтоСсылка(ЗначениеСвойства) Тогда // Конвертация ссылки в строку
						ЗначениеXDTO = ФабрикаXDTO.Создать(СвойствоТипЗначения, XMLСтрока(ЗначениеСвойства));
						
					Иначе // Конвертация обычного значения.
						ЗначениеXDTO = ФабрикаXDTO.Создать(СвойствоТипЗначения, ЗначениеСвойства);
					КонецЕсли;
					
				ИначеЕсли ТипСвойства = "AdditionalInfo" Тогда
					ЗначениеXDTO = СериализаторXDTO.ЗаписатьXDTO(ЗначениеСвойства);
					
				ИначеЕсли ТипСвойства = "Таблица" Тогда
					
					ЗначениеXDTO = ФабрикаXDTO.Создать(Свойство.Тип);
					ТипТаблицы = Свойство.Тип.Свойства[0].Тип;
					ИмяСвойстваСтроки = Свойство.Тип.Свойства[0].Имя;
					СписокXDTO = ЗначениеXDTO[ИмяСвойстваСтроки]; // СписокXDTO
					
					Для Каждого ИсточникСтрока Из ЗначениеСвойства Цикл
						
						ПриемникСтрока = ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, ИсточникСтрока, ТипТаблицы, Ложь);
						СписокXDTO.Добавить(ПриемникСтрока);
						
					КонецЦикла;
					
				ИначеЕсли ТипСвойства = "МассивИзОбычноеСвойство" Тогда
					
					ЗначениеXDTO = Приемник[Свойство.Имя]; // СписокXDTO
					
					СвойствоТипЗначения = Свойство.Тип; // ТипЗначенияXDTO
					ЭтоЭлементСсылки = ЭтоСсылкаXDTO(СвойствоТипЗначения);
					ЭтоЭлементПеречисления = СвойствоТипЗначения.Фасеты <> Неопределено
						И СвойствоТипЗначения.Фасеты.Перечисления <> Неопределено
						И СвойствоТипЗначения.Фасеты.Перечисления.Количество() > 0;
					
					Для Каждого Элемент Из ЗначениеСвойства Цикл
						
						Если ЭтоЭлементСсылки Тогда // Конвертация ссылки
							ЭлементXDTO = ЗначениеВСтроку(Элемент);
							
						ИначеЕсли ЭтоЭлементПеречисления Тогда // Конвертация перечисления
							ЭлементXDTO = КонвертироватьПеречислениеВXDTO(КомпонентыОбмена, Элемент, СвойствоТипЗначения);
							
						ИначеЕсли кфкОбщегоНазначенияСлужебный.ЭтоСсылка(ЗначениеСвойства) Тогда // Конвертация ссылки в строку
							ЭлементXDTO = ФабрикаXDTO.Создать(СвойствоТипЗначения, XMLСтрока(Элемент));
							
						Иначе // Конвертация обычного значения.
							ЭлементXDTO = ФабрикаXDTO.Создать(СвойствоТипЗначения, Элемент);
							
						КонецЕсли;
						
						ЗначениеXDTO.Добавить(ЭлементXDTO);
						 
					КонецЦикла;
					
				ИначеЕсли ТипСвойства = "СвойствоСоставногоТипа" Тогда
					
					Для Каждого СвойствоСоставногоТипа Из Свойство.Тип.Свойства Цикл
						
						СоставноеЗначениеXDTO = Неопределено;
						Если ТипЗнч(ЗначениеСвойства) = Тип("Структура")
							И ЗначениеСвойства.ТипСоставногоСвойства = СвойствоСоставногоТипа.Тип Тогда // Свойство составного типа, содержащие элементы только типа КлючевыеСвойства.
							СоставноеЗначениеXDTO = ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, ЗначениеСвойства, СвойствоСоставногоТипа.Тип);
							
						ИначеЕсли (ТипЗнч(ЗначениеСвойства) = Тип("Строка") // Свойство составного типа простое, и значение простое.
							И СтрНайти(СвойствоСоставногоТипа.Тип.Имя,"string")>0)
							ИЛИ (ТипЗнч(ЗначениеСвойства) = Тип("Число")
							И СтрНайти(СвойствоСоставногоТипа.Тип.Имя,"decimal")>0)
							ИЛИ (ТипЗнч(ЗначениеСвойства) = Тип("Булево")
							И СтрНайти(СвойствоСоставногоТипа.Тип.Имя,"boolean")>0)
							ИЛИ (ТипЗнч(ЗначениеСвойства) = Тип("Дата")
							И СтрНайти(СвойствоСоставногоТипа.Тип.Имя,"date")>0) Тогда
							
							СоставноеЗначениеXDTO = ЗначениеСвойства;
							
						ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("Строка")
							И ТипЗнч(СвойствоСоставногоТипа.Тип) = Тип("ТипЗначенияXDTO")
							И СвойствоСоставногоТипа.Тип.Фасеты <> Неопределено Тогда
							Если СвойствоСоставногоТипа.Тип.Фасеты.Количество() = 0 Тогда
								СоставноеЗначениеXDTO = ЗначениеСвойства;
							Иначе
								
								Для Каждого Фасет Из СвойствоСоставногоТипа.Тип.Фасеты Цикл
									Если Фасет.Значение = ЗначениеСвойства Тогда
										СоставноеЗначениеXDTO = ЗначениеСвойства;
										Прервать;
									КонецЕсли;
								КонецЦикла;
								
							КонецЕсли;
						КонецЕсли;
						
						Если СоставноеЗначениеXDTO <> Неопределено Тогда
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
					// Если передается значение с типом, которое не поддерживается в формате - не передаем.
					Если СоставноеЗначениеXDTO = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ЗначениеXDTO = ФабрикаXDTO.Создать(Свойство.Тип);
					ЗначениеXDTO.Установить(СвойствоСоставногоТипа, СоставноеЗначениеXDTO);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипЗнч(ЗначениеXDTO) = Тип("СписокXDTO") Тогда
//				Продолжить; см. выше
				
			ИначеЕсли ЭтоБазоваяСхема(КомпонентыОбмена, Свойство.URIПространстваИмен)
					Или Свойство.URIПространстваИмен = Приемник.Тип().URIПространстваИмен Тогда
				Приемник[Свойство.Имя] = ЗначениеXDTO;
				
			Иначе
				ДополнитьОбъектXDTO(Приемник, Свойство, ЗначениеXDTO);
			КонецЕсли;
			
		Исключение
			ОбработатьИсключение(ИнформацияОбОшибке(),
				СтрШаблон(НСтр("ru = 'Ошибка формирования объекта XDTO: Тип свойства <%1>. Имя свойства: <%2>.'"),
					ТипСвойства, Свойство.Имя));
		КонецПопытки;
		
		ПроведеноЗаполнениеСвойств = Истина;
		
	КонецЦикла;
	
	Возврат Приемник;
	
КонецФункции

// Определяет тип объекта формата перед конвертацией свойства
Процедура ТипСвойстваПоИмениИЗначениюСвойства(ТипXDTO, СвойствоНайдено, Свойство, ЗначениеСвойства, ТипСвойства)
	
	Если ТипЗнч(Свойство.Тип) = Тип("ТипЗначенияXDTO") Тогда
		
		Если ЭтоМассивОбъекта(Свойство) Тогда
			
			ТипСвойства = "МассивИзОбычноеСвойство";
			
		Иначе
			
			ТипСвойства = "ОбычноеСвойство";
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Свойство.Тип) = Тип("ТипОбъектаXDTO") Тогда
		
		Если Свойство.Имя = "AdditionalInfo" Тогда
			
			ТипСвойства = "AdditionalInfo";
			
		ИначеЕсли ЭтоТаблицаОбъекта(Свойство) Тогда
			
			ТипСвойства = "Таблица";
			
		ИначеЕсли СтрНайти(Свойство.Тип.Имя, ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата()) > 0 Тогда
			
			ТипСвойства = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства();
			
		ИначеЕсли СтрНайти(Свойство.Тип.Имя, КлассОбщиеСвойства()) > 0 Тогда
			
			ТипСвойства = "ОбщееСоставноеСвойство";
			
		Иначе
			
			Если СвойствоНайдено Тогда
				
				Если ТипЗнч(ЗначениеСвойства) = Тип("Структура") 
					И ЗначениеСвойства.Свойство("ТипСоставногоСвойства") Тогда
					
					ТипСвойства = "СвойствоСоставногоТипа";
					
				Иначе
					
					ТипСвойства = "ОбщееСоставноеСвойство";
					
				КонецЕсли;
				
			Иначе
				
				ТипСвойства = "ОбщееСоставноеСвойство";
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный тип свойства <%1>. Тип объекта: %2'"),
			Свойство.Имя,
			Строка(ТипXDTO));
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьОбъектXDTO(ОбъектXDTO, Знач Свойство, Знач Значение)
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектXDTO, Свойство.Имя) Тогда
		
		ОбъектXDTO.Добавить(Свойство.Форма, Свойство.URIПространстваИмен, Свойство.Имя, Значение);
		Возврат;
		
	КонецЕсли;
	
	Если ЭтоТаблицаОбъекта(Свойство) Тогда
		ИмяСвойстваСтроки = Свойство.Тип.Свойства[0].Имя;
		Для ИндексСтроки = 0 По Значение[ИмяСвойстваСтроки].Количество() - 1 Цикл
			СтрокаXDTO = ОбъектXDTO[Свойство.Имя][ИмяСвойстваСтроки].Получить(ИндексСтроки); // ОбъектXDTO 
			РасширениеСтрокиXDTO = Значение[ИмяСвойстваСтроки].Получить(ИндексСтроки);
			
			Для Каждого СвойствоСтроки Из РасширениеСтрокиXDTO.Свойства() Цикл
				Если ТипЗнч(СвойствоСтроки.Тип) = Тип("ТипЗначенияXDTO") Тогда
					ЗначениеСвойстваСтроки = ФабрикаXDTO.Создать(СвойствоСтроки.Тип,
						РасширениеСтрокиXDTO.Получить(СвойствоСтроки.Имя));
				Иначе
					ЗначениеСвойстваСтроки = РасширениеСтрокиXDTO.Получить(СвойствоСтроки.Имя);
				КонецЕсли;

				Если ЗначениеСвойстваСтроки = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаXDTO.Добавить(
					СвойствоСтроки.Форма,
					СвойствоСтроки.URIПространстваИмен,
					СвойствоСтроки.Имя,
					ЗначениеСвойстваСтроки);
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Свойство.Тип) = Тип("ТипОбъектаXDTO") Тогда
		Для Каждого ДочернееСвойство Из Значение.Свойства() Цикл
			Подзначение = Значение.Получить(ДочернееСвойство.Имя);
			Если Подзначение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ДочернееСвойство.Тип) = Тип("ТипЗначенияXDTO") Тогда
				ДополнитьОбъектXDTO(ОбъектXDTO[Свойство.Имя], ДочернееСвойство, 
					ФабрикаXDTO.Создать(ДочернееСвойство.Тип, Подзначение));
			Иначе
				ДополнитьОбъектXDTO(ОбъектXDTO[Свойство.Имя], ДочернееСвойство, Подзначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция КонвертироватьПеречислениеВXDTO(КомпонентыОбмена, ЗначениеПеречисления, ТипПеречисленияXDTO)
	
	Если ТипЗнч(ЗначениеПеречисления) = Тип("Строка") Тогда
		ЗначениеXDTO = ФабрикаXDTO.Создать(ТипПеречисленияXDTO, ЗначениеПеречисления);
		
	Иначе
		ПравилаКонвертацииПредопределенныхДанных = КомпонентыОбмена.ПравилаКонвертацииПредопределенныхДанных;
		ПравилоКонвертации = НайтиПравилоКонвертацииДляЗначения(
			ПравилаКонвертацииПредопределенныхДанных, ТипЗнч(ЗначениеПеречисления), ТипПеречисленияXDTO);
		ЗначениеXDTO = ФабрикаXDTO.Создать(ТипПеречисленияXDTO,
			ЗначениеПеречисленияXDTO(ПравилоКонвертации.КонвертацииЗначенийПриОтправке, ЗначениеПеречисления));
		
	КонецЕсли;
	
	Возврат ЗначениеXDTO;
	
КонецФункции

Функция НайтиПравилоКонвертацииДляЗначения(ПравилаКонвертацииПредопределенныхДанных, Знач Тип, Знач ТипXDTO = Неопределено)
	
	Если ТипXDTO = Неопределено Тогда
		
		НайденныеПравила = ПравилаКонвертацииПредопределенныхДанных.НайтиСтроки(Новый Структура("ТипДанных", Тип));
		
		Если НайденныеПравила.Количество() = 1 Тогда
			
			ПравилоКонвертации = НайденныеПравила[0];
			
			Возврат ПравилоКонвертации;
			
		ИначеЕсли НайденныеПравила.Количество() > 1 Тогда
			
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Ошибка правил конвертации предопределенных данных.
				|Задано более одного правила конвертации для типа источника <%1>.'"),
				Строка(Тип));
			
		КонецЕсли;
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Ошибка правил конвертации предопределенных данных.
			|Правило конвертации не определено для типа источника <%1>.'"),
			Строка(Тип));
			
	Иначе
		
		НайденныеПравила = ПравилаКонвертацииПредопределенныхДанных.НайтиСтроки(Новый Структура("ТипДанных, ТипXDTO", Тип, ТипXDTO, Ложь));
		
		Если НайденныеПравила.Количество() = 1 Тогда
			
			ПравилоКонвертации = НайденныеПравила[0];
			
			Возврат ПравилоКонвертации;
			
		ИначеЕсли НайденныеПравила.Количество() > 1 Тогда
			
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Ошибка правил конвертации предопределенных данных.
				|Задано более одного правила конвертации для типа источника <%1> и типа приемника <%2>.'"),
				Строка(Тип),
				Строка(ТипXDTO));
			
		КонецЕсли;
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Ошибка правил конвертации предопределенных данных.
			|Правило конвертации не определено для типа источника <%1> и типа приемника <%2>.'"),
			Строка(Тип),
			Строка(ТипXDTO));
		
	КонецЕсли;
	
КонецФункции

Функция ЗначениеПеречисленияXDTO(Знач КонвертацииЗначений, Знач Значение)
	
	ЗначениеXDTO = КонвертацииЗначений.Получить(Значение);
	Если ЗначениеXDTO = Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не найдено правило конвертации для значения предопределенных данных.
			|Тип значения источника: <%1>
			|Значение источника: <%2>'"),
			ТипЗнч(Значение),
			Строка(Значение));
	КонецЕсли;
	
	Возврат ЗначениеXDTO;
	
КонецФункции

Функция ЗначениеВСтроку(Значение)
	
	Возврат ?(Значение = Неопределено Или Значение = Null, Значение, XMLСтрока(Значение));
	
КонецФункции

Функция ЭтоТаблицаОбъекта(Знач СвойствоXDTO)
	
	Если ТипЗнч(СвойствоXDTO.Тип) = Тип("ТипОбъектаXDTO")
		И СвойствоXDTO.Тип.Свойства.Количество() = 1 Тогда
		
		Возврат СвойствоXDTO.Тип.Свойства[0].ВерхняяГраница <> 1;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоМассивОбъекта(Знач СвойствоXDTO)
	
	Если ТипЗнч(СвойствоXDTO.Тип) = Тип("ТипЗначенияXDTO") Тогда
		
		Возврат СвойствоXDTO.ВерхняяГраница <> 1;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ВалидацияОбъектаXDTO

Процедура ПроверитьОбъектXDTOПоСхеме(КомпонентыОбмена, ОбъектXDTO, ТипXDTO, Контекст)
	
	Если КомпонентыОбмена.ФлагОшибки Или КомпонентыОбмена.ФлагПропустить Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбъектXDTO.Проверить();
		Возврат;
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	СтекОшибок = Новый Массив;
	ЗаполнитьОшибкиПроверкиОбъектаXDTO(ОбъектXDTO, ТипXDTO, СтекОшибок);
	
	Если СтекОшибок.Количество() > 0 Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Стек ошибок:
			|%1'"), СтрСоединить(СтекОшибок, Символы.ПС));
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru = 'Ошибка при проверке объекта XDTO по схеме!
		|ПОД: %1
		|ПКО: %2
		|Тип XDTO: %3
		|%4'");
	ТекстСообщения = СтрШаблон(ШаблонСообщения,
		Контекст.ИмяПОД,
		Контекст.ИмяПКО,
		ТипXDTO.Имя,
		ТекстОшибки);
	ВызватьИсключение ТекстСообщения;
	
КонецПроцедуры

Процедура ЗаполнитьОшибкиПроверкиОбъектаXDTO(ОбъектXDTO, ТипОбъектаXDTO, СтекОшибок, Знач Уровень = 1)
	
	Для Каждого Свойство Из ТипОбъектаXDTO.Свойства Цикл
		
		Если Не ОбъектXDTO.Установлено(Свойство) Тогда
			Если Свойство.НижняяГраница = 1 И Не Свойство.ВозможноПустое Тогда
				ДобавитьОшибкуПроверки(СтекОшибок, Уровень, Свойство, НСтр("ru = '%1: не заполнено обязательное поле.'"));
			КонецЕсли;
			
			Продолжить;
			
		Иначе
			ЗначениеСвойстваXDTO = Неопределено;
			ЭтоСписокXDTO = Ложь;
			Если Свойство.ВерхняяГраница = 1 Тогда
				ЗначениеСвойстваXDTO = ОбъектXDTO.ПолучитьXDTO(Свойство);
			Иначе
				ЗначениеСвойстваXDTO = ОбъектXDTO.ПолучитьСписок(Свойство);
				ЭтоСписокXDTO = Истина;
			КонецЕсли;
			
			Если ЗначениеСвойстваXDTO = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ЗначениеСвойстваXDTO) = Тип("ЗначениеXDTO") Тогда
				Попытка
					Свойство.Тип.Проверить(ЗначениеСвойстваXDTO.ЛексическоеЗначение);
				Исключение
					ДобавитьОшибкуПроверки(СтекОшибок, Уровень, Свойство,
						НСтр("ru = '%1: значение поля не соответствует заданным ограничениям.'"));
				КонецПопытки;
				
			ИначеЕсли ЭтоСписокXDTO Тогда
				Сч = 0;
				Для Каждого ЭлементСпискаXDTO Из ЗначениеСвойстваXDTO Цикл
					Сч = Сч + 1;
					НовыйСтекОшибок = Новый Массив;
					Если ТипЗнч(Свойство.Тип) = Тип("ТипОбъектаXDTO") Тогда
						ЗаполнитьОшибкиПроверкиОбъектаXDTO(ЭлементСпискаXDTO, Свойство.Тип, НовыйСтекОшибок, Уровень + 1);
					Иначе
						Попытка
							Свойство.Тип.Проверить(ЭлементСпискаXDTO);
						Исключение
							ДобавитьОшибкуПроверки(НовыйСтекОшибок, Уровень, Свойство,
								НСтр("ru = '%1: значение поля не соответствует заданным ограничениям.'"));
						КонецПопытки
					КонецЕсли;
					
					Если НовыйСтекОшибок.Количество() > 0 Тогда
						ДобавитьОшибкуПроверки(СтекОшибок, Уровень, Свойство, "%1[" + XMLСтрока(Сч) + "]:");
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтекОшибок, НовыйСтекОшибок);
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				НовыйСтекОшибок = Новый Массив;
				ЗаполнитьОшибкиПроверкиОбъектаXDTO(ЗначениеСвойстваXDTO, Свойство.Тип, НовыйСтекОшибок, Уровень + 1);
				
				Если НовыйСтекОшибок.Количество() > 0 Тогда
					ДобавитьОшибкуПроверки(СтекОшибок, Уровень, Свойство, "%1:");
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтекОшибок, НовыйСтекОшибок);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОшибкуПроверки(СтекОшибок, Уровень, Свойство, ШаблонОшибки)
	
	СтекОшибок.Добавить(СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(Символы.Таб, Уровень) +
		СтрШаблон(ШаблонОшибки, Свойство.Имя));
	
КонецПроцедуры

#КонецОбласти

#Область ОбъектXDTO_JSON

Функция СообщениеИзОбъектаXDTO(КомпонентыОбмена, ОбъектXDTO)
	
	Если КомпонентыОбмена.ФлагОшибки Или КомпонентыОбмена.ФлагПропустить Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		
		// 1. Объект XDTO -> JSON
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
		ФабрикаXDTO.ЗаписатьJSON(ЗаписьJSON, ОбъектXDTO);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		СтрокаJSON = "{""" + Сред(СтрокаJSON, 4); // Удаление символа # в '#value'
		
		// 2. JSON объекта XDTO -> Сообщение (Структура)
		Возврат ОбщегоНазначения.JSONВЗначение(СтрокаJSON, , Ложь)["value"];
		
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Ошибка сериализации JSON объекта XDTO'"));
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПолучениеДанных

Функция ПрочитатьСообщениеОбмена(КомпонентыОбмена, ТелоСообщения, ИмяПОД)
	
	// Поиск правила обработки данных
	ПравилоОбработки = ПОДПоИмени(КомпонентыОбмена, ИмяПОД);
	// Проверка на наличие объекта выборки формата
	Если ПустаяСтрока(ПравилоОбработки.ОбъектВыборкиФормат) Тогда
		ВызватьИсключение НСтр("ru = 'Не задано имя объекта выборки формата'");
	КонецЕсли;
	
	// 0. Удаление и экранирование недопустимых символов JSON
	УдалитьНедопустимыеСимволыJSON(КомпонентыОбмена, ТелоСообщения);
	
	// 1. JSON -> Объекта XDTO
	ОбъектXDTO = ОбъектXDTOИзJSON(КомпонентыОбмена, ТелоСообщения, ПравилоОбработки.ОбъектВыборкиФормат);
	
	// 2. Объекта XDTO -> Структура
	ДанныеXDTO = ОбъектXDTOВСтруктуру(КомпонентыОбмена, ОбъектXDTO);
	Если ДанныеXDTO = Неопределено Тогда
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Не удалось преобразовать объект XDTO в структуру.'"));
	КонецЕсли;
	
	// Отработка ПОД
	ИспользованиеПКО = Новый Структура;
	Для Каждого ТекущееПКО Из ПравилоОбработки.ИспользуемыеПКО Цикл
		ИспользованиеПКО.Вставить(ТекущееПКО, Истина);
	КонецЦикла;
	ПриОбработкеПОД(КомпонентыОбмена,
		ПравилоОбработки, ИспользованиеПКО,
		ДанныеXDTO);
	
	// Поиск правила конвертации.
	ПравилоКонвертации = Неопределено;
	Для Каждого ТекущееПКО Из ИспользованиеПКО Цикл
		Если ТекущееПКО.Значение Тогда // TODO: Допустимо указание ПКО, не предназначенного для текущей версии формата данных.
			ПравилоКонвертации = ПКОПоИмени(КомпонентыОбмена, ТекущееПКО.Ключ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ПравилоКонвертации = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не найдено правило конвертации данных.'");
	КонецЕсли;
	
	// Выполнение ПКО
	Попытка
		// 3. Структура -> ИБ
		Возврат СтруктураОбъектаXDTOВДанныеИБ(
			КомпонентыОбмена, ПравилоКонвертации,
			ДанныеXDTO);
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

#Область JSON_ОбъектXDTO

Процедура УдалитьНедопустимыеСимволыJSON(КомпонентыОбмена, ТелоСообщения)
	
	Попытка
		
//		УдалитьНедопустимыеСимволы: Начало текста | Конец текста
		//@skip-check undefined-function
		ТелоСообщения = СтрЗаменитьПоРегулярномуВыражению(ТелоСообщения, "(?<!\\)(\x02|\x03|\\u0002|\\u0003)", "\n");
		
//		Экранирование: \b,\t,\n,\f,\r
		//@skip-check undefined-function
		ТелоСообщения = СтрЗаменитьПоРегулярномуВыражению(ТелоСообщения, "(?<!\\)\\(?=[btnfr])", "\\\\");
		
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Не удалось экранировать или удалить недопустимые символы.'"));
	КонецПопытки;
	
КонецПроцедуры

Функция ОбъектXDTOИзJSON(КомпонентыОбмена, ТелоСообщения, ТипXDTO)
	
	Попытка
		
		СтрокаJSON = СтрЗаменить("{""#value"":null}", "null", ТелоСообщения);
		
		ТипОбъектаXDTO = ФабрикаXDTO.Тип(КомпонентыОбмена.XMLСхема, ТипXDTO);
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Возврат ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON, ТипОбъектаXDTO);
		
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Не удалось прочитать объект XDTO из JSON.'"));
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ОбъектXDTO_Структура

// Выполняет преобразование объекта XDTO в структуру с данными.
//
// Параметры:
//  КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//  ОбъектXDTO - ОбъектXDTO - значение, которое необходимо преобразовать.
//
// Возвращаемое значение:
//  Структура - структура, имитирующая объект XDTO.
//    Ключи структуры соответствуют свойствам объекта XDTO.
//    Значения соответствуют значениям свойств объекта XDTO.
//
Функция ОбъектXDTOВСтруктуру(КомпонентыОбмена, ОбъектXDTO)
	
	Приемник = Новый Структура;
	
	Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл
		
		КонвертацияСвойстваXDTOВЭлементСтруктуры(ОбъектXDTO, Свойство, Приемник, КомпонентыОбмена);
		
	КонецЦикла;
	
	КлючевыеСвойстваКопия = Неопределено;
	СсылкаКопия = Неопределено;
	Если КомпонентыОбмена.ЭтоEnterpriseData
		И Приемник.Свойство(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата(), КлючевыеСвойстваКопия)
		И ТипЗнч(КлючевыеСвойстваКопия) = Тип("Структура")
		И КлючевыеСвойстваКопия.Свойство(КлассСсылкаФормата(КомпонентыОбмена, Неопределено), СсылкаКопия)
		Тогда
		
		Приемник.Вставить(КлассСсылкаФормата(КомпонентыОбмена, Неопределено), СсылкаКопия);
		
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

Процедура КонвертацияСвойстваXDTOВЭлементСтруктуры(Источник, Свойство, Приемник,
	КомпонентыОбмена, ИмяДляСвойстваСоставногоТипа = "", ТипСвойства = Неопределено)
	
	Если Не Источник.Установлено(Свойство) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоБазоваяСхема(КомпонентыОбмена, Свойство.URIПространстваИмен) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСвойства = ?(ИмяДляСвойстваСоставногоТипа = "", Свойство.Имя, ИмяДляСвойстваСоставногоТипа);
	
	ЗначениеXDTO = Источник.ПолучитьXDTO(Свойство);
	Если ТипСвойства <> Неопределено Тогда
		
		ТипЗначенияXDTO = ТипСвойства;
		
	ИначеЕсли ЗначениеXDTO <> Неопределено Тогда
		
		ТипЗначенияXDTO = ТипЗначенияСвойстваXDTO(КомпонентыОбмена, Свойство, ЗначениеXDTO);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Попытка
		Если ТипЗнч(ЗначениеXDTO) = Тип("ЗначениеXDTO") Тогда
			
			КонвертироватьПростоеСвойства(Приемник, ИмяСвойства, ЗначениеXDTO, ТипЗначенияXDTO);
			
		ИначеЕсли ТипЗнч(ЗначениеXDTO) = Тип("ОбъектXDTO") Тогда
			
			// В свойстве могут находиться:
			// - дополнительная информация
			// - табличная часть
			// - набор ключевых свойств
			// - набор общих свойств
			// - свойство составного типа.
			
			КлассЗначенияXDTO = ИмяКлассаЗначенияXDTO(Свойство, ТипЗначенияXDTO);
			
			Если КлассЗначенияXDTO = КлассПроизвольныеДанные() Тогда // Дополнительная информация
				
				Значение = СериализаторXDTO.ПрочитатьXDTO(ЗначениеXDTO);
				Приемник.Вставить(ИмяСвойства, Значение);
				
			ИначеЕсли КлассЗначенияXDTO = КлассТаблицаОбъекта() Тогда
				
				КонвертироватьТаблицуОбъекта(Приемник, КомпонентыОбмена, ИмяСвойства, Свойство, ТипЗначенияXDTO, ЗначениеXDTO);
				
			ИначеЕсли КлассЗначенияXDTO = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата() Тогда
				
				КонвертироватьКлючевоеСвойство(Приемник, КомпонентыОбмена, ИмяСвойства, ТипЗначенияXDTO, ЗначениеXDTO);
				
			ИначеЕсли КлассЗначенияXDTO = КлассОбщиеСвойства() Тогда 
				
				КонвертироватьОбщееСвойство(Приемник, КомпонентыОбмена, ИмяСвойства, ТипЗначенияXDTO, ЗначениеXDTO);
				
			Иначе
				
				КонвертироватьСоставноеСвойство(Приемник, КомпонентыОбмена, ИмяСвойства, ТипЗначенияXDTO, ЗначениеXDTO);
				
			КонецЕсли;
		КонецЕсли;
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке(),
			СтрШаблон(НСтр("ru = 'Ошибка чтения объекта XDTO, имя свойства: <%1>.'"), ИмяСвойства));
	КонецПопытки;
	
КонецПроцедуры

// Инкапсуляция алгоритмов преобразования свойств объекта XDTO в элементы структуры
Процедура КонвертироватьПростоеСвойства(Приемник,Знач ИмяСвойства, Знач ЗначениеXDTO, Знач ТипСвойства)
	
	Значение = ПрочитатьЗначениеXDTO(ЗначениеXDTO, ТипСвойства);
	
	Если ТипЗнч(Приемник) = Тип("Структура") Тогда
		Приемник.Вставить(ИмяСвойства, Значение);
	Иначе
		
		Если ТипЗнч(Приемник) = Тип("СтрокаТаблицыЗначений")
			И Приемник.Владелец().Колонки.Найти(ИмяСвойства) = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Приемник[ИмяСвойства] = Значение;
	КонецЕсли;
	
КонецПроцедуры

Процедура КонвертироватьТаблицуОбъекта(Приемник, Знач КомпонентыОбмена, Знач ИмяСвойства, Знач СвойствоXDTO, Знач ТипЗначенияXDTO, Знач ЗначениеXDTO)
	
	// Инициализируем таблицу значений, которая отображает табличную часть объекта.
	Значение = Новый ТаблицаЗначений;
	ИнициализироватьКолонкиТаблицыОбъектаПоТипу(Значение, ТипЗначенияXDTO.Свойства[0].Тип);
	
	ТабличнаяЧастьXDTO = ЗначениеXDTO[ТипЗначенияXDTO.Свойства[0].Имя];
	Если ТипЗнч(ТабличнаяЧастьXDTO) <> Тип("СписокXDTO") Тогда
		
		МассивОбъектовXDTO = Новый Массив(1);
		МассивОбъектовXDTO[0] = ТабличнаяЧастьXDTO;
		
		ТабличнаяЧастьXDTO = МассивОбъектовXDTO;
		
	КонецЕсли;
	
	Для Каждого СтрокаXDTO Из ТабличнаяЧастьXDTO Цикл
		
		СтрокаТЧ = Значение.Добавить();
		Для Каждого СвойствоСтрокиТЧ Из СтрокаXDTO.Свойства() Цикл
			КонвертацияСвойстваXDTOВЭлементСтруктуры(СтрокаXDTO, СвойствоСтрокиТЧ, СтрокаТЧ, КомпонентыОбмена, ,
				СвойствоСтрокиТЧ.Тип);
		КонецЦикла;
		
	КонецЦикла;
	
	Приемник.Вставить(ИмяСвойства, Значение);
	
КонецПроцедуры

Процедура КонвертироватьОбщееСвойство(Приемник, Знач КомпонентыОбмена, Знач ИмяСвойства, Знач ТипЗначенияXDTO, Знач ЗначениеXDTO)

	Если ТипЗнч(Приемник) = Тип("Структура") Тогда 
		ПриемникГруппыСвойств = Новый Структура;
		Для Каждого ПодСвойство Из ЗначениеXDTO.Свойства() Цикл
			
			ОписаниеСвойства = ТипЗначенияXDTO.Свойства.Получить(ПодСвойство.Имя);
			Если ОписаниеСвойства = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КонвертацияСвойстваXDTOВЭлементСтруктуры(ЗначениеXDTO, ПодСвойство, ПриемникГруппыСвойств, КомпонентыОбмена,,ОписаниеСвойства.Тип);
			
		КонецЦикла;
		
		Приемник.Вставить(ИмяСвойства, ПриемникГруппыСвойств);
		
		// По возможности свойства из группы свойств надо продублировать в приемнике,
		// Для совместимости с существующими правилами и алгоритмами.
		ЕстьКлючевыеСвойства = Приемник.Свойство(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства());
		Для Каждого СвойствоГруппы Из ПриемникГруппыСвойств Цикл
			ИмяПодСвойства = СвойствоГруппы.Ключ;
			Если НЕ Приемник.Свойство(ИмяПодСвойства)
				И НЕ (ЕстьКлючевыеСвойства И Приемник[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()].Свойство(ИмяПодСвойства)) Тогда
				Приемник.Вставить(ИмяПодСвойства, СвойствоГруппы.Значение);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого ПодСвойство Из ЗначениеXDTO.Свойства() Цикл
			
			ОписаниеСвойства = ТипЗначенияXDTO.Свойства.Получить(ПодСвойство.Имя);
			Если ОписаниеСвойства = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КонвертацияСвойстваXDTOВЭлементСтруктуры(ЗначениеXDTO, ПодСвойство, Приемник, КомпонентыОбмена,,ОписаниеСвойства.Тип);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КонвертироватьКлючевоеСвойство(Приемник, Знач КомпонентыОбмена, Знач ИмяСвойства, Знач ТипЗначенияXDTO, Знач ЗначениеXDTO)
	
	Значение = Новый Структура("ЭтоНаборКлючевыхСвойств");
	Значение.Вставить("ТипЗначения", СтрЗаменить(ТипЗначенияXDTO.Имя, ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата(), ""));

	Для Каждого КлючевоеСвойство Из ЗначениеXDTO.Свойства() Цикл
		ОписаниеСвойства = ТипЗначенияXDTO.Свойства.Получить(КлючевоеСвойство.Имя);
		Если ОписаниеСвойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КонвертацияСвойстваXDTOВЭлементСтруктуры(ЗначениеXDTO, КлючевоеСвойство, Значение, КомпонентыОбмена,,ОписаниеСвойства.Тип);
	КонецЦикла;
	
	Если ТипЗнч(Приемник) = Тип("Структура") Тогда
		Приемник.Вставить(ИмяСвойства, Значение);
	Иначе
		Приемник[ИмяСвойства] = Значение;
	КонецЕсли;

КонецПроцедуры

Процедура КонвертироватьСоставноеСвойство(Приемник, Знач КомпонентыОбмена, Знач ИмяСвойства, Знач ТипЗначенияXDTO, Знач ЗначениеXDTO)

	Для Каждого ПодСвойство Из ЗначениеXDTO.Свойства() Цикл
		
		ОписаниеСвойства = ТипЗначенияXDTO.Свойства.Получить(ПодСвойство.Имя);
		Если ОписаниеСвойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеXDTO.Установлено(ПодСвойство) Тогда
			Продолжить;
		КонецЕсли;
		
		КонвертацияСвойстваXDTOВЭлементСтруктуры(ЗначениеXDTO, ПодСвойство, Приемник, КомпонентыОбмена, ИмяСвойства, ОписаниеСвойства.Тип);
		Прервать;
		
	КонецЦикла;

КонецПроцедуры

Функция ПрочитатьЗначениеXDTO(ЗначениеXDTO, ТипСвойства = Неопределено)
	
	ТипСвойства = ?(ТипСвойства = Неопределено, ЗначениеXDTO.Тип(), ТипСвойства);
	
	Если ЗначениеXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтоСсылкаXDTO(ТипСвойства) Тогда // Конвертация ссылки
		
		Значение = ПрочитатьЗначениеXDTOСложногоТипа(ЗначениеXDTO, "Ссылка", ТипСвойства);
		
	ИначеЕсли ЗначениеXDTO.Тип().Фасеты <> Неопределено
		И ЗначениеXDTO.Тип().Фасеты.Перечисления <> Неопределено
		И ЗначениеXDTO.Тип().Фасеты.Перечисления.Количество() > 0 Тогда // Конвертация перечисления
		
		Значение = ПрочитатьЗначениеXDTOСложногоТипа(ЗначениеXDTO, "Перечисление", ТипСвойства);
		
	Иначе // Конвертация обычного значения.
		
		Значение = ЗначениеXDTO.Значение;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ПрочитатьЗначениеXDTOСложногоТипа(ЗначениеXDTO, СложныйТип, ТипСвойства = Неопределено)

	ТипСвойства = ?(ТипСвойства = Неопределено, ЗначениеXDTO.Тип(), ТипСвойства);
		
	СтруктураXDTO = Новый Структура;
	СтруктураXDTO.Вставить("ЭтоСсылка", СложныйТип = "Ссылка");
	СтруктураXDTO.Вставить("ЭтоПеречисление", СложныйТип = "Перечисление");
	СтруктураXDTO.Вставить("ТипЗначенияXDTO", ТипСвойства);
	СтруктураXDTO.Вставить("Значение", ЗначениеXDTO.Значение);
	
	Возврат СтруктураXDTO;
	
КонецФункции

// Определение типа свойства XDTO.
//
// Возвращаемое значение:
//  ТипЗначенияXDTO - тип свойства объекта XDTO.
//
Функция ТипЗначенияСвойстваXDTO(Знач КомпонентыОбмена, Знач СвойствоXDTO, ЗначениеXDTO)
	
	Результат = ЗначениеXDTO.Тип();
	Если СвойствоXDTO.ОбъектВладелец = Неопределено Тогда
		
		// Владельца может не быть у полностью нового объекта, который добавляется расширением
		// Например, работаем со справочником, который отсутствует в типовой конфигурации.
		Возврат Результат;
		
	КонецЕсли;
	
	ПространствоИменСвойства = СвойствоXDTO.URIПространстваИмен;
	Если ЭтоБазоваяСхема(КомпонентыОбмена, ПространствоИменСвойства) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	ТипXDTOВладельцаСвойства = СвойствоXDTO.ОбъектВладелец.Тип();
	
	ПространствоИменВладельца = ТипXDTOВладельцаСвойства.URIПространстваИмен;
	Если НЕ ЭтоБазоваяСхема(КомпонентыОбмена, ПространствоИменВладельца) Тогда
		
		// Свойство должно принадлежать объекту XDTO базовой схемы
		Возврат Результат;
		
	КонецЕсли;
	
	ОбъектXDTOРасширения = ФабрикаXDTO.Тип(ПространствоИменСвойства, ТипXDTOВладельцаСвойства.Имя);
	Если ОбъектXDTOРасширения <> Неопределено Тогда
		
		СвойствоОбъектаXDTOРасширения = ОбъектXDTOРасширения.Свойства.Получить(СвойствоXDTO.Имя);
		Если СвойствоОбъектаXDTOРасширения <> Неопределено Тогда
			
			Результат = СвойствоОбъектаXDTOРасширения.Тип;
			
		КонецЕсли;
		

	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

// Определение класса для значения свойства.
// Класс используется для выбора алгоритма преобразования в структуру.
//
Функция ИмяКлассаЗначенияXDTO(Знач СвойствоXDTO, Знач ТипЗначенияXDTO)
	
	Если СвойствоXDTO.Имя = "AdditionalInfo" Тогда
		Возврат КлассПроизвольныеДанные();
	ИначеЕсли ЭтоТипТаблицыОбъекта(ТипЗначенияXDTO) Тогда
		Возврат КлассТаблицаОбъекта();
	ИначеЕсли СтрНайти(ТипЗначенияXDTO.Имя, ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()) > 0 Тогда
		Возврат ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства();
	ИначеЕсли СтрНайти(ТипЗначенияXDTO.Имя, ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата()) > 0 Тогда
		Возврат ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата();
	ИначеЕсли СтрНайти(ТипЗначенияXDTO.Имя, КлассОбщиеСвойства()) > 0 Тогда
		Возврат КлассОбщиеСвойства();
	КонецЕсли;
	
	Возврат КлассСоставныеСвойства();
	
КонецФункции

// Параметры:
//   Таблица - ТаблицаЗначений - таблица для инициализации колонок.
//   Тип - ТипОбъектаXDTO - тип объекта.
//
Процедура ИнициализироватьКолонкиТаблицыОбъектаПоТипу(Таблица, Знач Тип)
	
	Для Каждого Колонка Из Тип.Свойства Цикл
		Если СтрНайти(Колонка.Тип.Имя, КлассОбщиеСвойства()) > 0 Тогда
			ИнициализироватьКолонкиТаблицыОбъектаПоТипу(Таблица, Колонка.Тип);
		Иначе
			Таблица.Колонки.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Структура_ДанныеИБ

// Возвращает объект информационной базы, соответствующий полученным данным.
// 
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//   ПравилоКонвертации - СтрокаТаблицыЗначений, Структура - правило конвертации объекта.
//   ДанныеXDTO       - Структура - структура, имитирующая объект XDTO.
//   Действие - Строка - определяет цель получения объекта ИБ:
//                       "ПолучитьСсылку" - идентификация объекта,
//                       "КонвертироватьИЗаписать" - полноценная загрузка объекта.
//
// Возвращаемое значение:
//   - СправочникОбъект, ДокументОбъект - объект ИБ, если передано действие "КонвертироватьИЗаписать",
//              либо если передано действие "ПолучитьСсылку" и в процессе ее получения был создан объект.
//   - ЛюбаяСсылка - ссылка на объект ИБ или пустая ссылка заданного типа, если было передано действие "ПолучитьСсылку"
//                   и в процессе ее получения объект не был создан.
//
Функция СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Знач ПравилоКонвертации, ДанныеXDTO, Действие = "КонвертироватьИЗаписать")
	
	ДанныеИБ = Неопределено;
	ПолученныеДанные = ИнициализироватьПолученныеДанные(ПравилоКонвертации);
	
	СоставСвойств = ?(Действие = "ПолучитьСсылку", "СвойстваПоиска", "Все");
	ПолученныеДанныеСсылка = Неопределено;
	
	КлассСсылкаФормата = КлассСсылкаФормата(КомпонентыОбмена, ПравилоКонвертации.Свойства);
	ДанныеXDTOСодержатСсылку = ДанныеXDTO.Свойство(КлассСсылкаФормата);
	
	ВариантИдентификации = СокрЛП(ПравилоКонвертации.ВариантИдентификации);
	ВариантИдентификацииПоИдентификатору = ВариантИдентификации = "ПоУникальномуИдентификатору"
		Или ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	// Получение ссылки на объект ИБ.
	Если ПравилоКонвертации.ЭтоСсылочныйТип Тогда
		
		ПолученныеДанныеСсылка = ПолученныеДанные.Ссылка;
		Если ДанныеXDTOСодержатСсылку И ВариантИдентификацииПоИдентификатору Тогда
			
			ОригинальныйУИДСтрокой = ?(КомпонентыОбмена.ЭтоEnterpriseData, ДанныеXDTO[КлассСсылкаФормата].Значение,
				ДанныеXDTO[КлассСсылкаФормата]);
			ПолученныеДанныеСсылка = СсылкаПоУИД(ПравилоКонвертации.ТипДанных, ОригинальныйУИДСтрокой, КомпонентыОбмена);
			
			ДанныеИБ = ПолученныеДанныеСсылка.ПолучитьОбъект();
			ПолученныеДанные.УстановитьСсылкуНового(ПолученныеДанныеСсылка);
			
			Если Действие = "ПолучитьСсылку" Тогда
				
				Если ДанныеИБ <> Неопределено Тогда
					// Задача: получение ссылки.
					// Идентификация: по УИД или УИД + поля поиска.
					// Объект с полученной ссылкой
					Возврат ДанныеИБ.Ссылка;
					
				ИначеЕсли ВариантИдентификации = "ПоУникальномуИдентификатору" Тогда
					// Задача: получение ссылки.
					// Идентификация: по УИД.
					// Объект с полученной ссылкой не найден.
					Возврат ПолученныеДанныеСсылка;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			ПолученныеДанныеСсылка = ПравилоКонвертации.МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор());
			ПолученныеДанные.УстановитьСсылкуНового(ПолученныеДанныеСсылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Конвертация свойств, для которых не нужно выполнение обработчика.
	КонвертацияСвойствСтруктурыОбъектаXDTO(
		КомпонентыОбмена,
		ДанныеXDTO,
		ПолученныеДанные,
		ПравилоКонвертации,
		1,
		СоставСвойств);
	
	Если Действие = "ПолучитьСсылку" И КомпонентыОбмена.ЭтоEnterpriseData Тогда
		ДанныеXDTO = Новый Структура(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства(),
			ОбщегоНазначения.СкопироватьРекурсивно(ДанныеXDTO));
	КонецЕсли;
	
	ПриКонвертацииДанныхXDTO(
		ДанныеXDTO,
		ПолученныеДанные,
		КомпонентыОбмена,
		ПравилоКонвертации.ПриКонвертацииДанныхXDTO);
		
	Если Действие = "ПолучитьСсылку" И КомпонентыОбмена.ЭтоEnterpriseData Тогда
		ДанныеXDTO = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеXDTO[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()]);
	КонецЕсли;
		
	КонвертацияСвойствСтруктурыОбъектаXDTO(
		КомпонентыОбмена,
		ДанныеXDTO,
		ПолученныеДанные,
		ПравилоКонвертации,
		2,
		СоставСвойств);
	
	// В результате конвертации свойств объект мог быть записан в случае наличия циклической ссылки.
	Если ПолученныеДанныеСсылка <> Неопределено И ОбщегоНазначения.СсылкаСуществует(ПолученныеДанныеСсылка) Тогда
		ДанныеИБ = ПолученныеДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если ДанныеИБ = Неопределено Тогда
		
		Если ПравилоКонвертации.ЭтоРегистр Тогда
			// Идентификация не производится, отбор набора записей выполняется в алгоритмах правил.
			ДанныеИБ = Неопределено;
			
		ИначеЕсли ВариантИдентификации = "ПоПолямПоиска"
				Или ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска" Тогда
			
			ДанныеИБ = СсылкаОбъектаПоСвойствамОбъектаXDTO(
				ПравилоКонвертации,
				ПолученныеДанные,
				ДанныеXDTOСодержатСсылку,
				КомпонентыОбмена,
				ОригинальныйУИДСтрокой);
			Если Не ЗначениеЗаполнено(ДанныеИБ) Тогда
				ДанныеИБ = Неопределено;
			КонецЕсли;
			
			Если ДанныеИБ <> Неопределено И ПравилоКонвертации.ЭтоСсылочныйТип Тогда
				Если Действие = "ПолучитьСсылку" Тогда
					// Задача: получение ссылки.
					// Идентификация: по УИД + поля поиска.
					// Объект найден по полям поиска.
					Возврат ДанныеИБ;
				Иначе
					ДанныеИБ = ДанныеИБ.ПолучитьОбъект();
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписыватьОбъектВИБ = ?(Действие = "КонвертироватьИЗаписать", Истина, Ложь);
	
	Если ВариантИдентификации = "ПоПолямПоиска" Или ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска" Тогда
		// Объекты, при идентификации которых используются поля поиска,
		// должны быть записаны в информационную базу с целью получения одной и той же ссылки на объект при каждом поиске.
		ЗаписыватьОбъектВИБ = Истина;
	КонецЕсли;
	
	Если ЗаписыватьОбъектВИБ Тогда
		
		ЭтоПолнаяЗагрузкаОбъекта = Действие = "КонвертироватьИЗаписать"
			Или ПравилоКонвертации.РазрешитьСоздаватьОбъектИзСтруктуры
			Или (Действие = "ПолучитьСсылку" И ДанныеИБ = Неопределено);
			
		Если ЭтоПолнаяЗагрузкаОбъекта
			И ПравилоКонвертации.ЕстьОбработчикПередЗаписьюПолученныхДанных Тогда
			
			ПередЗаписьюПолученныхДанных(
				ПолученныеДанные,
				ДанныеИБ,
				КомпонентыОбмена,
				ПравилоКонвертации.ПередЗаписьюПолученныхДанных,
				ПравилоКонвертации.Свойства);
			
		КонецЕсли;
		
		Если ДанныеИБ = Неопределено Тогда
			ДанныеДляЗаписиВИБ = ПолученныеДанные;
		Иначе
			Если ПолученныеДанные <> Неопределено Тогда
				ЗаполнитьДанныеИБПоПолученнымДанным(ДанныеИБ, ПолученныеДанные, ПравилоКонвертации);
			КонецЕсли;
			ДанныеДляЗаписиВИБ = ДанныеИБ;
		КонецЕсли;
		
		Если ДанныеДляЗаписиВИБ = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ПравилоКонвертации.ЭтоСсылочныйТип И ЭтоПолнаяЗагрузкаОбъекта Тогда
			ПровестиГенерациюКодаНомераПриНеобходимости(ДанныеДляЗаписиВИБ);
		КонецЕсли;
		
		Если ПравилоКонвертации.ЭтоСсылочныйТип И ДанныеДляЗаписиВИБ.ПометкаУдаления Тогда
			ДанныеДляЗаписиВИБ.ПометкаУдаления = Ложь;
		КонецЕсли;
		
		Если ПравилоКонвертации.ЭтоДокумент Тогда
			
			Попытка
				
				Если ПравилоКонвертации.ДокументМожетПроводиться Тогда
				
					Если ДанныеДляЗаписиВИБ.Проведен Тогда
						
						ДанныеДляЗаписиВИБ.Проведен = Ложь;
						//@skip-check bsl-legacy-check-string-literal
						Если Не ДанныеДляЗаписиВИБ.ЭтоНовый()
							И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляЗаписиВИБ.Ссылка, "Проведен") Тогда
							// Записываем новую версию документа с отменой проведения.
							
							//@skip-check module-unused-local-variable
							Результат = ОтменитьПроведениеОбъектаВИБ(ДанныеДляЗаписиВИБ, КомпонентыОбмена); // TODO: Результат
							
						Иначе
							// Записываем новую версию документа.
							ЗаписатьОбъектВИБ(КомпонентыОбмена, ДанныеДляЗаписиВИБ, ПравилоКонвертации.ТипДанных);
							Если ДанныеДляЗаписиВИБ = Неопределено Тогда
								Возврат Неопределено;
							КонецЕсли;
						КонецЕсли;
						
					Иначе
						Если ДанныеДляЗаписиВИБ.ЭтоНовый() Тогда
							ЗаписатьОбъектВИБ(КомпонентыОбмена, ДанныеДляЗаписиВИБ, ПравилоКонвертации.ТипДанных);
							Если ДанныеДляЗаписиВИБ = Неопределено Тогда
								Возврат Неопределено;
							КонецЕсли;
						Иначе
							
							ОтменитьПроведениеОбъектаВИБ(ДанныеДляЗаписиВИБ, КомпонентыОбмена);
						
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					ЗаписатьОбъектВИБ(КомпонентыОбмена, ДанныеДляЗаписиВИБ, ПравилоКонвертации.ТипДанных);
					Если ДанныеДляЗаписиВИБ = Неопределено Тогда
						Возврат Неопределено;
					КонецЕсли;
				КонецЕсли;
				
			Исключение
				ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Ошибка записи объекта в информационную базу'"));
			КонецПопытки;
			
		Иначе
			ЗаписатьОбъектВИБ(КомпонентыОбмена, ДанныеДляЗаписиВИБ, ПравилоКонвертации.ТипДанных);
			Если ДанныеДляЗаписиВИБ = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ДанныеДляЗаписиВИБ = ПолученныеДанные;
		
	КонецЕсли;
	
	Возврат ДанныеДляЗаписиВИБ;
	
КонецФункции

Функция ИнициализироватьПолученныеДанные(ПравилоКонвертации)
	
	ПолученныеДанные = Неопределено;
	
	Если ПравилоКонвертации.ЭтоДокумент Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьДокумент();
	ИначеЕсли ПравилоКонвертации.ЭтоСправочник
		Или ПравилоКонвертации.ЭтоПланВидовХарактеристик Тогда
		МенеджерОбъекта = ПравилоКонвертации.МенеджерОбъекта; //СправочникМенеджер
		Если ПравилоКонвертации.ПравилоДляГруппыСправочника Тогда
			ПолученныеДанные = МенеджерОбъекта.СоздатьГруппу();
		Иначе
			ПолученныеДанные = МенеджерОбъекта.СоздатьЭлемент();
		КонецЕсли;
	ИначеЕсли ПравилоКонвертации.ЭтоРегистр Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьНаборЗаписей();
	ИначеЕсли ПравилоКонвертации.ЭтоБизнесПроцесс Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьБизнесПроцесс();
	ИначеЕсли ПравилоКонвертации.ЭтоЗадача Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьЗадачу();
	ИначеЕсли ПравилоКонвертации.ЭтоПланСчетов Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьСчет();
	ИначеЕсли ПравилоКонвертации.ЭтоПланВидовРасчета Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьВидРасчета();
	КонецЕсли;
	
	Возврат ПолученныеДанные;
	
КонецФункции

Функция СсылкаПоУИД(ТипЗначенияОбъектаИБ, УИДОбъектаXDTO, КомпонентыОбмена)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗначенияОбъектаИБ);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ПустаяСсылка = ОписаниеТипов.ПривестиЗначение();

	МенеджерОбъектаМетаданных = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПустаяСсылка);
	
	Возврат МенеджерОбъектаМетаданных.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДОбъектаXDTO));
	
КонецФункции

Процедура КонвертацияСвойствСтруктурыОбъектаXDTO(
		КомпонентыОбмена,
		ДанныеXDTO,
		ПолученныеДанные,
		ПравилоКонвертации,
		НомерЭтапа = 1,
		СоставСвойств = "Все")
	
	Попытка
		Для Каждого ПКС Из ПравилоКонвертации.Свойства Цикл
			
			Если СоставСвойств = "СвойстваПоиска"
				И Не ПКС.ОбработкаПоисковогоСвойства Тогда
				Продолжить;
			КонецЕсли;
			
			//@skip-check query-in-loop
			КонвертацияСвойстваСтруктурыОбъектаXDTO(
				КомпонентыОбмена,
				ДанныеXDTO,
				ПолученныеДанные.ДополнительныеСвойства,
				ПолученныеДанные,
				ПКС,
				НомерЭтапа);
			
		КонецЦикла;
			
		Если СоставСвойств = "СвойстваПоиска" Тогда
			Возврат;
		КонецЕсли;
		
		// Конвертация табличных частей.
		Для Каждого ТЧ Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
			
			Если НомерЭтапа = 1 И ЗначениеЗаполнено(ТЧ.ТЧКонфигурации) И ЗначениеЗаполнено(ТЧ.ТЧФормата) Тогда
				
				// Прямая конвертация табличных частей.
				ТЧФормата = Неопределено; // ТаблицаЗначений
				Если НЕ ДанныеXDTO.Свойство(ТЧ.ТЧФормата, ТЧФормата) Тогда
					Продолжить;
				ИначеЕсли ТЧФормата.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				МассивКолонокТЧ = Новый Массив;
				Для Каждого КолонкаТЧ Из ТЧФормата.Колонки Цикл
					МассивКолонокТЧ.Добавить(КолонкаТЧ.Имя);
				КонецЦикла;
				
				ИменаКолонокСтрокой = СтрСоединить(МассивКолонокТЧ, ",");
				Для НомерСтроки = 1 По ТЧФормата.Количество() Цикл
					
					ДанныеСтрокиXDTO = ТЧФормата[НомерСтроки - 1];
					СтрокаТЧ = ПолученныеДанные[ТЧ.ТЧКонфигурации].Добавить();
					СтруктураДанныхСтрокиXDTO = Новый Структура(ИменаКолонокСтрокой);
					ЗаполнитьЗначенияСвойств(СтруктураДанныхСтрокиXDTO, ДанныеСтрокиXDTO);
					
					Для Каждого ПКС Из ТЧ.Свойства Цикл
						Если ПКС.ИспользуетсяАлгоритмКонвертации Тогда
							Продолжить;
						КонецЕсли;
						//@skip-check query-in-loop
						КонвертацияСвойстваСтруктурыОбъектаXDTO(
							КомпонентыОбмена,
							СтруктураДанныхСтрокиXDTO,
							ПолученныеДанные.ДополнительныеСвойства,
							СтрокаТЧ,
							ПКС,
							НомерЭтапа);
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НомерЭтапа = 2 И ТЧ.ИспользуетсяАлгоритмКонвертации
				И ЗначениеЗаполнено(ТЧ.ТЧКонфигурации)
				И ПолученныеДанные.ДополнительныеСвойства.Свойство(ТЧ.ТЧКонфигурации) Тогда
 				МассивСтруктурСДаннымиСтрок = ПолученныеДанные.ДополнительныеСвойства[ТЧ.ТЧКонфигурации];
				КоличествоСтрокТЧКонфигурации = ПолученныеДанные[ТЧ.ТЧКонфигурации].Количество();
				
				Для НомерСтроки = 1 По МассивСтруктурСДаннымиСтрок.Количество() Цикл
					
					// Возможно, строка уже была добавлена при прямой конвертации
					Если НомерСтроки <= КоличествоСтрокТЧКонфигурации Тогда
						СтрокаТЧ = ПолученныеДанные[ТЧ.ТЧКонфигурации][НомерСтроки - 1];
					Иначе
						СтрокаТЧ = ПолученныеДанные[ТЧ.ТЧКонфигурации].Добавить();
					КонецЕсли;
					
					Для Каждого ПКС Из ТЧ.Свойства Цикл
						
						Если НЕ ПКС.ИспользуетсяАлгоритмКонвертации Тогда
							Продолжить;
						КонецЕсли;
						
						//@skip-check query-in-loop
						КонвертацияСвойстваСтруктурыОбъектаXDTO(
							КомпонентыОбмена,
							ДанныеXDTO,
							ПолученныеДанные.ДополнительныеСвойства,
							СтрокаТЧ,
							ПКС,
							НомерЭтапа, 
							ТЧ.ТЧКонфигурации);
						
					КонецЦикла;
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Ошибка конвертации свойств.'"));
	КонецПопытки;
	
КонецПроцедуры

Процедура КонвертацияСвойстваСтруктурыОбъектаXDTO(
		КомпонентыОбмена,
		ДанныеXDTO,
		ДополнительныеСвойства,
		ПриемникДанных,
		ПКС,
		НомерЭтапа = 1,
		ИмяТЧ = "")
	
	Если ПустаяСтрока(ПКС.СвойствоКонфигурации) Или ПКС.СвойствоКонфигурации = КлассСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоКонвертацииСвойства = ПКС.ПравилоКонвертацииСвойства;
	
	ЗначениеСвойства = "";
	Попытка
		Если НомерЭтапа = 1 Тогда
			
			Если Не ЗначениеЗаполнено(ПКС.СвойствоФормата) Тогда
				Возврат;
			КонецЕсли;
			
			Если ПКС.ОбработкаКлючевогоСвойства
				И КомпонентыОбмена.ЭтоEnterpriseData
				И Не ДанныеXDTO.Свойство("ЭтоНаборКлючевыхСвойств") Тогда
				ИсточникДанных = ДанныеXDTO[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()];
			Иначе
				ИсточникДанных = ДанныеXDTO;
			КонецЕсли;
			
			СвойствоФормата_Имя = СокрЛП(ПКС.СвойствоФормата);
			ПозицияТочки = СтрНайти(СвойствоФормата_Имя, ".");
			// Указано полное имя свойства, входящего в группу общих свойств.
			Если ПозицияТочки > 0 Тогда
				ВложенныеСвойства = СтрРазделить(СвойствоФормата_Имя,".",Ложь);
				ПолучитьЗначениеВложенныхСвойств(ИсточникДанных, ВложенныеСвойства, ЗначениеСвойства);
			Иначе
				
				Если НЕ ИсточникДанных.Свойство(СвойствоФормата_Имя, ЗначениеСвойства)
					И НЕ ПКС.ОбработкаКлючевогоСвойства 
					И НЕ ПКС.ИспользуетсяАлгоритмКонвертации
					Тогда
					
					Если ПриемникДанных.ДополнительныеСвойства.Свойство("СвойстваОтсутствующиеВПолученныхДанных") Тогда
						
						ПриемникДанных.ДополнительныеСвойства.СвойстваОтсутствующиеВПолученныхДанных = ПриемникДанных.ДополнительныеСвойства.СвойстваОтсутствующиеВПолученныхДанных + "," + СвойствоФормата_Имя;
						
					Иначе
						
						ПриемникДанных.ДополнительныеСвойства.Вставить("СвойстваОтсутствующиеВПолученныхДанных", СвойствоФормата_Имя);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли НомерЭтапа = 2 Тогда
			
			Если НомерЭтапа = 2 И Не ПКС.ИспользуетсяАлгоритмКонвертации Тогда
				Возврат;
			КонецЕсли;
			
			// На 2-м этапе значения свойств получаются из дополнительных свойств объекта полученных данных
			// и представляют из себя структуру, содержащую инструкцию для конвертации, либо значение XDTO.
			// Если приемником значения является строка табличной части, то значение свойства располагается
			// в ДополнительныеСвойства[ИмяТабличнойЧасти][ИндексСтроки].
			Если ЗначениеЗаполнено(ИмяТЧ) Тогда
				//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
				ИсточникДанных = ДополнительныеСвойства[ИмяТЧ][ПриемникДанных.НомерСтроки - 1];
			Иначе
				ИсточникДанных = ДополнительныеСвойства;
			КонецЕсли;
			
			Если ИсточникДанных.Свойство(ПКС.СвойствоКонфигурации) Тогда
				ЗначениеСвойства = ИсточникДанных[ПКС.СвойствоКонфигурации];
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			Возврат;
		КонецЕсли;
		
		УдалятьСозданныеПоКлючевымСвойствам = КомпонентыОбмена.УдалятьСозданныеПоКлючевымСвойствам;
		Если ТипЗнч(ЗначениеСвойства) = Тип("Структура")
			И ЗначениеСвойства.Свойство("ИмяПКО")
			И ЗначениеСвойства.Свойство("Значение") Тогда
			
			// Значением является инструкция.
			Если ЗначениеСвойства.Свойство("УдалятьСозданныеПоКлючевымСвойствам") Тогда
				УдалятьСозданныеПоКлючевымСвойствам = ЗначениеСвойства.УдалятьСозданныеПоКлючевымСвойствам;
			КонецЕсли;
			
			ПравилоКонвертацииСвойства = ЗначениеСвойства.ИмяПКО;
			ЗначениеСвойства           = ЗначениеСвойства.Значение;
			
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеСвойства) = Тип("Структура") Тогда
			Если Не ЗначениеЗаполнено(ПравилоКонвертацииСвойства) Тогда
				Возврат;
			КонецЕсли;
			
			ПКПД = КомпонентыОбмена.ПравилаКонвертацииПредопределенныхДанных.Найти(ПравилоКонвертацииСвойства, "ИмяПКПД");
			Если ПКПД <> Неопределено Тогда
				
				Значение = ПКПД.КонвертацииЗначенийПриПолучении.Получить(ЗначениеСвойства.Значение);
				ПриемникДанных[ПКС.СвойствоКонфигурации] = Значение;
				Возврат;
				
			Иначе
				ПравилоКонвертацииСвойства = ПКОПоИмени(КомпонентыОбмена, ПравилоКонвертацииСвойства);
			КонецЕсли;
		Иначе
			// Конвертацию простых свойств выполняем только на 1-м этапе.
			ПриемникДанных[ПКС.СвойствоКонфигурации] = ЗначениеСвойства;
			Возврат;
		КонецЕсли;
		
		ПравилоКонвертации = Новый Структура("ПравилоКонвертации, УдалятьСозданныеПоКлючевымСвойствам",
			ПравилоКонвертацииСвойства, УдалятьСозданныеПоКлючевымСвойствам);
		ДанныеДляЗаписиВИБ = СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, ЗначениеСвойства, ПравилоКонвертации, "ПолучитьСсылку");
		
		Если ДанныеДляЗаписиВИБ <> Неопределено Тогда
			ПриемникДанных[ПКС.СвойствоКонфигурации] = ДанныеДляЗаписиВИБ.Ссылка;
		КонецЕсли;
		
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке(),
			СтрШаблон(НСтр("ru = 'Ошибка конвертации свойства объекта XDTO, имя свойства: <%1>.'"), ПКС.СвойствоКонфигурации));
	КонецПопытки;
	
КонецПроцедуры

Функция СсылкаОбъектаПоСвойствамОбъектаXDTO(ПравилоКонвертации, ПолученныеДанные, ДанныеXDTOСодержатСсылку, КомпонентыОбмена, ОригинальныйУИДСтрокой = "")

	Результат = Неопределено;
	// ПравилоКонвертации.ПоляПоискаОбъекта - массив, содержит разные варианты поиска
	//	элементы массива - таблица значений с полями поиска.
	Если ПравилоКонвертации.ПоляПоиска = Неопределено
		ИЛИ ТипЗнч(ПравилоКонвертации.ПоляПоиска) <> Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ПопыткаПоиска Из ПравилоКонвертации.ПоляПоиска Цикл
		ПоляПоиска = Новый Структура(ПопыткаПоиска);
		ЗаполнитьЗначенияСвойств(ПоляПоиска, ПолученныеДанные);
		
		// Если хотя бы одно поле поиска не заполнено, вариант поиска пропускается.
		// (Кроме справочников и планов видов характеристик - для них допустимо
		// незаполненное поле поиска "Родитель").
		// Вариант поиска является полноценным, если заполнены все поля.
		// В противном случае должен сработать другой вариант поиска.
		ЕстьНезаполненныеПоля = Ложь;
		Для Каждого ПолеПоиска Из ПоляПоиска Цикл
			Если Не ЗначениеЗаполнено(ПолеПоиска.Значение) Тогда
				Если (ПравилоКонвертации.ЭтоСправочник Или ПравилоКонвертации.ЭтоПланВидовХарактеристик)
					И ПолеПоиска.Ключ = "Родитель" Тогда
					Продолжить;
				КонецЕсли;
				
				ЕстьНезаполненныеПоля = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьНезаполненныеПоля Тогда
			// Переход к следующему варианту поиска.
			Продолжить;
		КонецЕсли;
		
		ПоискЗапросом = Ложь;
		// Возможно, поиск можно выполнить платформенными методами.
		Если ПравилоКонвертации.ЭтоДокумент
			И ПоляПоиска.Количество() = 2
			И ПоляПоиска.Свойство("Дата")
			И ПоляПоиска.Свойство("Номер") Тогда
			Результат = ПравилоКонвертации.МенеджерОбъекта.НайтиПоНомеру(ПоляПоиска.Номер, ПоляПоиска.Дата);
			Результат = ?(Результат.Пустая(), Неопределено, Результат);
		ИначеЕсли ПравилоКонвертации.ЭтоСправочник
			И ПоляПоиска.Количество() = 1
			И ПоляПоиска.Свойство("Наименование") Тогда
			Результат = ПравилоКонвертации.МенеджерОбъекта.НайтиПоНаименованию(ПоляПоиска.Наименование, Истина);
		ИначеЕсли ПравилоКонвертации.ЭтоСправочник
			И ПоляПоиска.Количество() = 1
			И ПоляПоиска.Свойство("Код") Тогда
			Результат = ПравилоКонвертации.МенеджерОбъекта.НайтиПоКоду(ПоляПоиска.Код);
		Иначе
			ПоискЗапросом = Истина;
		КонецЕсли;
		
		Если ПоискЗапросом Тогда
			Запрос = Новый Запрос;
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Таблица.Ссылка КАК Ссылка
			|ИЗ
			|	&ПолноеИмя КАК Таблица
			|ГДЕ
			|	&УсловиеОтбора";
			
			Отбор = Новый Массив;
			
			Для Каждого ПолеПоиска Из ПоляПоиска Цикл
				
				Если ОбменДаннымиПовтИсп.ЭтоСтроковыйРеквизитНеограниченнойДлины(ПравилоКонвертации.ПолноеИмя, ПолеПоиска.Ключ) Тогда
					
					ОтборСтрокой = "ВЫРАЗИТЬ(Таблица.[Ключ] КАК СТРОКА([ДлинаСтроки])) = &[Ключ]";
					ОтборСтрокой = СтрЗаменить(ОтборСтрокой, "[Ключ]", ПолеПоиска.Ключ);
					ОтборСтрокой = СтрЗаменить(ОтборСтрокой, "[ДлинаСтроки]", Формат(СтрДлина(ПолеПоиска.Значение), "ЧГ=0"));
					Отбор.Добавить(ОтборСтрокой);
					
				Иначе
					
					Отбор.Добавить(СтрЗаменить("Таблица.[Ключ] = &[Ключ]", "[Ключ]", ПолеПоиска.Ключ));
					
				КонецЕсли;
				
				Запрос.УстановитьПараметр(ПолеПоиска.Ключ, ПолеПоиска.Значение);
				
			КонецЦикла;
			
			УсловиеОтбора = СтрСоединить(Отбор, " И ");
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора", УсловиеОтбора);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмя", ПравилоКонвертации.ПолноеИмя);
			Запрос.Текст = ТекстЗапроса;
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				
				Результат = Выборка.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДанныеИБПоПолученнымДанным(ДанныеИБ, ПолученныеДанные, ПравилоКонвертации)
	
	СвойстваОтсутствующиеВПолученныхДанных = Новый Массив;
	Если ПолученныеДанные.ДополнительныеСвойства.Свойство("СвойстваОтсутствующиеВПолученныхДанных") Тогда
		
		СвойстваОтсутствующиеВПолученныхДанных = СтрРазделить(ПолученныеДанные.ДополнительныеСвойства.СвойстваОтсутствующиеВПолученныхДанных, ",", Ложь);
		
	КонецЕсли;
	
	ПоляКопии = ПравилоКонвертации.Свойства.ВыгрузитьКолонку("СвойствоКонфигурации");
	Если ПоляКопии.Количество() > 0 Тогда
		
		Для НомерПоля = 0 По ПоляКопии.ВГраница() Цикл
			
			ПоляКопии[НомерПоля] = СокрЛП(ПоляКопии[НомерПоля]);
			
		КонецЦикла;
		
		Для НомерОтсутствующегоПоля = 0 По СвойстваОтсутствующиеВПолученныхДанных.ВГраница() Цикл
			
			СвойстваОтсутствующиеВПолученныхДанных[НомерОтсутствующегоПоля] = СокрЛП(СвойстваОтсутствующиеВПолученныхДанных[НомерОтсутствующегоПоля]);
			
			ИндексОтсутствующегоПоля = ПоляКопии.Найти(СвойстваОтсутствующиеВПолученныхДанных[НомерОтсутствующегоПоля]);
			Если ИндексОтсутствующегоПоля <> Неопределено Тогда
				
				ПоляКопии.Удалить(ИндексОтсутствующегоПоля);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПоляКопируемые = СтрСоединить(ПоляКопии, ",");
		ПоляИсключаемые = СтрСоединить(СвойстваОтсутствующиеВПолученныхДанных, ",");
		
		ЗаполнитьЗначенияСвойств(ДанныеИБ, ПолученныеДанные, ПоляКопируемые, ПоляИсключаемые);
		
	КонецЕсли;
	
	Для Каждого КонвертацииТЧ Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
		
		ИмяТЧ = КонвертацииТЧ.ТЧКонфигурации;
		
		Если ПустаяСтрока(ИмяТЧ) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеИБ[ИмяТЧ].Очистить();
		ДанныеИБ[ИмяТЧ].Загрузить(ПолученныеДанные[ИмяТЧ].Выгрузить());
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПровестиГенерациюКодаНомераПриНеобходимости(Объект)
	
	ИмяТипаОбъекта = ОбщегоНазначения.ВидОбъектаПоТипу(ТипЗнч(Объект.Ссылка));
	
	// По типу документа смотрим заполнен код или номер.
	Если ИмяТипаОбъекта = "Документ"
		Или ИмяТипаОбъекта = "БизнесПроцесс"
		Или ИмяТипаОбъекта = "Задача" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Номер) Тогда
			
			Объект.УстановитьНовыйНомер();
			
		КонецЕсли;
		
	ИначеЕсли ИмяТипаОбъекта = "Справочник"
		Или ИмяТипаОбъекта = "ПланВидовХарактеристик" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Код)
			И Объект.Метаданные().Автонумерация Тогда
			
			Объект.УстановитьНовыйКод();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СнятьПометкуУдаленияСПредопределенногоЭлемента(Объект, ТипОбъекта, КомпонентыОбмена)
	
	ПометкаПредопределенный = Новый Структура("ПометкаУдаления, Предопределенный", Ложь, Ложь);
	ЗаполнитьЗначенияСвойств(ПометкаПредопределенный, Объект);
	
	Если ПометкаПредопределенный.ПометкаУдаления
		И ПометкаПредопределенный.Предопределенный Тогда
			
		Объект.ПометкаУдаления = Ложь;
		
		ВызватьИсключение НСтр("ru = 'Ошибка установки свойства предопределенного элемента.
			|Нельзя помечать на удаление предопределенный элемент. Пометка на удаление для объекта не установлена.'");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОбменДаннымиЗагрузка(КомпонентыОбмена, Объект) 
	
	Объект.ОбменДанными.Загрузка = КомпонентыОбмена.ОбменДаннымиЗагрузка;
	кфкИнтеграция.Отключить(Объект);
	
	Если КомпонентыОбмена.ОтключитьМеханизмРегистрации Тогда
		Объект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
		
	ИначеЕсли Объект.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Объект.ДополнительныеСвойства.Удалить("ОтключитьМеханизмРегистрацииОбъектов");
		
	КонецЕсли;
	
КонецПроцедуры

// Записывает объект в информационную базу.
//
// Параметры:
//  КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//  Объект - Произвольный - СправочникОбъект, ДокументОбъект и др записываемый объект.
//  Тип - Строка - тип объекта строкой.
// 
Процедура ЗаписатьОбъектВИБ(КомпонентыОбмена, Объект, Тип)
	
	УстановитьОбменДаннымиЗагрузка(КомпонентыОбмена, Объект);
	
	// Выполняем проверку на пометку удаления предопределенного элемента.
	СнятьПометкуУдаленияСПредопределенногоЭлемента(Объект, Тип, КомпонентыОбмена);
	
	ИспользоватьТранзакции = КомпонентыОбмена.ИспользоватьТранзакции;
	
	Если ИспользоватьТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	Попытка
		
		// Записываем объект в транзакцию.
		Объект.Записать();
		
		Если ИспользоватьТранзакции Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		Если ИспользоватьТранзакции Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Ошибка записи объекта в базу данных'"));
	КонецПопытки;
	
КонецПроцедуры

// Отменяет проведение объекта в информационной базе.
//
// Параметры:
//  Объект      - ДокументОбъект - документ для отмены проведения.
//  КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//
// Возвращаемое значение:
//   Булево - признак успешной отмены проведения.
//
Функция ОтменитьПроведениеОбъектаВИБ(Объект, КомпонентыОбмена = Неопределено)
	
	// Проверка на коллизии дат запрета загрузки.
	Объект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения");
	
	// Параметр "СинхронизацияДанныхЧерезУниверсальныйФорматУдалениеДвижений" используется при 
	// обработке удаления движений, например, в модуле набора записей регистра накопления.
	// Если разработчик определил такой параметр в правилах конвертации, пропускаем данный этап.
	Если НЕ Объект.ДополнительныеСвойства.Свойство("СинхронизацияДанныхЧерезУниверсальныйФорматУдалениеДвижений") Тогда
		
		Объект.ДополнительныеСвойства.Вставить("СинхронизацияДанныхЧерезУниверсальныйФорматУдалениеДвижений", Истина);
		
	КонецЕсли;
	
	ПроведениеДокументаОтменено = Ложь;
	ИспользоватьТранзакции = КомпонентыОбмена.ИспользоватьТранзакции;
	
	Если ИспользоватьТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	Попытка
		
		Если Объект.ДополнительныеСвойства.Свойство("ИспользоватьОтменуПроведенияДляОчисткиДвижений")
			И Объект.ДополнительныеСвойства.ИспользоватьОтменуПроведенияДляОчисткиДвижений = Истина Тогда
			
			УстановитьОбменДаннымиЗагрузка(КомпонентыОбмена, Объект);
			Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
			УстановитьОбменДаннымиЗагрузка(КомпонентыОбмена, Объект);
			
		Иначе
			
			// Устанавливаем режим загрузки данных для объекта.
			УстановитьОбменДаннымиЗагрузка(КомпонентыОбмена, Объект);
			
			// Отменяем проведение документа.
			Объект.Проведен = Ложь;
			Объект.Записать();
			
			ОбменДаннымиСервер.УдалитьДвиженияУДокумента(Объект);
			
		КонецЕсли;
		
		Объект.ДополнительныеСвойства.Удалить("СинхронизацияДанныхЧерезУниверсальныйФорматУдалениеДвижений");
		
		ПроведениеДокументаОтменено = Истина;
		Если ИспользоватьТранзакции Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		
		Если ИспользоватьТранзакции Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ШаблонТекста = НСтр("ru ='При отмене проведения документа:
			|%1
			|перед его повторной загрузкой произошла ошибка:
			|%2. 
			|Проблему можно проигнорировать (скрыть) если документ после загрузки проведен.'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОбработатьИсключение(ИнформацияОбОшибке(), ШаблонТекста);
		
	КонецПопытки;
	
	Возврат ПроведениеДокументаОтменено;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПринудительноеЗавершениеРаботы(КомпонентыОбмена)
	
	//@skip-check undefined-variable
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Если КомпонентыОбмена.ФлагОшибки Или КомпонентыОбмена.ФлагПропустить Тогда
		ВызватьИсключение(НСтр("ru = 'Принудительное завершение работы обработчика обмена.'"),
			КатегорияОшибки.ПринудительноеЗавершениеРаботы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередКонвертацией(КомпонентыОбмена, Источник)
	
	Попытка
		
		Если КомпонентыОбмена.ЭтоМенеджерОбменКФК Тогда
			КомпонентыОбмена.МенеджерОбмена.ПередКонвертацией(КомпонентыОбмена, Источник);
			
		Иначе
			КомпонентыОбмена.МенеджерОбмена.ПередКонвертацией(КомпонентыОбмена);
			
		КонецЕсли;
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), "ПК:ПередКонвертацией");
	КонецПопытки;
	
	ПринудительноеЗавершениеРаботы(КомпонентыОбмена);
	
КонецПроцедуры

Процедура ПослеКонвертации(КомпонентыОбмена, Источник, Результат)
	
	Попытка
		
		Если КомпонентыОбмена.ЭтоМенеджерОбменКФК Тогда
			КомпонентыОбмена.МенеджерОбмена.ПослеКонвертации(КомпонентыОбмена, Источник, Результат);
			
		Иначе
			КомпонентыОбмена.МенеджерОбмена.ПослеКонвертации(КомпонентыОбмена);
			
		КонецЕсли;
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), "ПК:ПослеКонвертации");
	КонецПопытки;
	
//	ПринудительноеЗавершениеРаботы(КомпонентыОбмена); // нетребуется
	
КонецПроцедуры

Процедура ПриОбработкеПОД(КомпонентыОбмена, ПравилоОбработки, ИспользованиеПКО, ОбъектОбработки)
	
	Если Не ЗначениеЗаполнено(ПравилоОбработки.ПриОбработке) Тогда
		Возврат;
	КонецЕсли;
		
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ОбъектОбработки",  ОбъектОбработки);
	СтруктураПараметров.Вставить("ИспользованиеПКО", ИспользованиеПКО);
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);

	Попытка
		
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ПравилоОбработки.ПриОбработке, СтруктураПараметров);
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), НСтр("ru = 'ПОД:ПриОбработке'"));
	КонецПопытки;
	
	ОбъектОбработки  = СтруктураПараметров.ОбъектОбработки;
	ИспользованиеПКО = СтруктураПараметров.ИспользованиеПКО;
	КомпонентыОбмена = СтруктураПараметров.КомпонентыОбмена;
	
	ПринудительноеЗавершениеРаботы(КомпонентыОбмена);
	
КонецПроцедуры

Процедура ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, Знач ИмяОбработчика, КомпонентыОбмена, СтекВыгрузки)
		
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ДанныеИБ", ДанныеИБ);
	СтруктураПараметров.Вставить("ДанныеXDTO", ДанныеXDTO);
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	СтруктураПараметров.Вставить("СтекВыгрузки", СтекВыгрузки);

	Попытка
		
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), НСтр("ru = 'ПКО:ПриОтправкеДанных'"));
	КонецПопытки;
	
	ДанныеXDTO       = СтруктураПараметров.ДанныеXDTO;
	КомпонентыОбмена = СтруктураПараметров.КомпонентыОбмена;
	СтекВыгрузки     = СтруктураПараметров.СтекВыгрузки;
	
	ПринудительноеЗавершениеРаботы(КомпонентыОбмена);
	
КонецПроцедуры

Процедура ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена, Знач ИмяОбработчика)
	
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ДанныеXDTO", ДанныеXDTO);
	СтруктураПараметров.Вставить("ПолученныеДанные", ПолученныеДанные);
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	
	Попытка
		
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), НСтр("ru = 'ПКО:ПриКонвертацииДанныхXDTO'"));
	КонецПопытки;
	
	ДанныеXDTO               = СтруктураПараметров.ДанныеXDTO;
	ПолученныеДанные         = СтруктураПараметров.ПолученныеДанные;
	КомпонентыОбмена         = СтруктураПараметров.КомпонентыОбмена;
	
	ПринудительноеЗавершениеРаботы(КомпонентыОбмена);
	
КонецПроцедуры

Процедура ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КомпонентыОбмена, ИмяОбработчика, КонвертацияСвойств)

	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ДанныеИБ", ДанныеИБ);
	СтруктураПараметров.Вставить("ПолученныеДанные", ПолученныеДанные);
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	СтруктураПараметров.Вставить("КонвертацияСвойств", КонвертацияСвойств);

	Попытка
		
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), НСтр("ru = 'ПКО:ПередЗаписьюПолученныхДанных'"));
	КонецПопытки;
	
	ДанныеИБ                 = СтруктураПараметров.ДанныеИБ;
	ПолученныеДанные         = СтруктураПараметров.ПолученныеДанные;
	КомпонентыОбмена         = СтруктураПараметров.КомпонентыОбмена;
	КонвертацияСвойств       = СтруктураПараметров.КонвертацияСвойств;
	
	ПринудительноеЗавершениеРаботы(КомпонентыОбмена);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Сбросить результат конвертации.
// 
// Параметры:
//  КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
Процедура СброситьРезультатКонвертации(КомпонентыОбмена)
	
	КомпонентыОбмена.ФлагОшибки = Ложь;
	КомпонентыОбмена.ФлагПропустить = Ложь;
	КомпонентыОбмена.ПротоколКонвертации = Новый Массив;
	
	ПользовательскиеНастройкиКонвертации(КомпонентыОбмена);
		
КонецПроцедуры

Процедура ПолучитьЗначениеВложенныхСвойств(ИсточникСвойства, ВложенныеСвойства, ЗначениеСвойства)
	ТекущийИсточникСвойства = ИсточникСвойства;
	ТекущееЗначениеСвойства = Неопределено;
	Для Уровень = 0 По ВложенныеСвойства.Количество()-1 Цикл
		Если НЕ ТекущийИсточникСвойства.Свойство(ВложенныеСвойства[Уровень], ТекущееЗначениеСвойства) Тогда
			Прервать;
		КонецЕсли;
		Если Уровень = ВложенныеСвойства.Количество()-1 Тогда
			ЗначениеСвойства = ТекущееЗначениеСвойства;
		ИначеЕсли ТипЗнч(ТекущееЗначениеСвойства) <> Тип("Структура") Тогда
			Прервать;
		Иначе
			ТекущийИсточникСвойства = ТекущееЗначениеСвойства;
			ТекущееЗначениеСвойства = Неопределено;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПоместитьЗначениеВложенныхСвойств(ПолучательСвойства, ВложенныеСвойства, ЗначениеСвойства, ЭтоСтрокаТЧ)
	ИмяСвойства = ВложенныеСвойства[0];
	ЗначениеВложенныхСвойств = Неопределено;
	Если ЭтоСтрокаТЧ Тогда
		Если ПолучательСвойства.Владелец().Колонки.Найти(ИмяСвойства) = Неопределено Тогда
			ПолучательСвойства.Владелец().Колонки.Добавить(ИмяСвойства);
		Иначе
			ЗначениеВложенныхСвойств = ПолучательСвойства[ИмяСвойства];
		КонецЕсли;
	Иначе
		Если НЕ ПолучательСвойства.Свойство(ИмяСвойства, ЗначениеВложенныхСвойств) Тогда
			ПолучательСвойства.Вставить(ИмяСвойства);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеВложенныхСвойств = Неопределено Тогда
		ЗначениеВложенныхСвойств = Новый Структура;
	КонецЕсли;
	СтруктураВложенныхСвойств = ЗначениеВложенныхСвойств;
	МаксимальныйУровень = ВложенныеСвойства.Количество() - 1;
	Для Уровень = 1 По МаксимальныйУровень Цикл
		ИмяВложенногоСвойства = ВложенныеСвойства[Уровень];
		Если Уровень = МаксимальныйУровень Тогда
			СтруктураВложенныхСвойств.Вставить(ИмяВложенногоСвойства, ЗначениеСвойства);
			Прервать;
		КонецЕсли;
		ПолучательВложенногоСвойства = Неопределено;
		СтруктураВложенныхСвойств.Свойство(ИмяВложенногоСвойства, ПолучательВложенногоСвойства);
		Если ПолучательВложенногоСвойства = Неопределено Тогда
			ПолучательВложенногоСвойства = Новый Структура;
		КонецЕсли;
		ПолучательВложенногоСвойства.Вставить(ИмяВложенногоСвойства, Новый Структура);
		СтруктураВложенныхСвойств = ПолучательВложенногоСвойства;
	КонецЦикла;
	ПолучательСвойства[ИмяСвойства] = ЗначениеВложенныхСвойств;
КонецПроцедуры

Функция ЭтоБазоваяСхема(Знач КомпонентыОбмена, Знач ПространствоИмен)
	
	Возврат ПустаяСтрока(ПространствоИмен) 
		Или КомпонентыОбмена.БазовыеСхемыФормата.Получить(ПространствоИмен) <> Неопределено;
		
КонецФункции

Функция XMLБазоваяСхема()
	
	Возврат "http://www.1c.ru/SSL/Exchange/Message";
	
КонецФункции

Функция ЭтоСсылкаXDTO(Знач Тип)
	
	Возврат ВРег(Тип.Имя) = "UUID" Или ФабрикаXDTO.Тип(XMLБазоваяСхема(), "Ref").ЭтоПотомок(Тип);
	
КонецФункции

Функция ЭтоТипТаблицыОбъекта(Знач ТипСвойстваXDTO)
	
	Если ТипЗнч(ТипСвойстваXDTO) = Тип("ТипОбъектаXDTO")
		И ТипСвойстваXDTO.Свойства.Количество() = 1 Тогда
		
		Возврат ТипСвойстваXDTO.Свойства[0].ВерхняяГраница <> 1;
		
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

#Область Классы
// Формализация классов значения свойств
//
Функция КлассОбщиеСвойства()
	Возврат "ОбщиеСвойства";
КонецФункции

Функция КлассСоставныеСвойства()
	Возврат "СоставныеСвойства";
КонецФункции

Функция КлассПроизвольныеДанные()
	Возврат "ПроизвольныеДанные";
КонецФункции

Функция КлассТаблицаОбъекта()
	Возврат "ТаблицаОбъекта";
КонецФункции

Функция КлассСсылка()
	Возврат "Ссылка";
КонецФункции

Функция КлассСсылкаФормата(КомпонентыОбмена, Свойства)
	
	Если КомпонентыОбмена.ЭтоEnterpriseData Тогда
		Возврат "Ссылка";
		
	ИначеЕсли Свойства = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось определить ключ ссылки формата'");
		
	Иначе
		ПКС = Свойства.Найти(КлассСсылка(), "СвойствоКонфигурации");
		Возврат ?(ПКС = Неопределено Или ПустаяСтрока(ПКС.СвойствоФормата),
			"afabaa4629db4804a2f35446d5befe0b", // заглушка
			ПКС.СвойствоФормата);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПоискПравилОбмена

// ПОД по имени.
// 
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	Имя - Строка - Имя ПОД
// 
// Возвращаемое значение:
//	Неопределено, Структура - Правило обработки данных:
Функция ПОДПоИмени(КомпонентыОбмена, Имя)
	
	Результат = КомпонентыОбмена.ПравилаОбработкиДанных.Найти(Имя, "Имя");
	Если Результат = Неопределено Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не найдено ПОД с именем %1'"), Имя);
		
	Иначе
		Возврат Результат;
		
	КонецЕсли;

КонецФункции

// ПКО по имени.
// 
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	Имя - Строка - Имя ПКО
// 
// Возвращаемое значение:
//	Неопределено, СтрокаТаблицыЗначений - Правило конвертации объекта.
Функция ПКОПоИмени(КомпонентыОбмена, Имя)
	
	Результат = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти(Имя, "ИмяПКО");
	Если Результат = Неопределено Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не найдено ПКО с именем %1'"), Имя);
		
	Иначе
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
