///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнициализацияОбмена

// Инициализирует компоненты обмена.
//
// Параметры:
//	НаправлениеОбмена - Строка - направление выполнения обмена: "Отправка" | "Получение".
//
// Возвращаемое значение:
//	Структура - содержит компоненты обмена (правила обмена и параметры обмена):
//	 * НаправлениеОбмена - Строка - "Отправка" или "Получение".
//	 
//	 * ВерсияФорматаОбмена - Строка - номер версии формата обмена.
//	 * XMLСхема - Строка - пространство имен формата обмена.
//	 * ЭтоEnterpriseData - Булево - признак того, что обмен выполняется с EnterpriseData.
//	 * БазовыеСхемыФормата - Соответствие Из КлючИЗначение - содержит соответствие пространств имена базовых схем формата
//	
//	 * МенеджерОбмена - Неопределено, ОбщийМодуль - модуль с правилами конвертации.
//	 * ЭтоМенеджерОбменКФК - Булево - модуль с правилами конвертации является частью КФК
//	 * ВерсияФорматаМенеджераОбмена - Строка - номер версии формата модуля с правилами конвертации.
//	 
//	 * КлючСообщения - Строка - ключ сообщения Kafka.
//	 * СвойстваСообщения - Структура - Дополнительные свойства сообщения.
//	 * ЗаголовкиСообщения - Соответствие Из КлючИЗначение - Заголовки сообщения Kafka.
//	 
//	 * ФлагОшибки - Булево - признак наличия ошибки при выполнении действия обмена.
//	 * ФлагПропустить - Булево - признак пропуска выполнения действия обмена.
//	 * ПротоколКонвертации - Массив Из Строка - список сообщений обмена данными.
//	 * НавигационнаяСсылка - Булево - (Получение) добавление навигационной ссылки в протокол конвертации.
//	 
//	 * ОтключитьПреобразованиеВNull - Булево - (Отправка) 'Истина' cохранять пустые значения без преобразования в null. По умолчанию Ложь (преобразование в null)
//	 * ИспользоватьТранзакции - Булево - (Получение) признак использования транзакций при записи полученных данных.
//	 * ОбменДаннымиЗагрузка - Булево - (Получение) значение устанавливаемого свойства "ОбменДанными.Загрузка".
//	 * ОтключитьМеханизмРегистрации - Булево - (Получение) признак необходимости регистрации данных к обратной отправке.
//	 
//	 * ОбъектыВыборкиФормата - Структура - (Получение) объекты выборки формата, которые отстувуют в схеме:
//	 	** Ключ - Строка - Имя ПОД
//	 	** Значение - Строка - Имя объекта выборки формата, которые отстувуют в схеме:
//	 * ОбъектыФормата - Структура - объекты формата:
//	 	** Ключ - Строка - Имя ПКО
//	 	** Значение - Строка - Имя объекта формата
//
Функция ИнициализироватьКомпонентыОбмена(НаправлениеОбмена) Экспорт
	
	КомпонентыОбмена = Новый Структура;
	КомпонентыОбмена.Вставить("НаправлениеОбмена", НаправлениеОбмена);
	
	// схема обмена
	КомпонентыОбмена.Вставить("ВерсияФорматаОбмена", ""); // см. ВерсияФорматаОбмена.ШаблоныТекстовМодулей
	КомпонентыОбмена.Вставить("XMLСхема", "");
	КомпонентыОбмена.Вставить("ЭтоEnterpriseData", Ложь);
	КомпонентыОбмена.Вставить("БазовыеСхемыФормата", Новый Соответствие);
	
	// правила обмена
	КомпонентыОбмена.Вставить("МенеджерОбмена", Неопределено);
	КомпонентыОбмена.Вставить("ЭтоМенеджерОбменКФК", Ложь);
	КомпонентыОбмена.Вставить("ВерсияФорматаМенеджераОбмена", "");
	КомпонентыОбмена.Вставить("ОбъектыВыборкиФормата", Новый Структура);
	КомпонентыОбмена.Вставить("ОбъектыФормата", Новый Структура);
	
	// Параметры сообщения и дополнительные свойства сообщения.
	КомпонентыОбмена.Вставить("КлючСообщения", "");
	КомпонентыОбмена.Вставить("СвойстваСообщения", Новый Структура);
	КомпонентыОбмена.Вставить("ЗаголовкиСообщения", Новый Соответствие);
	
	// логирование
	КомпонентыОбмена.Вставить("ФлагОшибки", Ложь);
	КомпонентыОбмена.Вставить("ФлагПропустить", Ложь);
	КомпонентыОбмена.Вставить("ПротоколКонвертации", Новый Массив);
	
	ПользовательскиеНастройкиКонвертации(КомпонентыОбмена);
	
	//@skip-check constructor-function-return-section
	Возврат КомпонентыОбмена;
	
КонецФункции

// Инициализирует таблицы значений с правилами обмена и помещает их в КомпонентыОбмена.
//
// Параметры:
//  КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//
Процедура ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена) Экспорт
	
	// Определение схемы формата обмена.
	КомпонентыОбмена.БазовыеСхемыФормата.Вставить(КомпонентыОбмена.XMLСхема, Истина);
	КомпонентыОбмена.БазовыеСхемыФормата.Вставить(XMLБазоваяСхема(), Истина);
	КомпонентыОбмена.ЭтоEnterpriseData = СтрНачинаетсяС(НРег(КомпонентыОбмена.XMLСхема),
		НРег("http://v8.1c.ru/edi/edi_stnd/EnterpriseData/"));
	
	// Определение версии формата обмена.
	ВерсияМенеджера = КомпонентыОбмена.МенеджерОбмена.ВерсияФорматаМенеджераОбмена(); // Строка
	КомпонентыОбмена.ВерсияФорматаМенеджераОбмена = СтрРазделить(ВерсияМенеджера, ".")[0];
	КомпонентыОбмена.ЭтоМенеджерОбменКФК = СтрЗаканчиваетсяНа(ВРег(ВерсияМенеджера), ".КФК");
	// Проверка поддержки версии формата обмена.
	Если КомпонентыОбмена.ВерсияФорматаМенеджераОбмена <> "2" Тогда
		ВызватьИсключение НСтр("ru = 'Неподдерживаемая версия формата обмена.'");
	КонецЕсли;
	
	// Инициализация таблиц правил обмена.
	КомпонентыОбмена.Вставить("ПравилаОбработкиДанных",     ТаблицаПравилОбработкиДанных(КомпонентыОбмена));
	КомпонентыОбмена.Вставить("ПравилаКонвертацииОбъектов", ТаблицаПравилКонвертации(КомпонентыОбмена));
	
	КомпонентыОбмена.Вставить("ПравилаКонвертацииПредопределенныхДанных",
		ТаблицаПравилКонвертацииПредопределенныхДанных(КомпонентыОбмена));
	
	КомпонентыОбмена.Вставить("ПараметрыКонвертации", СтруктураПараметровКонвертации(КомпонентыОбмена.МенеджерОбмена));
	
КонецПроцедуры

// Таблица правил обработки данных.
// 
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица правил обработки (ПОД):
// * Имя - Строка - 
// * ОбъектВыборкиФормат - Строка - 
// * ТипСсылкиXDTO - ТипЗначенияXDTO - 
// * ОбъектВыборкиМетаданные - ОбъектМетаданных - 
// * ВыборкаДанных - Строка - 
// * ИмяТаблицыДляВыборки - Строка - 
// * ПриОбработке - Строка - 
// * ИспользуемыеПКО - Массив из Строка - 
Функция ТаблицаПравилОбработкиДанных(КомпонентыОбмена) Экспорт
	
	XMLСхема = КомпонентыОбмена.XMLСхема;
	
	// Инициализация таблицы правил обработки данных.
	ПравилаОбработкиДанных = Новый ТаблицаЗначений;
	ПравилаОбработкиДанных.Колонки.Добавить("Имя");
	ПравилаОбработкиДанных.Колонки.Добавить("ОбъектВыборкиФормат");
	ПравилаОбработкиДанных.Колонки.Добавить("ТипСсылкиXDTO");
	ПравилаОбработкиДанных.Колонки.Добавить("ОбъектВыборкиМетаданные");
	ПравилаОбработкиДанных.Колонки.Добавить("ВыборкаДанных");
	ПравилаОбработкиДанных.Колонки.Добавить("ИмяТаблицыДляВыборки");
	ПравилаОбработкиДанных.Колонки.Добавить("ПриОбработке", Новый ОписаниеТипов("Строка"));
	
	// ИспользуемыеПКО - массив, содержащий имена ПКО, в которые может быть направлен объект из данного ПОД.
	ПравилаОбработкиДанных.Колонки.Добавить("ИспользуемыеПКО", Новый ОписаниеТипов("Массив"));
	
	КомпонентыОбмена.МенеджерОбмена.ЗаполнитьПравилаОбработкиДанных(
		КомпонентыОбмена.НаправлениеОбмена,
		ПравилаОбработкиДанных);
	
	КоличествоСтрок = ПравилаОбработкиДанных.Количество();
	Для НомерИтерации = 1 По КоличествоСтрок Цикл
		
		ИндексСтроки = КоличествоСтрок - НомерИтерации;
		ПОД = ПравилаОбработкиДанных.Получить(ИндексСтроки);
		Если Не ИнициализироватьПравилоОбработкиДанных(КомпонентыОбмена, XMLСхема, ПОД) Тогда
			ПравилаОбработкиДанных.Удалить(ПОД);
		КонецЕсли;
		
	КонецЦикла;
	
	Если КомпонентыОбмена.НаправлениеОбмена = "Отправка" Тогда
		ПравилаОбработкиДанных.Индексы.Добавить("Имя");
		ПравилаОбработкиДанных.Индексы.Добавить("ОбъектВыборкиМетаданные");
	Иначе
		ПравилаОбработкиДанных.Индексы.Добавить("ОбъектВыборкиФормат");
		ПравилаОбработкиДанных.Индексы.Добавить("ТипСсылкиXDTO");
	КонецЕсли;
	
	Возврат ПравилаОбработкиДанных;
	
КонецФункции

// Добавляет строку в таблицу правил конвертации и инициализирует значение в колонке "Свойства".
// Используется в модуле менеджера обмена при заполнении таблицы правил конвертации объектов.
//
// Параметры:
//  ПравилаКонвертации - см. КоллекцияПравилКонвертации
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - строка таблицы правил конвертации.
//
Функция ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации) Экспорт
	
	ПравилоКонвертации = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.Свойства = ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	Возврат ПравилоКонвертации;
	
КонецФункции

// Инициализирует таблицу значений для хранения правил конвертации свойств объекта.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица для хранения правил конвертации свойств:
//     * СвойствоКонфигурации - Строка
//     * СвойствоФормата - Строка
//     * ПравилоКонвертацииСвойства - Строка
//     * ИспользуетсяАлгоритмКонвертации - Булево
//     * ОбработкаКлючевогоСвойства - Булево
//     * ОбработкаПоисковогоСвойства - Булево
//     * ИмяТЧ - Строка
//
Функция ИнициализироватьТаблицуСвойствДляПравилаКонвертации() Экспорт
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипСтрока0 = ОбщегоНазначения.ОписаниеТипаСтрока(0);
	ТипСтрокаИмяПравила = ОбщегоНазначения.ОписаниеТипаСтрока(100); // BSLLS:MagicNumber-off
	
	ТаблицаПКС = Новый ТаблицаЗначений;
	ТаблицаПКС.Колонки.Добавить("СвойствоКонфигурации", ТипСтрока0);
	ТаблицаПКС.Колонки.Добавить("СвойствоФормата", ТипСтрока0);
	
	ТаблицаПКС.Колонки.Добавить("ПравилоКонвертацииСвойства", ТипСтрокаИмяПравила);
	ТаблицаПКС.Колонки.Добавить("ИспользуетсяАлгоритмКонвертации", ТипБулево);
	
	ТаблицаПКС.Колонки.Добавить("ОбработкаКлючевогоСвойства",  ТипБулево);
	ТаблицаПКС.Колонки.Добавить("ОбработкаПоисковогоСвойства", ТипБулево);
	
	ТаблицаПКС.Колонки.Добавить("ИмяТЧ", ТипСтрока0);
	
	ТаблицаПКС.Колонки.Добавить("ПространствоИмен", ТипСтрока0);
	
	ТаблицаПКС.Индексы.Добавить("ПространствоИмен");
	ТаблицаПКС.Индексы.Добавить("СвойствоКонфигурации");

	Возврат ТаблицаПКС;
	
КонецФункции

// Заполняет колонку со свойствами табличных частей пустой таблицей значений с определенными колонками.
// Используется в текущем модуле, а также в модуле менеджера обмена при заполнении таблицы правил конвертации объектов.
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - правило конвертации объектов.
//  ИмяКолонки - Строка - имя заполняемой колонки таблицы правил конвертации.
//
Процедура ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации, ИмяКолонки = "СвойстваТабличныхЧастей") Экспорт
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипСтрока0 = ОбщегоНазначения.ОписаниеТипаСтрока(0);
	
	СвойстваТабличныхЧастей = Новый ТаблицаЗначений;
	СвойстваТабличныхЧастей.Колонки.Добавить("ТЧКонфигурации",          ТипСтрока0);
	СвойстваТабличныхЧастей.Колонки.Добавить("ТЧФормата",               ТипСтрока0);
	СвойстваТабличныхЧастей.Колонки.Добавить("Свойства",                Новый ОписаниеТипов("ТаблицаЗначений"));
	СвойстваТабличныхЧастей.Колонки.Добавить("ИспользуетсяАлгоритмКонвертации", ТипБулево);
	
	СвойстваТабличныхЧастей.Колонки.Добавить("ПространствоИмен",        ТипСтрока0);
	СвойстваТабличныхЧастей.Индексы.Добавить("ПространствоИмен");
	
	ПравилоКонвертации[ИмяКолонки] = СвойстваТабличныхЧастей;
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// Формирует сообщение для отправки в очередь Kafka.
//
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	Источник - СправочникОбъект, ДокументОбъект, ЛюбаяСсылка, Структура - выгружаемые данные
//	ИмяПОД - Строка - Имя ПОД
//
// Возвращаемое значение:
//	Неопределено, Структура - Сообщение для отправки в очередь Kafka
Функция ПроизвестиВыгрузкуДанных(КомпонентыОбмена, Источник, ИмяПОД) Экспорт
	
	// Инициализация
	Результат = Неопределено;
	СброситьРезультатКонвертации(КомпонентыОбмена);
	
	Попытка
		
		// ПередКонвертацией
		ПередКонвертацией(КомпонентыОбмена, Источник);
		
		// Формирование сообщения	
		Результат = ВыгрузкаОбъектаВыборки(КомпонентыОбмена, Источник, ИмяПОД); // Неопределено, Структура
		
		// ПослеКонвертации
		ПослеКонвертации(КомпонентыОбмена, Источник, Результат);
		
	Исключение
		
		Результат = Неопределено;
		
		ОбработатьИсключениеКонвертации(КомпонентыОбмена, ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Если Результат = Неопределено И Не (КомпонентыОбмена.ФлагОшибки Или КомпонентыОбмена.ФлагПропустить) Тогда
		ЗаписатьВПротоколВыполнения(КомпонентыОбмена, НСтр("ru = 'Не удалось произвести конвертацию данных'"), Истина);
	КонецЕсли;
	
	// Результат
	Возврат Результат;
	
КонецФункции

// Произвести чтение данных.
// 
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	ТелоСообщения - Строка - Тело сообщения
//	ИмяПОД - Строка - Имя ПОД
//
// Возвращаемое значение:
//	Неопределено, ЛюбаяСсылка, РегистрСведенийКлючЗаписи - Результат загрузки данных
Функция ПроизвестиЧтениеДанных(КомпонентыОбмена, ТелоСообщения, ИмяПОД) Экспорт
	
	// Инициализация
	СброситьРезультатКонвертации(КомпонентыОбмена);
	
	Попытка
		
		// ПередКонвертацией
		ПередКонвертацией(КомпонентыОбмена, ТелоСообщения);
		
		// Формирование сообщения
		Результат = ПрочитатьСообщениеОбмена(
			КомпонентыОбмена, ТелоСообщения, ИмяПОД); // Неопределено, СправочникОбъект, ЛюбаяСсылка
		Если Результат <> Неопределено И КомпонентыОбмена.НавигационнаяСсылка Тогда
			ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ПолучитьНавигационнуюСсылку(Результат));
		КонецЕсли;
		
		// ПослеКонвертации
		ПослеКонвертации(КомпонентыОбмена, ТелоСообщения, Результат);
		
	Исключение
		
		ОбработатьИсключениеКонвертации(КомпонентыОбмена, ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияОбмена

Процедура ПользовательскиеНастройкиКонвертации(КомпонентыОбмена)
	
	// * Отправка:
	КомпонентыОбмена.Вставить("ОтключитьПреобразованиеВNull", Ложь);
	
	// * Получение:
	//	** Параметры записи
	КомпонентыОбмена.Вставить("ИспользоватьТранзакции", Истина);
	КомпонентыОбмена.Вставить("ОбменДаннымиЗагрузка", Истина);
	КомпонентыОбмена.Вставить("ОтключитьМеханизмРегистрации", Истина);
	//	** логирование
	КомпонентыОбмена.Вставить("НавигационнаяСсылка", Истина);
	
КонецПроцедуры

Функция ИнициализироватьПравилоОбработкиДанных(КомпонентыОбмена, XMLСхема, ПОД)

	Если КомпонентыОбмена.НаправлениеОбмена <> НаправлениеОбменаПолучение() Тогда
		Если ПОД.ОбъектВыборкиМетаданные <> Неопределено Тогда
			ПОД.ИмяТаблицыДляВыборки = ПОД.ОбъектВыборкиМетаданные.ПолноеИмя();
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;

	ТипXDTO = ФабрикаXDTO.Тип(XMLСхема, ПОД.ОбъектВыборкиФормат);
	Если ТипXDTO = Неопределено Тогда
		КомпонентыОбмена.ОбъектыВыборкиФормата.Вставить(ПОД.Имя, ПОД.ОбъектВыборкиФормат);
		Возврат Ложь;
	КонецЕсли;

	Если Не КомпонентыОбмена.ЭтоEnterpriseData Тогда
		Возврат Истина;
	КонецЕсли;

	КлючевыеСвойства = ТипXDTO.Свойства.Получить(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата());
	Если КлючевыеСвойства = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	СвойствоСсылкаXDTO = КлючевыеСвойства.Тип.Свойства
		.Получить(КлассСсылкаФормата(КомпонентыОбмена, Неопределено));
	Если СвойствоСсылкаXDTO <> Неопределено Тогда
		ПОД.ТипСсылкиXDTO = СвойствоСсылкаXDTO.Тип;
	КонецЕсли;

	Возврат Истина;

КонецФункции

// Коллекция правил конвертации.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица правил конвертации:
// * ИмяПКО - Строка - 
// * ОбъектДанных - Произвольный - 
// * ОбъектФормата - Строка - 
// * ТипПолученныхДанныхСтрокой - Строка - 
// * ИмяТаблицыПолученныхДанных - Строка - 
// * ПредставлениеТипаПолученныхДанных - Строка - 
// * Свойства - ТаблицаЗначений - 
// * ПоляПоиска - Массив из Строка - 
// * ПоляПредставленияОбъекта - Строка - 
// * РеквизитыШапкиПолученныхДанных - Массив из Строка - 
// * ПриОтправкеДанных - Строка - 
// * ПриКонвертацииДанныхXDTO - Строка - 
// * ПередЗаписьюПолученныхДанных - Строка - 
// * ПослеЗагрузкиВсехДанных - Строка - 
// * ПравилоДляГруппыСправочника - Булево - 
// * ВариантИдентификации - Строка - 
// * РазрешитьСоздаватьОбъектИзСтруктуры - Произвольный - 
// * СвойстваТабличныхЧастейОбработанные - ТаблицаЗначений - 
// * СвойстваТабличныхЧастей - Структура - 
Функция КоллекцияПравилКонвертации()
	
	// BSLLS:MagicNumber-off
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипСтрока0 = ОбщегоНазначения.ОписаниеТипаСтрока(0);
	ТипСтрокаВариантИдентификации = ОбщегоНазначения.ОписаниеТипаСтрока(60);
	ТипСтрокаПредставление = ОбщегоНазначения.ОписаниеТипаСтрока(300);
	// BSLLS:MagicNumber-on
	
	// Инициализация таблицы правил конвертации.
	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("ИмяПКО", ТипСтрока0);
	ПравилаКонвертации.Колонки.Добавить("ОбъектДанных");
	ПравилаКонвертации.Колонки.Добавить("ОбъектФормата", ТипСтрока0);
	ПравилаКонвертации.Колонки.Добавить("ТипПолученныхДанныхСтрокой", ТипСтрокаПредставление);
	ПравилаКонвертации.Колонки.Добавить("ИмяТаблицыПолученныхДанных", ТипСтрокаПредставление);
	ПравилаКонвертации.Колонки.Добавить("ПредставлениеТипаПолученныхДанных", ТипСтрокаПредставление);
	ПравилаКонвертации.Колонки.Добавить("Свойства", Новый ОписаниеТипов("ТаблицаЗначений"));
	ПравилаКонвертации.Колонки.Добавить("ПоляПоиска", Новый ОписаниеТипов("Массив"));
	ПравилаКонвертации.Колонки.Добавить("ПоляПредставленияОбъекта", ТипСтрокаПредставление);
	ПравилаКонвертации.Колонки.Добавить("РеквизитыШапкиПолученныхДанных", Новый ОписаниеТипов("Массив"));
	ПравилаКонвертации.Колонки.Добавить("ПриОтправкеДанных", ТипСтрока0);
	ПравилаКонвертации.Колонки.Добавить("ПриКонвертацииДанныхXDTO", ТипСтрока0);
	ПравилаКонвертации.Колонки.Добавить("ПередЗаписьюПолученныхДанных", ТипСтрока0);
	ПравилаКонвертации.Колонки.Добавить("ПослеЗагрузкиВсехДанных", ТипСтрока0);
	ПравилаКонвертации.Колонки.Добавить("ПравилоДляГруппыСправочника", ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ВариантИдентификации", ТипСтрокаВариантИдентификации);
	ПравилаКонвертации.Колонки.Добавить("ПространствоИмен", ТипСтрока0);
	ПравилаКонвертации.Колонки.Добавить("РазрешитьСоздаватьОбъектИзСтруктуры");
	ПравилаКонвертации.Колонки.Добавить("СвойстваТабличныхЧастей", Новый ОписаниеТипов("ТаблицаЗначений"));
	
	// Добавляем служебные поля таблицы правил конвертации.
	ПравилаКонвертации.Колонки.Добавить("ТипXDTO");
	ПравилаКонвертации.Колонки.Добавить("ТипСсылкиXDTO");
	ПравилаКонвертации.Колонки.Добавить("ТипКлючевыхСвойствОбъектаXDTO");
	ПравилаКонвертации.Колонки.Добавить("ТипДанных");
	
	ПравилаКонвертации.Колонки.Добавить("МенеджерОбъекта");
	ПравилаКонвертации.Колонки.Добавить("ПолноеИмя");
	
	ПравилаКонвертации.Колонки.Добавить("ЭтоДокумент",               ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЭтоРегистр",                ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЭтоСправочник",             ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЭтоПеречисление",           ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЭтоПланВидовХарактеристик", ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЭтоБизнесПроцесс",          ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЭтоЗадача",                 ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЭтоПланСчетов",             ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЭтоПланВидовРасчета",       ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЭтоКонстанта",              ТипБулево);
	
	ПравилаКонвертации.Колонки.Добавить("ДокументМожетПроводиться", ТипБулево);
	
	ПравилаКонвертации.Колонки.Добавить("ЭтоСсылочныйТип", ТипБулево);
	
	ПравилаКонвертации.Колонки.Добавить("ЕстьОбработчикПриОтправкеДанных",            ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЕстьОбработчикПриКонвертацииДанныхXDTO",     ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЕстьОбработчикПередЗаписьюПолученныхДанных", ТипБулево);
	ПравилаКонвертации.Колонки.Добавить("ЕстьОбработчикПослеЗагрузкиВсехДанных",      ТипБулево);
	
	Возврат ПравилаКонвертации;
	
КонецФункции

Функция ТаблицаПравилКонвертации(КомпонентыОбмена)
	
	ПравилаКонвертации = КоллекцияПравилКонвертации();
	КомпонентыОбмена.МенеджерОбмена.ЗаполнитьПравилаКонвертацииОбъектов(
		КомпонентыОбмена.НаправлениеОбмена,
		ПравилаКонвертации);
	
	Если КомпонентыОбмена.НаправлениеОбмена = НаправлениеОбменаПолучение() Тогда
		ЗаполнитьРазрешениеСозданияОбъектов(КомпонентыОбмена, ПравилаКонвертации);
	КонецЕсли;
	
	РазрешитьПроведениеДокумента = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
	КоличествоСтрок = ПравилаКонвертации.Количество();
	Для НомерИтерации = 1 По КоличествоСтрок Цикл
		
		ИндексСтроки = КоличествоСтрок - НомерИтерации;
		ПравилоКонвертации = ПравилаКонвертации.Получить(ИндексСтроки);
		Если Не ИнициализироватьПравилоКонвертации(
				КомпонентыОбмена,
				ПравилоКонвертации,
				РазрешитьПроведениеДокумента) Тогда
			ПравилаКонвертации.Удалить(ПравилоКонвертации);
		КонецЕсли;
		
	КонецЦикла;

	ПравилаКонвертации.Индексы.Добавить("ИмяПКО");
	ПравилаКонвертации.Индексы.Добавить("ТипДанных");
	ПравилаКонвертации.Индексы.Добавить("ТипXDTO");
	Если КомпонентыОбмена.НаправлениеОбмена = НаправлениеОбменаПолучение() Тогда
		ПравилаКонвертации.Индексы.Добавить("ТипСсылкиXDTO");
	КонецЕсли;

	Возврат ПравилаКонвертации;

КонецФункции

Процедура ЗаполнитьРазрешениеСозданияОбъектов(КомпонентыОбмена, ПравилаКонвертации)

	// Отберем строки правил конвертации, у которых не заполнен реквизит "РазрешитьСоздаватьОбъектИзСтруктуры".
	ПараметрыОтбора = Новый Структура("РазрешитьСоздаватьОбъектИзСтруктуры", Неопределено);
	СтрокиДляОбработки = ПравилаКонвертации.НайтиСтроки(ПараметрыОтбора);

	// Для найденных строк необходимо заполнить реквизит "РазрешитьСоздаватьОбъектИзСтруктуры".
	// Реквизит заполняется по следующему алгоритму:
	// если правило конвертации объекта формата не указано
	// в правилах обработки данных для данного объекта формата, 
	// тогда реквизит заполняется значением "Истина", 
	// т.к. полученные по этому ПКО данные не смогут быть загружены самостоятельно,
	// иначе заполняем значением "Ложь".
	Для Каждого ПравилоКонвертации Из СтрокиДляОбработки Цикл
		
		ПравилоКонвертации.РазрешитьСоздаватьОбъектИзСтруктуры = Истина;
		ПравилоОбработкиДанных = КомпонентыОбмена.ПравилаОбработкиДанных
			.Найти(ПравилоКонвертации.ОбъектФормата, "ОбъектВыборкиФормат");
		Если ПравилоОбработкиДанных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПравилоКонвертации.РазрешитьСоздаватьОбъектИзСтруктуры = ПравилоОбработкиДанных.ИспользуемыеПКО
			.Найти(ПравилоКонвертации.ИмяПКО) = Неопределено;
		
	КонецЦикла;

КонецПроцедуры

Функция ИнициализироватьПравилоКонвертации(
		КомпонентыОбмена, ПравилоКонвертации, РазрешитьПроведениеДокумента)

	ЭтоБазоваяСхемаПравила = ЭтоБазоваяСхема(КомпонентыОбмена, ПравилоКонвертации.ПространствоИмен);
	ПространствоИмен = ?(
		ЭтоБазоваяСхемаПравила,
		КомпонентыОбмена.XMLСхема,
		ПравилоКонвертации.ПространствоИмен);

	Если ЗначениеЗаполнено(ПравилоКонвертации.ОбъектФормата) Тогда
		ПравилоКонвертации.ТипXDTO = ФабрикаXDTO.Тип(ПространствоИмен, ПравилоКонвертации.ОбъектФормата);
		Если ПравилоКонвертации.ТипXDTO = Неопределено Тогда
			КомпонентыОбмена.ОбъектыФормата.Вставить(
				ПравилоКонвертации.ИмяПКО,
				ПравилоКонвертации.ОбъектФормата);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	Если КомпонентыОбмена.НаправлениеОбмена = НаправлениеОбменаПолучение() Тогда
		ЗаполнитьПараметрыПолученияПравилаКонвертации(ПравилоКонвертации);
	Иначе
		ПравилоКонвертации.ЕстьОбработчикПриОтправкеДанных = Не ПустаяСтрока(
			ПравилоКонвертации.ПриОтправкеДанных);
	КонецЕсли;

	Если ПравилоКонвертации.ОбъектДанных <> Неопределено Тогда
		ЗаполнитьТипОбъектаПравилаКонвертации(ПравилоКонвертации, РазрешитьПроведениеДокумента);
	КонецЕсли;

	ПравилоКонвертации.ЭтоСсылочныйТип = ПравилоКонвертации.ЭтоДокумент
		Или ПравилоКонвертации.ЭтоСправочник
		Или ПравилоКонвертации.ЭтоПланВидовХарактеристик
		Или ПравилоКонвертации.ЭтоБизнесПроцесс
		Или ПравилоКонвертации.ЭтоЗадача
		Или ПравилоКонвертации.ЭтоПланСчетов
		Или ПравилоКонвертации.ЭтоПланВидовРасчета;

	ОтметитьКлючевыеСвойстваПравилаКонвертации(КомпонентыОбмена, ПравилоКонвертации);
	ОтметитьПоисковыеСвойстваПравилаКонвертации(ПравилоКонвертации);
	ОтметитьАлгоритмыТабличныхЧастей(ПравилоКонвертации);

	Возврат Истина;

КонецФункции

Процедура ЗаполнитьПараметрыПолученияПравилаКонвертации(ПравилоКонвертации)

	МетаданныеОбъекта = ПравилоКонвертации.ОбъектДанных;
	ПравилоКонвертации.ИмяТаблицыПолученныхДанных = МетаданныеОбъекта.ПолноеИмя();
	ПравилоКонвертации.ПредставлениеТипаПолученныхДанных = МетаданныеОбъекта.Представление();
	ПравилоКонвертации.ТипПолученныхДанныхСтрокой = ИмяТипаДанныхПоОбъектуМетаданных(
		ПравилоКонвертации.ОбъектДанных);
	ПравилоКонвертации.ПоляПредставленияОбъекта = ?(
		ПравилоКонвертации.ПоляПоиска.Количество() = 0,
		"",
		ПравилоКонвертации.ПоляПоиска[0]);

	Реквизиты = Новый Массив;
	Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		Если ЭтоСтандартныйРеквизитОбъектаПолучения(Реквизит.Имя) Тогда
			Реквизиты.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		Реквизиты.Добавить(Реквизит.Имя);
	КонецЦикла;
	ПравилоКонвертации.РеквизитыШапкиПолученныхДанных = Реквизиты;

	ПравилоКонвертации.ЕстьОбработчикПриКонвертацииДанныхXDTO = Не ПустаяСтрока(
		ПравилоКонвертации.ПриКонвертацииДанныхXDTO);
	ПравилоКонвертации.ЕстьОбработчикПередЗаписьюПолученныхДанных = Не ПустаяСтрока(
		ПравилоКонвертации.ПередЗаписьюПолученныхДанных);
	ПравилоКонвертации.ЕстьОбработчикПослеЗагрузкиВсехДанных = Не ПустаяСтрока(
		ПравилоКонвертации.ПослеЗагрузкиВсехДанных);

КонецПроцедуры

Процедура ЗаполнитьТипОбъектаПравилаКонвертации(ПравилоКонвертации, РазрешитьПроведениеДокумента)

	ПравилоКонвертации.ПолноеИмя = ПравилоКонвертации.ОбъектДанных.ПолноеИмя();
	ПравилоКонвертации.МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(
		ПравилоКонвертации.ПолноеИмя);

	ПравилоКонвертации.ЭтоРегистр = Ложь;
	ПравилоКонвертации.ЭтоДокумент = Ложь;
	ПравилоКонвертации.ЭтоСправочник = Ложь;
	ПравилоКонвертации.ЭтоПеречисление = Ложь;
	ПравилоКонвертации.ЭтоПланВидовХарактеристик = Ложь;
	ПравилоКонвертации.ЭтоБизнесПроцесс = Ложь;
	ПравилоКонвертации.ЭтоЗадача = Ложь;
	ПравилоКонвертации.ЭтоПланСчетов = Ложь;
	ПравилоКонвертации.ЭтоПланВидовРасчета = Ложь;
	ПравилоКонвертации.ЭтоКонстанта = Ложь;

	Если ОбменДаннымиПовтИсп.ЭтоСправочник(ПравилоКонвертации.ПолноеИмя) Тогда
		ПравилоКонвертации.ЭтоСправочник = Истина;
	ИначеЕсли ОбменДаннымиПовтИсп.ЭтоДокумент(ПравилоКонвертации.ПолноеИмя) Тогда
		ПравилоКонвертации.ЭтоДокумент = Истина;
	ИначеЕсли ОбменДаннымиПовтИсп.ЭтоПеречисление(ПравилоКонвертации.ПолноеИмя) Тогда
		ПравилоКонвертации.ЭтоПеречисление = Истина;
	ИначеЕсли ОбменДаннымиПовтИсп.ЭтоРегистр(ПравилоКонвертации.ПолноеИмя) Тогда
		ПравилоКонвертации.ЭтоРегистр = Истина;
	ИначеЕсли ОбменДаннымиПовтИсп.ЭтоПланВидовХарактеристик(ПравилоКонвертации.ПолноеИмя) Тогда
		ПравилоКонвертации.ЭтоПланВидовХарактеристик = Истина;
	ИначеЕсли ОбменДаннымиПовтИсп.ЭтоБизнесПроцесс(ПравилоКонвертации.ПолноеИмя) Тогда
		ПравилоКонвертации.ЭтоБизнесПроцесс = Истина;
	ИначеЕсли ОбменДаннымиПовтИсп.ЭтоЗадача(ПравилоКонвертации.ПолноеИмя) Тогда
		ПравилоКонвертации.ЭтоЗадача = Истина;
	ИначеЕсли ОбменДаннымиПовтИсп.ЭтоПланСчетов(ПравилоКонвертации.ПолноеИмя) Тогда
		ПравилоКонвертации.ЭтоПланСчетов = Истина;
	ИначеЕсли ОбменДаннымиПовтИсп.ЭтоПланВидовРасчета(ПравилоКонвертации.ПолноеИмя) Тогда
		ПравилоКонвертации.ЭтоПланВидовРасчета = Истина;
	ИначеЕсли ОбменДаннымиПовтИсп.ЭтоКонстанта(ПравилоКонвертации.ПолноеИмя) Тогда
		ПравилоКонвертации.ЭтоКонстанта = Истина;
	Иначе
		ПравилоКонвертации.ЭтоКонстанта = Ложь;
	КонецЕсли;

	ПравилоКонвертации.ТипДанных = Тип(
		ИмяТипаДанныхПоОбъектуМетаданных(ПравилоКонвертации.ОбъектДанных));
	Если ПравилоКонвертации.ЭтоДокумент Тогда
		ПравилоКонвертации.ДокументМожетПроводиться = ПравилоКонвертации.ОбъектДанных.Проведение
			= РазрешитьПроведениеДокумента;
	КонецЕсли;

КонецПроцедуры

Процедура ОтметитьПоисковыеСвойстваПравилаКонвертации(ПравилоКонвертации)

	Если ПравилоКонвертации.ВариантИдентификации <> "ПоПолямПоиска"
			И ПравилоКонвертации.ВариантИдентификации
				<> ВариантИдентификацииСначалаПоУИДПотомПоПолям() Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ПравилоКонвертации.ПоляПоиска) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ПКС Из ПравилоКонвертации.Свойства Цикл
		Для Каждого ЭлементПолейПоиска Из ПравилоКонвертации.ПоляПоиска Цикл
			Для Каждого ПолеПоиска Из СтрРазделить(ЭлементПолейПоиска, ",") Цикл
				Если СокрЛП(ПолеПоиска) = ПКС.СвойствоКонфигурации Тогда
					ПКС.ОбработкаПоисковогоСвойства = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтметитьАлгоритмыТабличныхЧастей(ПравилоКонвертации)
	
	Для Каждого ПКСТЧ Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
		Для Каждого ПКС Из ПКСТЧ.Свойства Цикл
			Если ПКС.ИспользуетсяАлгоритмКонвертации Тогда
				ПКСТЧ.ИспользуетсяАлгоритмКонвертации = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаПравилКонвертацииПредопределенныхДанных(КомпонентыОбмена)
	
	XMLСхема = КомпонентыОбмена.XMLСхема;
	
	// Инициализация таблицы правил конвертации.
	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("ТипДанных");
	ПравилаКонвертации.Колонки.Добавить("ТипXDTO");
	ПравилаКонвертации.Колонки.Добавить("КонвертацииЗначенийПриПолучении");
	ПравилаКонвертации.Колонки.Добавить("КонвертацииЗначенийПриОтправке");
	
	ПравилаКонвертации.Колонки.Добавить("ИмяПКПД", Новый ОписаниеТипов("Строка"));
	
	КомпонентыОбмена.МенеджерОбмена.ЗаполнитьПравилаКонвертацииПредопределенныхДанных(
		КомпонентыОбмена.НаправлениеОбмена, ПравилаКонвертации);

	Для Каждого ПравилоКонвертации Из ПравилаКонвертации Цикл
		ПравилоКонвертации.ТипXDTO = ФабрикаXDTO.Тип(XMLСхема, ПравилоКонвертации.ТипXDTO);
		ПравилоКонвертации.ТипДанных = Тип(ИмяТипаДанныхПоОбъектуМетаданных(ПравилоКонвертации.ТипДанных));
	КонецЦикла;
	
	ПравилаКонвертации.Индексы.Добавить("ИмяПКПД");
	ПравилаКонвертации.Индексы.Добавить("ТипДанных");
	ПравилаКонвертации.Индексы.Добавить("ТипДанных,ТипXDTO");
	
	Возврат ПравилаКонвертации;
	
КонецФункции

Функция СтруктураПараметровКонвертации(МенеджерОбмена)
	
	// Инициализация структуры с параметрами конвертации.
	//	Возможно, в будущем понадобится не структура,
	//		а таблица (если потребуется передавать параметры из одной базы в другую).
	
	ПараметрыКонвертации = Новый Структура();
	МенеджерОбмена.ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации);
	
	Возврат ПараметрыКонвертации;
	
КонецФункции

Процедура ОтметитьКлючевыеСвойстваПравилаКонвертации(КомпонентыОбмена, ПравилоКонвертации)
	
	Если Не КомпонентыОбмена.ЭтоEnterpriseData Или ПустаяСтрока(ПравилоКонвертации.ОбъектФормата) Тогда
		Возврат;
	КонецЕсли;
	
	КлючевыеСвойства = ПравилоКонвертации.ТипXDTO.Свойства
		.Получить(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата());
	Если КлючевыеСвойства = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипКлючевыхСвойствОбъектаXDTO = КлючевыеСвойства.Тип;
	ПравилоКонвертации.ТипКлючевыхСвойствОбъектаXDTO = ТипКлючевыхСвойствОбъектаXDTO;
	
	МассивКлючевыхСвойств = Новый Массив;
	ЗаполнитьСписокСвойствОбъектаXDTO(ТипКлючевыхСвойствОбъектаXDTO, МассивКлючевыхСвойств);
	
	ПКСДляДобавления = Новый Массив;
	
	ТаблицаПКС = ПравилоКонвертации.Свойства;
	Для Каждого ПКС Из ТаблицаПКС Цикл
		
		Если МассивКлючевыхСвойств.Найти(ПКС.СвойствоФормата) <> Неопределено Тогда
			ПКС.ОбработкаКлючевогоСвойства = Истина;
			
			Если ПравилоКонвертации.ТипXDTO.Свойства.Получить(ПКС.СвойствоФормата) <> Неопределено Тогда
				ПКСДляДобавления.Добавить(ПКС);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ПКС Из ПКСДляДобавления Цикл
		НовоеПКС = ТаблицаПКС.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеПКС, ПКС, , "ОбработкаКлючевогоСвойства");
	КонецЦикла;
	
	КлассСсылкаФормата = КлассСсылкаФормата(КомпонентыОбмена, ПравилоКонвертации.Свойства);
	СвойствоСсылкаXDTO = ТипКлючевыхСвойствОбъектаXDTO.Свойства.Получить(КлассСсылкаФормата);
	Если СвойствоСсылкаXDTO <> Неопределено Тогда
		
		ПравилоКонвертации.ТипСсылкиXDTO = СвойствоСсылкаXDTO.Тип;
		
		Если ПравилоКонвертации.ЭтоСсылочныйТип
			И КомпонентыОбмена.НаправлениеОбмена = "Отправка" Тогда
			ПКСДляСсылки = ТаблицаПКС.Добавить();
			ПКСДляСсылки.СвойствоКонфигурации = КлассСсылка();
			ПКСДляСсылки.СвойствоФормата = КлассСсылкаФормата;
			ПКСДляСсылки.ОбработкаКлючевогоСвойства = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает строковое представление типа, свойственного для данных,
// соответствующих переданному объекту метаданных.
// Может быть использован как значение параметра встроенной функции Тип().
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - по которому необходимо определить имя типа;
//
// Возвращаемое значение:
//  Строка - например, "СправочникСсылка.Номенклатура".
//
Функция ИмяТипаДанныхПоОбъектуМетаданных(Знач ОбъектМетаданных)
	
	ЛитералыТипа = СтрРазделить(ОбъектМетаданных.ПолноеИмя(), ".");
	ТипТаблицы = ЛитералыТипа[0];
	
	Если ТипТаблицы = "Константа" Тогда
		
		ШаблонИмениТипа = "[ТипТаблицы]МенеджерЗначения.[ИмяТаблицы]";
		
	ИначеЕсли ЭтоТаблицаРегистра(ТипТаблицы) Тогда
		
		ШаблонИмениТипа = "[ТипТаблицы]НаборЗаписей.[ИмяТаблицы]";
		
	Иначе
		ШаблонИмениТипа = "[ТипТаблицы]Ссылка.[ИмяТаблицы]";
	КонецЕсли;
	
	ШаблонИмениТипа = СтрЗаменить(ШаблонИмениТипа, "[ТипТаблицы]", ЛитералыТипа[0]);
	Результат = СтрЗаменить(ШаблонИмениТипа, "[ИмяТаблицы]", ЛитералыТипа[1]);
	Возврат Результат;
	
КонецФункции

// Параметры:
//   ТипОбъектаXDTO - ТипОбъектаXDTO
//   Свойства - Массив из Строка
// 
Процедура ЗаполнитьСписокСвойствОбъектаXDTO(ТипОбъектаXDTO, Свойства)
	
	Для Каждого ДочернееСвойство Из ТипОбъектаXDTO.Свойства Цикл
		Если ТипЗнч(ДочернееСвойство.Тип) = Тип("ТипОбъектаXDTO")
			И СтрНачинаетсяС(ДочернееСвойство.Тип.Имя, КлассОбщиеСвойства()) Тогда
			ЗаполнитьСписокСвойствОбъектаXDTO(ДочернееСвойство.Тип, Свойства);
		Иначе
			Свойства.Добавить(ДочернееСвойство.Имя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВедениеПротокола

// Сохраняет в протокол выполнения.
//
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	ТекстСообщения - Строка - текст сообщения.
//	ВзвестиФлагОшибок - Булево - если истина, то - это сообщение об ошибке. Взводится ФлагОшибки.
//	ВзвестиФлагПропустить - Булево - если истина, то - это сообщение о пропуске данных. Взводится ФлагПропустить.
//
Процедура ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстСообщения = Неопределено, ВзвестиФлагОшибок = Ложь,
	ВзвестиФлагПропустить = Ложь)
	
	Если ВзвестиФлагОшибок Тогда
		КомпонентыОбмена.ФлагОшибки = Истина;
	КонецЕсли;

	Если Не ВзвестиФлагОшибок И ВзвестиФлагПропустить Тогда
		КомпонентыОбмена.ФлагПропустить = Истина;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		
		КомпонентыОбмена.ПротоколКонвертации.Добавить(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьИсключение(ИнформацияОбОшибке, Заголовок = Неопределено)
	
	Если ПустаяСтрока(Заголовок) Тогда
		Заголовок = НСтр("ru = 'Ошибка выполнения...'");
	КонецЕсли;
	
	ВызватьИсключение(Заголовок, , КодЗаголовокИсключения(), , ИнформацияОбОшибке);
	
КонецПроцедуры

Процедура ОбработатьИсключениеОбработчика(ИнформацияОбОшибке, ИмяОбработчика)
	
	ОбработатьИсключение(ИнформацияОбОшибке,
		СтрШаблон(НСтр("ru = 'Обработчик: ''%1''. Ошибка выполнения обработчика.'"), ИмяОбработчика));
	
КонецПроцедуры

Процедура ОбработатьИсключениеКонвертации(КомпонентыОбмена, ИнформацияОбОшибке)
	
	//@skip-check undefined-variable
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Категория = КатегорияОшибки.ПринудительноеЗавершениеРаботы;
	// принудительное завершение из обработчика события
	Если КомпонентыОбмена.ФлагПропустить И ИнформацияОбОшибке.ЯвляетсяОшибкойКатегории(Категория)
		Или КомпонентыОбмена.ФлагОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ПредставлениеОшибки(ИнформацияОбОшибке), Истина);
	
КонецПроцедуры

Функция ПредставлениеОшибки(ИнформацияОбОшибке)
	
	Если ИнформацияОбОшибке = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Заголовки = Новый Массив;
	Ошибка = ПервичнаяОшибка(ИнформацияОбОшибке, Заголовки);
	
	// Описание
	Результат = ?(ПустаяСтрока(Ошибка.Описание), НСтр("ru = 'Неизвестная ошибка'"), СокрЛП(Ошибка.Описание));
	
	// Код
	Если Не ПустаяСтрока(Ошибка.Код) Тогда
		Результат = Результат + Символы.ПС
			+ Символы.ПС
			+ СтрШаблон(НСтр("ru = 'Код: %1'"), СокрЛП(Ошибка.Код));
	КонецЕсли;
	
	// ИсходнаяСтрока
	Если Не ПустаяСтрока(Ошибка.ИмяМодуля) Тогда
		Результат = Результат + Символы.ПС
			+ Символы.ПС
			+ СтрШаблон("{%1(%2)}: %3",
				СокрЛП(Ошибка.ИмяМодуля), XMLСтрока(Ошибка.НомерСтроки), СокрЛП(Ошибка.ИсходнаяСтрока));
	КонецЕсли;
	
	// ДополнительнаяИнформация
	ШаблонДополнительнойИнформации = НСтр("ru = 'Дополнительная информация:
		|	%1'");
	Если Не ПустаяСтрока(Ошибка.ДополнительнаяИнформация) Тогда
		ДополнительнаяИнформация = СокрЛП(Ошибка.ДополнительнаяИнформация);
		Результат = Результат + Символы.ПС
			+ Символы.ПС
			+ СтрШаблон(ШаблонДополнительнойИнформации, ДополнительнаяИнформация);
			
	ИначеЕсли Заголовки.Количество() Тогда
		ДополнительнаяИнформация = СтрСоединить(Заголовки, Символы.ПС + Символы.Таб);
		Результат = Результат + Символы.ПС
			+ Символы.ПС
			+ СтрШаблон(ШаблонДополнительнойИнформации, ДополнительнаяИнформация);
	Иначе
		// Дополнительная информация отсутствует, представление ошибки не дополняется.
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПервичнаяОшибка(Ошибка, Заголовки)
	
	Если Ошибка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ошибка.Код = КодЗаголовокИсключения() И Не ПустаяСтрока(Ошибка.Описание) Тогда
		Заголовки.Добавить(СокрЛП(Ошибка.Описание));
	КонецЕсли;
	
	Возврат ?(Ошибка.Причина = Неопределено, Ошибка,
		ПервичнаяОшибка(Ошибка.Причина, Заголовки));
	
КонецФункции

Функция КодЗаголовокИсключения()
	Возврат "HEADER";
КонецФункции

#КонецОбласти

#Область ОтправкаДанных

// Выполняет выгрузку объекта информационной базы.
//
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	Источник - СправочникОбъект, ДокументОбъект, ЛюбаяСсылка, Структура - Выгружаемые данные
//	ИмяПОД - Строка - Имя правила обработки данных.
//
// Возвращаемое значение:
//	Неопределено, Структура - Описание сообщения, кфкИнтеграция.ПараметрыСообщения():
Функция ВыгрузкаОбъектаВыборки(КомпонентыОбмена, Источник, ИмяПОД)
	
	// Поиск правила обработки данных
	ПравилоОбработки = ПОДПоИмени(КомпонентыОбмена, ИмяПОД);
	
	// Отработка ПОД
	ИспользованиеПКО = Новый Структура;
	Для Каждого ТекущееПКО Из ПравилоОбработки.ИспользуемыеПКО Цикл
		ИспользованиеПКО.Вставить(ТекущееПКО, Истина);
	КонецЦикла;
	ПриОбработкеПОД(КомпонентыОбмена,
		ПравилоОбработки, ИспользованиеПКО,
		Источник);
		
	// Поиск правила конвертации.
	ПравилоКонвертации = Неопределено;
	Для Каждого ТекущееПКО Из ИспользованиеПКО Цикл
		Если ТекущееПКО.Значение Тогда // TODO: Допустимо указание ПКО, не предназначенного для текущей версии формата данных.
			ПравилоКонвертации = ПКОПоИмени(КомпонентыОбмена, ТекущееПКО.Ключ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ПравилоКонвертации = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не найдено правило конвертации данных.'");
	КонецЕсли;
	
	// Выполнение ПКО
	Попытка
		
		// 1. Конвертируем Данные в Структуру по правилам конвертации.
		ДанныеXDTO = ДанныеФорматаИзДанныхИБ(КомпонентыОбмена, ПравилоКонвертации, Источник);
		Если ДанныеXDTO = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось выполнить конвертацию данных.'");
		КонецЕсли;
		
		// 2. Конвертируем Структуру в ОбъектXDTO.
		ОбъектXDTO = ОбъектФорматаИзДанныхФормата(КомпонентыОбмена, ДанныеXDTO, ПравилоКонвертации.ТипXDTO);
		
	Исключение
		ШаблонЗаголовка = НСтр("ru = 'Ошибка при конвертации данных!
			|ПОД: %1
			|ПКО: %2
			|Тип XDTO: %3'");
		ИнформацияОбИсключении = ИнформацияОбОшибке();
		ТекстОшибки = СтрШаблон(ШаблонЗаголовка, ИмяПОД, ПравилоКонвертации.ИмяПКО,
			ПравилоКонвертации.ТипXDTO.Имя);
		ОбработатьИсключение(ИнформацияОбИсключении, ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
		
	Контекст = Новый Структура;
	Контекст.Вставить("ИмяПОД", ПравилоОбработки.Имя);
	Контекст.Вставить("ИмяПКО", ПравилоКонвертации.ИмяПКО);
	ПроверитьОбъектФорматаПоСхеме(КомпонентыОбмена, ОбъектXDTO, ПравилоКонвертации.ТипXDTO, Контекст);
	
	Возврат СообщениеИзОбъектаXDTO(КомпонентыОбмена, ОбъектXDTO);
	
КонецФункции

#Область ДанныхИБ_Структура

Функция ДанныеФорматаИзДанныхИБ(
		КомпонентыОбмена, Знач ПравилоКонвертации, Источник, СтекВыгрузки = Неопределено)
	
	Если СтекВыгрузки = Неопределено Тогда
		СтекВыгрузки = Новый Массив;
	КонецЕсли;
	
	Если Не ДобавитьИсточникВСтекВыгрузки(КомпонентыОбмена, ПравилоКонвертации, Источник, СтекВыгрузки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Приемник = Новый Структура;
	Если ПравилоКонвертации.ЭтоКонстанта Тогда
		ЗаполнитьДанныеКонстанты(ПравилоКонвертации, Источник, Приемник);
	Иначе
		Если Не ВыгрузитьДанныеОбъекта(
				КомпонентыОбмена,
				ПравилоКонвертации,
				Источник,
				Приемник,
				СтекВыгрузки) Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;

	Если КомпонентыОбмена.ЭтоEnterpriseData И СтекВыгрузки.Количество() > 1 Тогда
		Приемник.Вставить("ТипСоставногоСвойства", ПравилоКонвертации.ТипКлючевыхСвойствОбъектаXDTO);
	КонецЕсли;

	Возврат Приемник;

КонецФункции

Функция ДобавитьИсточникВСтекВыгрузки(КомпонентыОбмена, ПравилоКонвертации, Источник, СтекВыгрузки)

	Если Не ПравилоКонвертации.ЭтоСсылочныйТип Тогда
		СтекВыгрузки.Добавить(Источник);
		Возврат Истина;
	КонецЕсли;

	Если СсылкаПовторноВложена(Источник.Ссылка, СтекВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;

	СтекВыгрузки.Добавить(Источник.Ссылка);
	Если КомпонентыОбмена.ЭтоEnterpriseData
			И Не ОбщегоНазначения.СсылкаСуществует(Источник.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция СсылкаПовторноВложена(Ссылка, СтекВыгрузки)

	ПозицияВСтеке = СтекВыгрузки.Найти(Ссылка);
	Если ПозицияВСтеке = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ПозицияВСтеке > 0 Тогда
		Возврат Истина;
	КонецЕсли;

	Для Индекс = 1 По СтекВыгрузки.Количество() - 1 Цикл
		Если СтекВыгрузки[Индекс] = Ссылка Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Процедура ЗаполнитьДанныеКонстанты(ПравилоКонвертации, Источник, Приемник)

	ТипОбъекта = ПравилоКонвертации.ТипXDTO;
	Если ТипОбъекта.Свойства.Количество() = 1 Тогда
		Приемник.Вставить(ТипОбъекта.Свойства[0].Имя, Источник.Значение);
		Возврат;
	КонецЕсли;

	ШаблонОшибки = НСтр("ru = 'Ошибка XML-схемы. Для приемника должно быть задано одно свойство.
		|Тип источника: %1
		|Тип приемника: %2'");
	ВызватьИсключение СтрШаблон(
		ШаблонОшибки,
		Строка(ТипЗнч(Источник)),
		ПравилоКонвертации.ТипXDTO);

КонецПроцедуры

Функция ВыгрузитьДанныеОбъекта(
		КомпонентыОбмена, ПравилоКонвертации, Источник, Приемник, СтекВыгрузки)

	ВыгрузитьСвойстваПервогоЭтапа(
		КомпонентыОбмена,
		ПравилоКонвертации,
		Источник,
		Приемник,
		СтекВыгрузки);
	ВыгрузитьТабличныеЧастиПервогоЭтапа(
		КомпонентыОбмена,
		ПравилоКонвертации,
		Источник,
		Приемник,
		СтекВыгрузки);

	Если Не ПравилоКонвертации.ЕстьОбработчикПриОтправкеДанных Тогда
		Возврат Истина;
	КонецЕсли;

	Если КомпонентыОбмена.ЭтоEnterpriseData
			И Не Приемник.Свойство(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()) Тогда
		Приемник.Вставить(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства(), Новый Структура);
	КонецЕсли;

	ПриОтправкеДанных(
		Источник,
		Приемник,
		ПравилоКонвертации.ПриОтправкеДанных,
		КомпонентыОбмена,
		СтекВыгрузки);
	Если Приемник = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ПоднятьКлючевыеСвойстваВПриемник(КомпонентыОбмена, Приемник, СтекВыгрузки);

	НомерВторогоЭтапа = НомерВторогоЭтапаКонвертации();
	ВыгрузитьСвойстваВторогоЭтапа(
		КомпонентыОбмена,
		ПравилоКонвертации,
		Источник,
		Приемник,
		СтекВыгрузки,
		НомерВторогоЭтапа);
	ВыгрузитьТабличныеЧастиВторогоЭтапа(
		КомпонентыОбмена,
		ПравилоКонвертации,
		Источник,
		Приемник,
		СтекВыгрузки,
		НомерВторогоЭтапа);

	Возврат Истина;

КонецФункции

Процедура ПоднятьКлючевыеСвойстваВПриемник(КомпонентыОбмена, Приемник, СтекВыгрузки)

	Если Не КомпонентыОбмена.ЭтоEnterpriseData Или СтекВыгрузки.Количество() <= 1 Тогда
		Возврат;
	КонецЕсли;

	ИмяКлючевыхСвойств = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства();
	Для Каждого КлючевоеСвойство Из Приемник[ИмяКлючевыхСвойств] Цикл
		Приемник.Вставить(КлючевоеСвойство.Ключ, КлючевоеСвойство.Значение);
	КонецЦикла;
	Приемник.Удалить(ИмяКлючевыхСвойств);

КонецПроцедуры

Процедура ВыгрузитьСвойстваПервогоЭтапа(
		КомпонентыОбмена, ПравилоКонвертации, Источник, Приемник, СтекВыгрузки)

	// Выполнение ПКС, 1-й этап
	Для Каждого ПКС Из ПравилоКонвертации.Свойства Цикл

		Если ПравилоКонвертации.ОбъектДанных <> Неопределено
			И ПКС.СвойствоКонфигурации = ""
			И ПКС.ИспользуетсяАлгоритмКонвертации Тогда
			Продолжить;
		КонецЕсли;

		Если СтекВыгрузки.Количество() > 1 И Не ПКС.ОбработкаКлючевогоСвойства Тогда
			Продолжить;
		КонецЕсли;

		ВыгрузитьСвойство(
			КомпонентыОбмена,
			Источник,
			Приемник,
			ПКС,
			СтекВыгрузки,
			1);
	КонецЦикла;

КонецПроцедуры

Процедура ВыгрузитьТабличныеЧастиПервогоЭтапа(
		КомпонентыОбмена, ПравилоКонвертации, Источник, Приемник, СтекВыгрузки)

	Если СтекВыгрузки.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;

	// Выполнение ПКС для ТЧ (прямая конвертация).
	Для Каждого ТЧИСвойства Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл

		Если Не ЗначениеЗаполнено(ТЧИСвойства.ТЧКонфигурации)
				Или Не ЗначениеЗаполнено(ТЧИСвойства.ТЧФормата) Тогда
			Продолжить;
		КонецЕсли;

		Если Источник[ТЧИСвойства.ТЧКонфигурации].Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		ВыгрузитьТабличнуюЧастьПервогоЭтапа(
			КомпонентыОбмена,
			ТЧИСвойства,
			Источник,
			Приемник,
			СтекВыгрузки);

	КонецЦикла;

КонецПроцедуры

Процедура ВыгрузитьТабличнуюЧастьПервогоЭтапа(
		КомпонентыОбмена, ТЧИСвойства, Источник, Приемник, СтекВыгрузки)

	НоваяТЧПриемника = СоздатьТЧПриемникаПоПКС(ТЧИСвойства.Свойства);
	Для Каждого СтрокаТЧКонфигурации Из Источник[ТЧИСвойства.ТЧКонфигурации] Цикл

		СтрокаТЧПриемник = НоваяТЧПриемника.Добавить();
		Для Каждого ПКС Из ТЧИСвойства.Свойства Цикл
			Если ПКС.ИспользуетсяАлгоритмКонвертации Тогда
				Продолжить;
			КонецЕсли;

			ВыгрузитьСвойство(
				КомпонентыОбмена,
				СтрокаТЧКонфигурации,
				СтрокаТЧПриемник,
				ПКС,
				СтекВыгрузки,
				1);
		КонецЦикла;

	КонецЦикла;

	Приемник.Вставить(ТЧИСвойства.ТЧФормата, НоваяТЧПриемника);

КонецПроцедуры

Процедура ВыгрузитьСвойстваВторогоЭтапа(
		КомпонентыОбмена, ПравилоКонвертации, Источник, Приемник, СтекВыгрузки, НомерВторогоЭтапа)

	// Выполнение ПКС, 2-й этап.
	Для Каждого ПКС Из ПравилоКонвертации.Свойства Цикл

		ПропуститьСвойство = ПКС.СвойствоФормата = ""
			Или (СтекВыгрузки.Количество() > 1 И Не ПКС.ОбработкаКлючевогоСвойства)
			Или Не ПКС.ИспользуетсяАлгоритмКонвертации;
		Если ПропуститьСвойство Тогда
			Продолжить;
		КонецЕсли;

		ЗначениеСвойства = ЗначениеСвойстваВторогоЭтапа(ПКС, Приемник, СтекВыгрузки);
		Если ЗначениеСвойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если НужноВыгружатьСвойствоВторогоЭтапа(ПКС, ЗначениеСвойства) Тогда
			ВыгрузитьСвойство(
				КомпонентыОбмена,
				Источник,
				Приемник,
				ПКС,
				СтекВыгрузки,
				НомерВторогоЭтапа);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ЗначениеСвойстваВторогоЭтапа(ПКС, Приемник, СтекВыгрузки)

	ЗначениеСвойства = Неопределено;
	Если ПКС.ОбработкаКлючевогоСвойства И СтекВыгрузки.Количество() = 1 Тогда
		Приемник[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()]
			.Свойство(ПКС.СвойствоФормата, ЗначениеСвойства);
		Возврат ЗначениеСвойства;
	КонецЕсли;

	ИмяСвойства = СокрЛП(ПКС.СвойствоФормата);
	ВложенныеСвойства = СтрРазделить(ИмяСвойства, ".", Ложь);
	Если ВложенныеСвойства.Количество() > 1 Тогда
		ПолучитьЗначениеВложенныхСвойств(Приемник, ВложенныеСвойства, ЗначениеСвойства);
	Иначе
		Приемник.Свойство(ИмяСвойства, ЗначениеСвойства);
	КонецЕсли;

	Возврат ЗначениеСвойства;

КонецФункции

Функция НужноВыгружатьСвойствоВторогоЭтапа(ПКС, ЗначениеСвойства)

	ЗначениеЯвляетсяИнструкцией = ТипЗнч(ЗначениеСвойства) = ТипСтруктура()
		И ЗначениеСвойства.Свойство("Значение")
		И ЗначениеСвойства.Свойство("ИмяПКО");
	ЕстьПравилоДляОбычногоЗначения = ПКС.ПравилоКонвертацииСвойства <> ""
		И ТипЗнч(ЗначениеСвойства) <> ТипСтруктура();

	Возврат ЗначениеЯвляетсяИнструкцией Или ЕстьПравилоДляОбычногоЗначения;

КонецФункции

Процедура ВыгрузитьТабличныеЧастиВторогоЭтапа(
		КомпонентыОбмена, ПравилоКонвертации, Источник, Приемник, СтекВыгрузки, НомерВторогоЭтапа)

	Если СтекВыгрузки.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;

	СвойстваТЧПриемника = СвойстваТабличныхЧастейПриемника(ПравилоКонвертации);
	Для Каждого ТЧИСвойства Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл

		Если Не ТЧИСвойства.ИспользуетсяАлгоритмКонвертации Тогда
			Продолжить;
		КонецЕсли;

		ВыгрузитьТабличнуюЧастьВторогоЭтапа(
			КомпонентыОбмена,
			ТЧИСвойства,
			Источник,
			Приемник,
			СтекВыгрузки,
			НомерВторогоЭтапа,
			СвойстваТЧПриемника);

	КонецЦикла;

КонецПроцедуры

Функция СвойстваТабличныхЧастейПриемника(ПравилоКонвертации)

	Результат = Новый Структура;
	Для Каждого ТЧИСвойства Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл

		ИмяТЧПриемника = ТЧИСвойства.ТЧФормата;
		Если ПустаяСтрока(ИмяТЧПриемника) Тогда
			Продолжить;
		КонецЕсли;

		Если Не Результат.Свойство(ИмяТЧПриемника) Тогда
			ТаблицаПКС = Новый ТаблицаЗначений;
			ТаблицаПКС.Колонки.Добавить("СвойствоФормата", Новый ОписаниеТипов("Строка"));
			Результат.Вставить(ИмяТЧПриемника, ТаблицаПКС);
		КонецЕсли;

		ТаблицаПКС = Результат[ИмяТЧПриемника];
		Для Каждого ПКС Из ТЧИСвойства.Свойства Цикл
			СтрокаСвойство = ТаблицаПКС.Добавить();
			СтрокаСвойство.СвойствоФормата = ПКС.СвойствоФормата;
		КонецЦикла;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ВыгрузитьТабличнуюЧастьВторогоЭтапа(
		КомпонентыОбмена, ТЧИСвойства, Источник, Приемник, СтекВыгрузки, НомерВторогоЭтапа,
		СвойстваТЧПриемника)

	ИмяТЧПриемника = ТЧИСвойства.ТЧФормата;
	ТЧПриемника = Неопределено;
	Если Не ЗначениеЗаполнено(ИмяТЧПриемника)
			Или Не Приемник.Свойство(ИмяТЧПриемника, ТЧПриемника) Тогда
		Возврат;
	КонецЕсли;

	НоваяТЧПриемника = СоздатьТЧПриемникаПоПКС(СвойстваТЧПриемника[ИмяТЧПриемника]);
	Для Каждого СтрокаТЧПриемника Из ТЧПриемника Цикл
		СтрокаНовойТЧПриемника = НоваяТЧПриемника.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНовойТЧПриемника, СтрокаТЧПриемника);
	КонецЦикла;
	Приемник[ИмяТЧПриемника] = НоваяТЧПриемника;

	Для Каждого Строка Из НоваяТЧПриемника Цикл
		Для Каждого ПКС Из ТЧИСвойства.Свойства Цикл
			Если Не ПКС.ИспользуетсяАлгоритмКонвертации Тогда
				Продолжить;
			КонецЕсли;
			
			ВыгрузитьСвойство(
				КомпонентыОбмена,
				Источник,
				Строка,
				ПКС,
				СтекВыгрузки,
				НомерВторогоЭтапа);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Выгружает свойство объекта информационной базы в соответствии с правилами.
//
// Параметры:
//  КомпонентыОбмена   - Структура - содержит все правила и параметры обмена.
//  ДанныеИБ           - ЛюбаяСсылка - ссылка на выгружаемый объект информационной базы.
//  ПолучательСвойства - Структура - получатель данных типа Структура, в которой должно храниться значение выгруженного свойства.
//                     - СтрокаТаблицыЗначений.
//  ПКС                - СтрокаТаблицыЗначений - строка таблицы правил конвертации свойств, в соответствии с которой
//                                               выполняется преобразование.
//  СтекВыгрузки       - Массив из ЛюбаяСсылка - ссылки на выгружаемые объекты с учетом вложенности.
//  ЭтапВыгрузки       - Число - содержит информацию об этапе выгрузки:
//     1 - выгрузка до выполнения алгоритма ПриОтправкеДанных, 
//     2 - выгрузка после выполнения алгоритма ПриОтправкеДанных.
//
Процедура ВыгрузитьСвойство(
		КомпонентыОбмена, ДанныеИБ, ПолучательСвойства, ПКС, СтекВыгрузки, ЭтапВыгрузки = 1)
	
	ИмяСвойства = СокрЛП(ПКС.СвойствоФормата);
	Если ИмяСвойства = "" Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеСвойства = Новый Структура;
	ОписаниеСвойства.Вставить("ВложенныеСвойства", СтрРазделить(ИмяСвойства, ".", Ложь));
	ОписаниеСвойства.Вставить("ПолноеИмя", ОписаниеСвойства.ВложенныеСвойства.Количество() > 1);
	Если ОписаниеСвойства.ПолноеИмя Тогда
		ИмяСвойства = ОписаниеСвойства.ВложенныеСвойства[
			ОписаниеСвойства.ВложенныеСвойства.Количество() - 1];
	КонецЕсли;
	ОписаниеСвойства.Вставить("Имя", ИмяСвойства);
	
	ЗначениеСвойства = Неопределено;
	Если ЭтапВыгрузки = 1 Тогда
		ЗначениеПолучено = ПолучитьЗначениеСвойстваПервогоЭтапа(
			ДанныеИБ,
			ПКС,
			ОписаниеСвойства,
			ЗначениеСвойства);
	Иначе
		Если ТипЗнч(ПолучательСвойства) = Тип("СтрокаТаблицыЗначений") Тогда
			ЗначениеПолучено = ПолучитьЗначениеСвойстваСтрокиТаблицы(
				ПолучательСвойства,
				ОписаниеСвойства,
				ЗначениеСвойства);
		Иначе
			ЗначениеПолучено = ПолучитьЗначениеСвойстваВторогоЭтапаВыгрузки(
				КомпонентыОбмена,
				ДанныеИБ,
				ПолучательСвойства,
				СтекВыгрузки,
				ОписаниеСвойства,
				ЗначениеСвойства);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеПолучено Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоКонвертацииСвойства = ПКС.ПравилоКонвертацииСвойства;
	РазобратьИнструкциюВыгрузки(ЗначениеСвойства, ПравилоКонвертацииСвойства);
	Если Не ПреобразоватьЗначениеСвойства(
			КомпонентыОбмена,
			СтекВыгрузки,
			ЗначениеСвойства,
			ПравилоКонвертацииСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	ПоместитьВыгруженноеСвойство(
		ПолучательСвойства,
		ПКС,
		СтекВыгрузки,
		ОписаниеСвойства,
		ЗначениеСвойства);

КонецПроцедуры

Функция ПолучитьЗначениеСвойстваПервогоЭтапа(
		ДанныеИБ, ПКС, ОписаниеСвойства, ЗначениеСвойства)

	Если ЗначениеЗаполнено(ПКС.СвойствоКонфигурации) Тогда
		ЗначениеСвойства = ДанныеИБ[ПКС.СвойствоКонфигурации];
		Возврат Истина;
	КонецЕсли;

	Если ТипЗнч(ДанныеИБ) <> ТипСтруктура() Тогда
		Возврат Истина;
	КонецЕсли;

	Если ОписаниеСвойства.ПолноеИмя Тогда
		ПолучитьЗначениеВложенныхСвойств(
			ДанныеИБ,
			ОписаниеСвойства.ВложенныеСвойства,
			ЗначениеСвойства);
	Иначе
		ДанныеИБ.Свойство(ОписаниеСвойства.Имя, ЗначениеСвойства);
	КонецЕсли;

	Возврат ЗначениеСвойства <> Неопределено;

КонецФункции

Функция ПолучитьЗначениеСвойстваВторогоЭтапаВыгрузки(
		КомпонентыОбмена, ДанныеИБ, ПолучательСвойства, СтекВыгрузки, ОписаниеСвойства, ЗначениеСвойства)

	Если ОписаниеСвойства.ПолноеИмя Тогда
		ПолучитьЗначениеВложенныхСвойств(
			ДанныеИБ,
			ОписаниеСвойства.ВложенныеСвойства,
			ЗначениеСвойства);
	Иначе
		ПолучательСвойства.Свойство(ОписаниеСвойства.Имя, ЗначениеСвойства);
	КонецЕсли;

	Если Не КомпонентыОбмена.ЭтоEnterpriseData Или ЗначениеСвойства <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат СтекВыгрузки.Количество() = 1
		И ПолучательСвойства[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()]
			.Свойство(ОписаниеСвойства.Имя, ЗначениеСвойства);

КонецФункции

Функция ПолучитьЗначениеСвойстваСтрокиТаблицы(
		ПолучательСвойства, ОписаниеСвойства, ЗначениеСвойства)

	Колонки = ПолучательСвойства.Владелец().Колонки;
	Если Не ОписаниеСвойства.ПолноеИмя Тогда
		Если Колонки.Найти(ОписаниеСвойства.Имя) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		ЗначениеСвойства = ПолучательСвойства[ОписаниеСвойства.Имя];
		Возврат Истина;
	КонецЕсли;

	МаксимальныйУровень = ОписаниеСвойства.ВложенныеСвойства.Количество() - 1;
	Для Уровень = 0 По МаксимальныйУровень Цикл

		ИмяКолонки = ОписаниеСвойства.ВложенныеСвойства[Уровень];
		Если Колонки.Найти(ИмяКолонки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ПолучитьВложенноеЗначениеСвойстваСтрокиТаблицы(
			ПолучательСвойства[ИмяКолонки],
			ОписаниеСвойства,
			Уровень,
			ЗначениеСвойства);

	КонецЦикла;

	Возврат Истина;

КонецФункции

Процедура ПолучитьВложенноеЗначениеСвойстваСтрокиТаблицы(
		ЗначениеВКолонке, ОписаниеСвойства, Уровень, ЗначениеСвойства)

	МаксимальныйУровень = ОписаниеСвойства.ВложенныеСвойства.Количество() - 1;
	Если Уровень = МаксимальныйУровень Тогда
		ЗначениеСвойства = ЗначениеВКолонке;
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ЗначениеВКолонке) <> ТипСтруктура() Тогда
		Возврат;
	КонецЕсли;

	ИсточникВложенногоСвойства = ЗначениеВКолонке;
	ЗначениеВложенногоСвойства = Неопределено;
	Для ПодчиненныйУровень = Уровень + 1 По МаксимальныйУровень Цикл

		ИмяВложенногоСвойства = ОписаниеСвойства.ВложенныеСвойства[ПодчиненныйУровень];
		Если Не ИсточникВложенногоСвойства.Свойство(
				ИмяВложенногоСвойства,
				ЗначениеВложенногоСвойства) Тогда
			Продолжить;
		КонецЕсли;

		Если ПодчиненныйУровень = МаксимальныйУровень Тогда
			ЗначениеСвойства = ЗначениеВложенногоСвойства;
		ИначеЕсли ТипЗнч(ЗначениеВложенногоСвойства) = ТипСтруктура() Тогда
			ИсточникВложенногоСвойства = ЗначениеВложенногоСвойства;
			ЗначениеВложенногоСвойства = Неопределено;
		Иначе
			Прервать;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура РазобратьИнструкциюВыгрузки(ЗначениеСвойства, ПравилоКонвертацииСвойства)

	Если ТипЗнч(ЗначениеСвойства) <> ТипСтруктура() Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеСвойства.Свойство("ИмяПКО") Тогда
		ПравилоКонвертацииСвойства = ЗначениеСвойства.ИмяПКО;
	КонецЕсли;
	Если ЗначениеСвойства.Свойство("Значение") Тогда
		ЗначениеСвойства = ЗначениеСвойства.Значение;
	КонецЕсли;

КонецПроцедуры

Функция ПреобразоватьЗначениеСвойства(
		КомпонентыОбмена, СтекВыгрузки, ЗначениеСвойства, ПравилоКонвертацииСвойства)

	Если Не ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		Если Не КомпонентыОбмена.ЭтоМенеджерОбменКФК
				Или Не КомпонентыОбмена.ОтключитьПреобразованиеВNull
				Или ЗначениеСвойства = Null Тогда
			ЗначениеСвойства = Неопределено;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;

	Если ПустаяСтрока(ПравилоКонвертацииСвойства) Тогда
		Возврат Истина;
	КонецЕсли;

	ПКПД = КомпонентыОбмена.ПравилаКонвертацииПредопределенныхДанных
		.Найти(ПравилоКонвертацииСвойства, "ИмяПКПД");
	Если ПКПД <> Неопределено Тогда
		Если ТипЗнч(ЗначениеСвойства) = Тип("Строка") Тогда
			Возврат Ложь;
		КонецЕсли;
		ЗначениеСвойства = ПКПД.КонвертацииЗначенийПриОтправке.Получить(ЗначениеСвойства);
		Возврат Истина;
	КонецЕсли;

	ПравилоКонвертации = ПКОПоИмени(КомпонентыОбмена, ПравилоКонвертацииСвойства);
	ОтветвлениеСтекаВыгрузки = Новый Массив;
	Для Каждого Элемент Из СтекВыгрузки Цикл
		ОтветвлениеСтекаВыгрузки.Добавить(Элемент);
	КонецЦикла;

	ЗначениеСвойства = ДанныеФорматаИзДанныхИБ(
		КомпонентыОбмена,
		ПравилоКонвертации,
		ЗначениеСвойства,
		ОтветвлениеСтекаВыгрузки);

	Возврат Истина;

КонецФункции

Процедура ПоместитьВыгруженноеСвойство(
		ПолучательСвойства, ПКС, СтекВыгрузки, ОписаниеСвойства, ЗначениеСвойства)

	Если СтекВыгрузки.Количество() = 1 И ПКС.ОбработкаКлючевогоСвойства Тогда
		ИмяКлючевыхСвойств = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства();
		Если Не ПолучательСвойства.Свойство(ИмяКлючевыхСвойств) Тогда
			ПолучательСвойства.Вставить(ИмяКлючевыхСвойств, Новый Структура);
		КонецЕсли;
		ПолучательСвойства[ИмяКлючевыхСвойств].Вставить(
			ОписаниеСвойства.Имя,
			ЗначениеСвойства);
		Возврат;
	КонецЕсли;

	ЭтоСтрокаТаблицы = ТипЗнч(ПолучательСвойства) = Тип("СтрокаТаблицыЗначений");
	Если ОписаниеСвойства.ПолноеИмя Тогда
		ПоместитьЗначениеВложенныхСвойств(
			ПолучательСвойства,
			ОписаниеСвойства.ВложенныеСвойства,
			ЗначениеСвойства,
			ЭтоСтрокаТаблицы);
	ИначеЕсли ЭтоСтрокаТаблицы Тогда
		ПолучательСвойства[ОписаниеСвойства.Имя] = ЗначениеСвойства;
	Иначе
		ПолучательСвойства.Вставить(ОписаниеСвойства.Имя, ЗначениеСвойства);
	КонецЕсли;

КонецПроцедуры

Функция СоздатьТЧПриемникаПоПКС(ПКСДляТЧ)

	НоваяТЧПриемника = Новый ТаблицаЗначений;
	Для Каждого ПКС Из ПКСДляТЧ Цикл
		ИмяКолонки = СокрЛП(ПКС.СвойствоФормата);
		// Возможно, это ПКС для вложенных свойств.
		Если СтрНайти(ИмяКолонки, ".") > 0 Тогда
			ВложенныеСвойства = СтрРазделить(ИмяКолонки, ".", Ложь);
			МаксимальныйИндекс = ВложенныеСвойства.Количество() - 1;
			Для Индекс = 0 По МаксимальныйИндекс Цикл
				ИмяВложенногоСвойства = ВложенныеСвойства[Индекс];
				Если НоваяТЧПриемника.Колонки.Найти(ИмяВложенногоСвойства) = Неопределено Тогда
					НоваяТЧПриемника.Колонки.Добавить(ИмяВложенногоСвойства);
				КонецЕсли;
			КонецЦикла;
		Иначе
			НоваяТЧПриемника.Колонки.Добавить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НоваяТЧПриемника;
	
КонецФункции

#КонецОбласти

#Область Структура_ОбъектXDTO

// Выполняет преобразование структуры с данными в объект XDTO указанного типа в соответствии с правилами.
//
// Параметры:
//   КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//   Источник         - Структура - источник данных, которые необходимо преобразовать в объект XDTO.
//   ТипXDTO          - ТипЗначенияXDTO, ТипОбъектаXDTO - тип объекта или тип значения XDTO, к которому надо преобразовать данные.
//   ПроведеноЗаполнениеСвойств - Булево - параметр для определения заполненности общих составных свойств.
//
// Возвращаемое значение:
//   ОбъектXDTO - результат преобразования. 
// 
Функция ОбъектФорматаИзДанныхФормата(
		КомпонентыОбмена, Знач Источник, Знач ТипXDTO, ПроведеноЗаполнениеСвойств = Ложь)
	
	Приемник = ФабрикаXDTO.Создать(ТипXDTO);
	Для Каждого Свойство Из СвойстваТипаФорматаМассивом(ТипXDTO) Цикл
		
		Если Свойство.ВозможноПустое И Свойство.ВерхняяГраница = 1 Тогда
			Приемник[Свойство.Имя] = Неопределено;
		КонецЕсли;
		
		ДанныеСвойства = Новый Структура("Найдено, Значение", Ложь, Неопределено);
		ДанныеСвойства.Найдено = ПолучитьЗначениеСвойстваИсточникаФормата(
			Источник,
			Свойство.Имя,
			ДанныеСвойства.Значение);
		
		ТипСвойства = Неопределено;
		ТипСвойстваПоИмениИЗначениюСвойства(
			ТипXDTO,
			ДанныеСвойства.Найдено,
			Свойство,
			ДанныеСвойства.Значение,
			ТипСвойства);
		
		Попытка
			ЗначениеXDTO = Неопределено;
			Если Не СформироватьЗначениеСвойстваXDTO(
					КомпонентыОбмена,
					Источник,
					Приемник,
					Свойство,
					ДанныеСвойства,
					ТипСвойства,
					ЗначениеXDTO) Тогда
				Продолжить;
			КонецЕсли;
			
			УстановитьСвойствоОбъектаXDTO(КомпонентыОбмена, Приемник, Свойство, ЗначениеXDTO);
		Исключение
			ШаблонОшибки = НСтр("ru = 'Ошибка формирования объекта XDTO: Тип свойства <%1>. Имя свойства: <%2>.'");
			ОбработатьИсключение(
				ИнформацияОбОшибке(),
				СтрШаблон(ШаблонОшибки, ТипСвойства, Свойство.Имя));
		КонецПопытки;
		
		ПроведеноЗаполнениеСвойств = Истина;
		
	КонецЦикла;
	
	Возврат Приемник;
	
КонецФункции

Функция СформироватьЗначениеСвойстваXDTO(
		КомпонентыОбмена, Источник, Приемник, Свойство, ДанныеСвойства, ТипСвойства, ЗначениеXDTO)

	Если ТипСвойства = ТипОбщегоСоставногоСвойства() Тогда
		Возврат СформироватьОбщееСоставноеСвойствоXDTO(
			КомпонентыОбмена,
			Источник,
			Свойство,
			ДанныеСвойства.Найдено,
			ДанныеСвойства.Значение,
			ЗначениеXDTO);
	КонецЕсли;

	Если Не ДанныеСвойства.Найдено
			Или ЗначениеНеЗаполнено(КомпонентыОбмена, ДанныеСвойства.Значение) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ТипСвойства = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства() Тогда
		ЗначениеXDTO = ОбъектФорматаИзДанныхФормата(
			КомпонентыОбмена,
			ДанныеСвойства.Значение,
			Свойство.Тип);
	ИначеЕсли ТипСвойства = "ОбычноеСвойство" Тогда
		ЗначениеXDTO = СформироватьОбычноеЗначениеXDTO(
			КомпонентыОбмена,
			ДанныеСвойства.Значение,
			Свойство.Тип);
	ИначеЕсли ТипСвойства = "AdditionalInfo" Тогда
		ЗначениеXDTO = СериализаторXDTO.ЗаписатьXDTO(ДанныеСвойства.Значение);
	ИначеЕсли ТипСвойства = "Таблица" Тогда
		ЗначениеXDTO = СформироватьТаблицуXDTO(
			КомпонентыОбмена,
			ДанныеСвойства.Значение,
			Свойство.Тип);
	ИначеЕсли ТипСвойства = "МассивИзОбычноеСвойство" Тогда
		ЗаполнитьМассивXDTO(
			КомпонентыОбмена,
			Приемник[Свойство.Имя],
			ДанныеСвойства.Значение,
			Свойство.Тип);
		Возврат Ложь;
	ИначеЕсли ТипСвойства = "СвойствоСоставногоТипа" Тогда
		Возврат СформироватьСоставноеЗначениеXDTO(
			КомпонентыОбмена,
			ДанныеСвойства.Значение,
			Свойство.Тип,
			ЗначениеXDTO);
	Иначе
		ЗначениеXDTO = Неопределено;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция СформироватьОбщееСоставноеСвойствоXDTO(
		КомпонентыОбмена, Источник, Свойство, СвойствоНайдено, ЗначениеСвойства, ЗначениеXDTO)

	ПроведеноЗаполнениеВложенныхСвойств = Ложь;
	Если ТипЗнч(Источник) = ТипСтруктура() И СвойствоНайдено Тогда
		ИсточникВложенныхСвойств = ЗначениеСвойства;
	Иначе
		ИсточникВложенныхСвойств = Источник;
	КонецЕсли;

	ЗначениеXDTO = ОбъектФорматаИзДанныхФормата(
		КомпонентыОбмена,
		ИсточникВложенныхСвойств,
		Свойство.Тип,
		ПроведеноЗаполнениеВложенныхСвойств);

	Возврат ПроведеноЗаполнениеВложенныхСвойств Или Не Свойство.ВозможноПустое;

КонецФункции

Функция СформироватьОбычноеЗначениеXDTO(КомпонентыОбмена, Значение, ТипЗначенияXDTO)

	Если ЭтоСсылкаXDTO(ТипЗначенияXDTO) Тогда
		Возврат ЗначениеВСтроку(Значение);
	КонецЕсли;

	ЭтоПеречисление = ТипЗначенияXDTO.Фасеты <> Неопределено
		И ТипЗначенияXDTO.Фасеты.Перечисления <> Неопределено
		И ТипЗначенияXDTO.Фасеты.Перечисления.Количество() > 0;
	Если ЭтоПеречисление Тогда
		Возврат КонвертироватьПеречислениеВXDTO(КомпонентыОбмена, Значение, ТипЗначенияXDTO);
	КонецЕсли;

	Если кфкОбщегоНазначенияСлужебный.ЭтоСсылка(Значение) Тогда
		Возврат ФабрикаXDTO.Создать(ТипЗначенияXDTO, XMLСтрока(Значение));
	КонецЕсли;

	Возврат ФабрикаXDTO.Создать(ТипЗначенияXDTO, Значение);

КонецФункции

Функция СформироватьТаблицуXDTO(КомпонентыОбмена, Таблица, ТипТаблицыXDTO)

	Результат = ФабрикаXDTO.Создать(ТипТаблицыXDTO);
	СвойствоСтроки = ТипТаблицыXDTO.Свойства[0];
	СписокСтрок = Результат[СвойствоСтроки.Имя];

	Для Каждого Строка Из Таблица Цикл
		СтрокаXDTO = ОбъектФорматаИзДанныхФормата(
			КомпонентыОбмена,
			Строка,
			СвойствоСтроки.Тип,
			Ложь);
		СписокСтрок.Добавить(СтрокаXDTO);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ЗаполнитьМассивXDTO(КомпонентыОбмена, Приемник, Значения, ТипЗначенияXDTO)

	Для Каждого Значение Из Значения Цикл
		Если ЗначениеНеЗаполнено(КомпонентыОбмена, Значение) Тогда
			ЗначениеXDTO = Неопределено;
		Иначе
			ЗначениеXDTO = СформироватьОбычноеЗначениеXDTO(
				КомпонентыОбмена,
				Значение,
				ТипЗначенияXDTO);
		КонецЕсли;

		Приемник.Добавить(ЗначениеXDTO);
	КонецЦикла;

КонецПроцедуры

Функция СформироватьСоставноеЗначениеXDTO(
		КомпонентыОбмена, ЗначениеСвойства, ТипСоставногоСвойства, ЗначениеXDTO)

	Для Каждого СвойствоСоставногоТипа Из ТипСоставногоСвойства.Свойства Цикл

		СоставноеЗначениеXDTO = ЗначениеВариантаСоставногоТипаXDTO(
			КомпонентыОбмена,
			ЗначениеСвойства,
			СвойствоСоставногоТипа.Тип);
		Если СоставноеЗначениеXDTO = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ЗначениеXDTO = ФабрикаXDTO.Создать(ТипСоставногоСвойства);
		ЗначениеXDTO.Установить(СвойствоСоставногоТипа, СоставноеЗначениеXDTO);
		Возврат Истина;

	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция ЗначениеВариантаСоставногоТипаXDTO(КомпонентыОбмена, Значение, ТипВарианта)

	Если ТипЗнч(Значение) = ТипСтруктура()
			И Значение.ТипСоставногоСвойства = ТипВарианта Тогда
		Возврат ОбъектФорматаИзДанныхФормата(КомпонентыОбмена, Значение, ТипВарианта);
	КонецЕсли;

	Если ЗначениеСоответствуетПростомуТипуФормата(Значение, ТипВарианта) Тогда
		Возврат Значение;
	КонецЕсли;

	Если ТипЗнч(Значение) <> Тип("Строка")
			Или ТипЗнч(ТипВарианта) <> Тип("ТипЗначенияXDTO")
			Или ТипВарианта.Фасеты = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ТипВарианта.Фасеты.Количество() = 0 Тогда
		Возврат Значение;
	КонецЕсли;

	Для Каждого Фасет Из ТипВарианта.Фасеты Цикл
		Если Фасет.Значение = Значение Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Процедура УстановитьСвойствоОбъектаXDTO(КомпонентыОбмена, Приемник, Свойство, ЗначениеXDTO)

	Если ЭтоБазоваяСхема(КомпонентыОбмена, Свойство.URIПространстваИмен)
			Или Свойство.URIПространстваИмен = Приемник.Тип().URIПространстваИмен Тогда
		Приемник[Свойство.Имя] = ЗначениеXDTO;
	Иначе
		ДополнитьОбъектXDTO(Приемник, Свойство, ЗначениеXDTO);
	КонецЕсли;

КонецПроцедуры

Функция СвойстваТипаФорматаМассивом(ТипXDTO)

	Свойства = Новый Массив;
	Для Каждого Свойство Из ТипXDTO.Свойства Цикл
		Свойства.Добавить(Свойство);
	КонецЦикла;

	Возврат Свойства;

КонецФункции

Функция ПолучитьЗначениеСвойстваИсточникаФормата(Источник, ИмяСвойства, ЗначениеСвойства)

	Если ТипЗнч(Источник) = ТипСтруктура() Тогда
		Возврат Источник.Свойство(ИмяСвойства, ЗначениеСвойства);
	ИначеЕсли ТипЗнч(Источник) = Тип("СтрокаТаблицыЗначений")
		И Источник.Владелец().Колонки.Найти(ИмяСвойства) <> Неопределено Тогда
		ЗначениеСвойства = Источник[ИмяСвойства];
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Определяет способ конвертации свойства объекта XDTO.
//
// Параметры:
//   ТипXDTO          - ТипОбъектаXDTO - тип содержащего объект XDTO.
//   СвойствоНайдено  - Булево - признак наличия свойства в источнике.
//   Свойство         - СвойствоXDTO - описание конвертируемого свойства.
//   ЗначениеСвойства - Произвольный - значение свойства в источнике.
//   ТипСвойства      - Строка - определенный способ конвертации свойства; выходной параметр.
//
Процедура ТипСвойстваПоИмениИЗначениюСвойства(ТипXDTO, СвойствоНайдено, Свойство, ЗначениеСвойства, ТипСвойства)
	
	Если ТипЗнч(Свойство.Тип) = Тип("ТипЗначенияXDTO") Тогда
		ТипСвойства = ?(ЭтоМассивОбъекта(Свойство), "МассивИзОбычноеСвойство", "ОбычноеСвойство");
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Свойство.Тип) <> Тип("ТипОбъектаXDTO") Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный тип свойства <%1>. Тип объекта: %2'"),
			Свойство.Имя,
			Строка(ТипXDTO));
	КонецЕсли;
	
	Если Свойство.Имя = "AdditionalInfo" Тогда
		ТипСвойства = "AdditionalInfo";
		Возврат;
	КонецЕсли;

	Если ЭтоТаблицаОбъекта(Свойство) Тогда
		ТипСвойства = "Таблица";
		Возврат;
	КонецЕсли;

	Если СтрНайти(Свойство.Тип.Имя, ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата()) > 0 Тогда
		ТипСвойства = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства();
		Возврат;
	КонецЕсли;

	Если СтрНайти(Свойство.Тип.Имя, КлассОбщиеСвойства()) > 0 Тогда
		ТипСвойства = ТипОбщегоСоставногоСвойства();
		Возврат;
	КонецЕсли;

	ЭтоСоставноеСвойство = СвойствоНайдено
		И ТипЗнч(ЗначениеСвойства) = ТипСтруктура()
		И ЗначениеСвойства.Свойство("ТипСоставногоСвойства");
	ТипСвойства = ?(ЭтоСоставноеСвойство, "СвойствоСоставногоТипа", ТипОбщегоСоставногоСвойства());

КонецПроцедуры

Процедура ДополнитьОбъектXDTO(ОбъектXDTO, Знач Свойство, Знач Значение)
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектXDTO, Свойство.Имя) Тогда
		ОбъектXDTO.Добавить(Свойство.Форма, Свойство.URIПространстваИмен, Свойство.Имя, Значение);
		Возврат;
	КонецЕсли;
	
	Если ЭтоТаблицаОбъекта(Свойство) Тогда
		ДополнитьТаблицуОбъектаXDTO(ОбъектXDTO, Свойство, Значение);
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Свойство.Тип) = Тип("ТипОбъектаXDTO") Тогда
		ДополнитьСвойстваОбъектаXDTO(ОбъектXDTO[Свойство.Имя], Значение);
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьТаблицуОбъектаXDTO(ОбъектXDTO, Свойство, Значение)

	ИмяСвойстваСтроки = Свойство.Тип.Свойства[0].Имя;
	Для ИндексСтроки = 0 По Значение[ИмяСвойстваСтроки].Количество() - 1 Цикл

		СтрокаXDTO = ОбъектXDTO[Свойство.Имя][ИмяСвойстваСтроки].Получить(ИндексСтроки);
		РасширениеСтрокиXDTO = Значение[ИмяСвойстваСтроки].Получить(ИндексСтроки);
		ДополнитьСвойстваОбъектаXDTO(СтрокаXDTO, РасширениеСтрокиXDTO);

	КонецЦикла;

КонецПроцедуры

Процедура ДополнитьСвойстваОбъектаXDTO(ОбъектXDTO, Значение)

	Для Каждого Свойство Из Значение.Свойства() Цикл

		//@skip-check bsl-legacy-check-expression-type
		ЭлементЗначения = Значение.Получить(Свойство.Имя);
		Если ЭлементЗначения = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(Свойство.Тип) = Тип("ТипЗначенияXDTO") Тогда
			ЭлементЗначения = ФабрикаXDTO.Создать(Свойство.Тип, ЭлементЗначения);
		КонецЕсли;

		ДополнитьОбъектXDTO(ОбъектXDTO, Свойство, ЭлементЗначения);

	КонецЦикла;

КонецПроцедуры

Функция КонвертироватьПеречислениеВXDTO(КомпонентыОбмена, ЗначениеПеречисления, ТипПеречисленияXDTO)
	
	Если ТипЗнч(ЗначениеПеречисления) = Тип("Строка") Тогда
		ЗначениеXDTO = ФабрикаXDTO.Создать(ТипПеречисленияXDTO, ЗначениеПеречисления);
		
	Иначе
		ПравилаКонвертацииПредопределенныхДанных = КомпонентыОбмена.ПравилаКонвертацииПредопределенныхДанных;
		ПравилоКонвертации = НайтиПравилоКонвертацииДляЗначения(
			ПравилаКонвертацииПредопределенныхДанных, ТипЗнч(ЗначениеПеречисления), ТипПеречисленияXDTO);
		ЗначениеXDTO = ФабрикаXDTO.Создать(ТипПеречисленияXDTO,
			ЗначениеПеречисленияXDTO(ПравилоКонвертации.КонвертацииЗначенийПриОтправке, ЗначениеПеречисления));
		
	КонецЕсли;
	
	Возврат ЗначениеXDTO;
	
КонецФункции

Функция НайтиПравилоКонвертацииДляЗначения(ПравилаКонвертацииПредопределенныхДанных, Знач Тип,
																					Знач ТипXDTO = Неопределено)
	
	ТипИсточникаСтрокой = Строка(Тип);
	Если ТипXDTO = Неопределено Тогда
		
		НайденныеПравила = ПравилаКонвертацииПредопределенныхДанных.НайтиСтроки(Новый Структура("ТипДанных", Тип));
		
		Если НайденныеПравила.Количество() = 1 Тогда
			
			ПравилоКонвертации = НайденныеПравила[0];
			
			Возврат ПравилоКонвертации;
			
		ИначеЕсли НайденныеПравила.Количество() > 1 Тогда
			
			ШаблонОшибки = НСтр("ru = 'Ошибка правил конвертации предопределенных данных.
				|Задано более одного правила конвертации для типа источника <%1>.'");
			ВызватьИсключение СтрШаблон(ШаблонОшибки, ТипИсточникаСтрокой);
			
		Иначе
			ШаблонОшибки = НСтр("ru = 'Ошибка правил конвертации предопределенных данных.
				|Правило конвертации не определено для типа источника <%1>.'");
			ВызватьИсключение СтрШаблон(ШаблонОшибки, ТипИсточникаСтрокой);
		КонецЕсли;
			
	Иначе
		
		НайденныеПравила = ПравилаКонвертацииПредопределенныхДанных.НайтиСтроки(
			Новый Структура("ТипДанных, ТипXDTO", Тип, ТипXDTO, Ложь));
		
		Если НайденныеПравила.Количество() = 1 Тогда
			
			ПравилоКонвертации = НайденныеПравила[0];
			
			Возврат ПравилоКонвертации;
			
		ИначеЕсли НайденныеПравила.Количество() > 1 Тогда
			
			ШаблонОшибки = НСтр("ru = 'Ошибка правил конвертации предопределенных данных.
				|Задано более одного правила конвертации для типа источника <%1> и типа приемника <%2>.'");
			ТипПриемникаСтрокой = Строка(ТипXDTO);
			ВызватьИсключение СтрШаблон(ШаблонОшибки, ТипИсточникаСтрокой, ТипПриемникаСтрокой);
			
		Иначе
			ШаблонОшибки = НСтр("ru = 'Ошибка правил конвертации предопределенных данных.
				|Правило конвертации не определено для типа источника <%1> и типа приемника <%2>.'");
			ТипПриемникаСтрокой = Строка(ТипXDTO);
			ВызватьИсключение СтрШаблон(ШаблонОшибки, ТипИсточникаСтрокой, ТипПриемникаСтрокой);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ЗначениеПеречисленияXDTO(Знач КонвертацииЗначений, Знач Значение)
	
	ЗначениеXDTO = КонвертацииЗначений.Получить(Значение);
	Если ЗначениеXDTO = Неопределено Тогда
		ШаблонОшибки = НСтр("ru = 'Не найдено правило конвертации для значения предопределенных данных.
			|Тип значения источника: <%1>
			|Значение источника: <%2>'");
		ТипЗначения = ТипЗнч(Значение);
		ЗначениеСтрокой = Строка(Значение);
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТипЗначения, ЗначениеСтрокой);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат ЗначениеXDTO;
	
КонецФункции

Функция ЗначениеВСтроку(Значение)
	
	Возврат ?(Значение = Неопределено Или Значение = Null, Значение, XMLСтрока(Значение));
	
КонецФункции

Функция ЭтоТаблицаОбъекта(Знач СвойствоXDTO)
	
	Если ТипЗнч(СвойствоXDTO.Тип) = Тип("ТипОбъектаXDTO")
		И СвойствоXDTO.Тип.Свойства.Количество() = 1 Тогда
		
		Возврат СвойствоXDTO.Тип.Свойства[0].ВерхняяГраница <> 1;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоМассивОбъекта(Знач СвойствоXDTO)
	
	Если ТипЗнч(СвойствоXDTO.Тип) = Тип("ТипЗначенияXDTO") Тогда
		
		Возврат СвойствоXDTO.ВерхняяГраница <> 1;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ВалидацияОбъектаXDTO

Процедура ПроверитьОбъектФорматаПоСхеме(КомпонентыОбмена, ОбъектXDTO, ТипXDTO, Контекст)
	
	Если КомпонентыОбмена.ФлагОшибки Или КомпонентыОбмена.ФлагПропустить Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбъектXDTO.Проверить();
		Возврат;
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	СтекОшибок = Новый Массив;
	ЗаполнитьОшибкиПроверкиОбъектаXDTO(ОбъектXDTO, ТипXDTO, СтекОшибок);
	
	Если СтекОшибок.Количество() > 0 Тогда
		ШаблонОшибки = НСтр("ru = 'Стек ошибок:
			|%1'");
		ОшибкиСтрокой = СтрСоединить(СтекОшибок, Символы.ПС);
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ОшибкиСтрокой);
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru = 'Ошибка при проверке объекта XDTO по схеме!
		|ПОД: %1
		|ПКО: %2
		|Тип XDTO: %3
		|%4'");
	ТекстСообщения = СтрШаблон(ШаблонСообщения,
		Контекст.ИмяПОД,
		Контекст.ИмяПКО,
		ТипXDTO.Имя,
		ТекстОшибки);
	ВызватьИсключение ТекстСообщения;
	
КонецПроцедуры

Процедура ЗаполнитьОшибкиПроверкиОбъектаXDTO(
		ОбъектXDTO, ТипОбъектаXDTO, СтекОшибок, Знач Уровень = 1)
	
	Для Каждого Свойство Из ТипОбъектаXDTO.Свойства Цикл
		
		Если Не ОбъектXDTO.Установлено(Свойство) Тогда
			ДобавитьОшибкуНезаполненногоСвойстваXDTO(Свойство, СтекОшибок, Уровень);
			Продолжить;
		КонецЕсли;

		ЭтоСписокXDTO = Свойство.ВерхняяГраница <> 1;
		Если ЭтоСписокXDTO Тогда
			ЗначениеСвойстваXDTO = ОбъектXDTO.ПолучитьСписок(Свойство);
		Иначе
			ЗначениеСвойстваXDTO = ОбъектXDTO.ПолучитьXDTO(Свойство);
		КонецЕсли;

		Если ЗначениеСвойстваXDTO = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ПроверитьЗначениеСвойстваXDTO(
			ЗначениеСвойстваXDTO,
			Свойство,
			ЭтоСписокXDTO,
			СтекОшибок,
			Уровень);

	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьОшибкуНезаполненногоСвойстваXDTO(Свойство, СтекОшибок, Уровень)

	Если Свойство.НижняяГраница <> 1 Или Свойство.ВозможноПустое Тогда
		Возврат;
	КонецЕсли;

	ДобавитьОшибкуПроверки(
		СтекОшибок,
		Уровень,
		Свойство,
		НСтр("ru = '%1: не заполнено обязательное поле.'"));

КонецПроцедуры

Процедура ПроверитьЗначениеСвойстваXDTO(
		ЗначениеСвойстваXDTO, Свойство, ЭтоСписокXDTO, СтекОшибок, Уровень)

	Если ТипЗнч(ЗначениеСвойстваXDTO) = Тип("ЗначениеXDTO") Тогда
		ПроверитьПростоеЗначениеXDTO(ЗначениеСвойстваXDTO, Свойство, СтекОшибок, Уровень);
	ИначеЕсли ЭтоСписокXDTO Тогда
		ЗаполнитьОшибкиПроверкиСпискаXDTO(
			ЗначениеСвойстваXDTO,
			Свойство,
			СтекОшибок,
			Уровень);
	Иначе
		ЗаполнитьОшибкиПроверкиВложенногоОбъектаXDTO(
			ЗначениеСвойстваXDTO,
			Свойство,
			СтекОшибок,
			Уровень);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьПростоеЗначениеXDTO(ЗначениеXDTO, Свойство, СтекОшибок, Уровень)

	Попытка
		Свойство.Тип.Проверить(ЗначениеXDTO.ЛексическоеЗначение);
	Исключение
		ДобавитьОшибкуПроверки(
			СтекОшибок,
			Уровень,
			Свойство,
			НСтр("ru = '%1: значение поля не соответствует заданным ограничениям.'"));
	КонецПопытки;

КонецПроцедуры

Процедура ЗаполнитьОшибкиПроверкиСпискаXDTO(СписокXDTO, Свойство, СтекОшибок, Уровень)

	НомерЭлемента = 0;
	Для Каждого ЭлементСпискаXDTO Из СписокXDTO Цикл

		НомерЭлемента = НомерЭлемента + 1;
		ОшибкиЭлемента = Новый Массив;
		Если ТипЗнч(Свойство.Тип) = Тип("ТипОбъектаXDTO") Тогда
			ЗаполнитьОшибкиПроверкиОбъектаXDTO(
				ЭлементСпискаXDTO,
				Свойство.Тип,
				ОшибкиЭлемента,
				Уровень + 1);
		Иначе
			ПроверитьЭлементСпискаXDTO(ЭлементСпискаXDTO, Свойство, ОшибкиЭлемента, Уровень);
		КонецЕсли;

		Если ОшибкиЭлемента.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьОшибкуПроверки(
			СтекОшибок,
			Уровень,
			Свойство,
			"%1[" + XMLСтрока(НомерЭлемента) + "]:");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтекОшибок, ОшибкиЭлемента);

	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЭлементСпискаXDTO(ЭлементСпискаXDTO, Свойство, СтекОшибок, Уровень)

	Попытка
		Свойство.Тип.Проверить(ЭлементСпискаXDTO);
	Исключение
		ДобавитьОшибкуПроверки(
			СтекОшибок,
			Уровень,
			Свойство,
			НСтр("ru = '%1: значение поля не соответствует заданным ограничениям.'"));
	КонецПопытки;

КонецПроцедуры

Процедура ЗаполнитьОшибкиПроверкиВложенногоОбъектаXDTO(
		ЗначениеСвойстваXDTO, Свойство, СтекОшибок, Уровень)

	ВложенныеОшибки = Новый Массив;
	ЗаполнитьОшибкиПроверкиОбъектаXDTO(
		ЗначениеСвойстваXDTO,
		Свойство.Тип,
		ВложенныеОшибки,
		Уровень + 1);

	Если ВложенныеОшибки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДобавитьОшибкуПроверки(СтекОшибок, Уровень, Свойство, "%1:");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтекОшибок, ВложенныеОшибки);

КонецПроцедуры

Процедура ДобавитьОшибкуПроверки(СтекОшибок, Уровень, Свойство, ШаблонОшибки)
	
	ТекстОшибки = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(Символы.Таб, Уровень)
		+ СтрШаблон(ШаблонОшибки, Свойство.Имя);
	СтекОшибок.Добавить(ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбъектXDTO_JSON

Функция СообщениеИзОбъектаXDTO(КомпонентыОбмена, ОбъектXDTO)
	
	Если КомпонентыОбмена.ФлагОшибки Или КомпонентыОбмена.ФлагПропустить Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		
		// 1. Объект XDTO -> JSON
		// 1.1 Объект XDTO -> Строка JSON (XDTO)
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
		ФабрикаXDTO.ЗаписатьJSON(ЗаписьJSON, ОбъектXDTO);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		// 1.2 Строка JSON (XDTO) -> Строка JSON (Структура)
		НачальнаяПозиция = 4;
		СтрокаJSON = "{""" + Сред(СтрокаJSON, НачальнаяПозиция); // Удаление символа # в '#value'
		
		// 2. JSON -> Структура
		Возврат ОбщегоНазначения.JSONВЗначение(СтрокаJSON, , Ложь)["value"];
		
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Ошибка сериализации JSON объекта XDTO'"));
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПолучениеДанных

Функция ПрочитатьСообщениеОбмена(КомпонентыОбмена, ТелоСообщения, ИмяПОД)
	
	// Поиск правила обработки данных
	ПравилоОбработки = ПОДПоИмени(КомпонентыОбмена, ИмяПОД);
	// Проверка на наличие объекта выборки формата
	Если ПустаяСтрока(ПравилоОбработки.ОбъектВыборкиФормат) Тогда
		ВызватьИсключение НСтр("ru = 'Не задано имя объекта выборки формата'");
	КонецЕсли;
	
	// 0. Удаление и экранирование недопустимых символов JSON
	УдалитьНедопустимыеСимволыJSON(КомпонентыОбмена, ТелоСообщения);
	
	// 1. JSON -> Объекта XDTO
	ОбъектXDTO = ОбъектФорматаИзJSON(КомпонентыОбмена, ТелоСообщения, ПравилоОбработки.ОбъектВыборкиФормат);
	
	// 2. Объекта XDTO -> Структура
	ДанныеXDTO = ОбъектФорматаВСтруктуру(КомпонентыОбмена, ОбъектXDTO);
	Если ДанныеXDTO = Неопределено Тогда
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Не удалось преобразовать объект XDTO в структуру.'"));
	КонецЕсли;
	
	// Отработка ПОД
	ИспользованиеПКО = Новый Структура;
	Для Каждого ТекущееПКО Из ПравилоОбработки.ИспользуемыеПКО Цикл
		ИспользованиеПКО.Вставить(ТекущееПКО, Истина);
	КонецЦикла;
	ПриОбработкеПОД(КомпонентыОбмена,
		ПравилоОбработки, ИспользованиеПКО,
		ДанныеXDTO);
	
	// Поиск правила конвертации.
	ПравилоКонвертации = Неопределено;
	Для Каждого ТекущееПКО Из ИспользованиеПКО Цикл
		Если ТекущееПКО.Значение Тогда // TODO: Допустимо указание ПКО, не предназначенного для текущей версии формата данных.
			ПравилоКонвертации = ПКОПоИмени(КомпонентыОбмена, ТекущееПКО.Ключ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ПравилоКонвертации = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не найдено правило конвертации данных.'");
	КонецЕсли;
	
	// Выполнение ПКО
	Попытка
		// 3. Структура -> ИБ
		Возврат СтруктураОбъектаФорматаВДанныеИБ(
			КомпонентыОбмена, ПравилоКонвертации,
			ДанныеXDTO);
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

#Область СтроковоеПредставление_ОбъектФормата

Процедура УдалитьНедопустимыеСимволыJSON(КомпонентыОбмена, ТелоСообщения)
	
	Попытка
		
//		УдалитьНедопустимыеСимволы: Начало текста | Конец текста
		//@skip-check undefined-function
		ТелоСообщения = СтрЗаменитьПоРегулярномуВыражению(ТелоСообщения, "(?<!\\)(\x02|\x03|\\u0002|\\u0003)", "\n");
		
//		Экранирование: \b,\t,\n,\f,\r
		//@skip-check undefined-function
		ТелоСообщения = СтрЗаменитьПоРегулярномуВыражению(ТелоСообщения, "(?<!\\)\\(?=[btnfr])", "\\\\");
		
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке(),
			НСтр("ru = 'Не удалось экранировать или удалить недопустимые символы.'"));
	КонецПопытки;
	
КонецПроцедуры

Функция ОбъектФорматаИзJSON(КомпонентыОбмена, ТелоСообщения, ТипXDTO)
	
	Попытка
		
		СтрокаJSON = СтрЗаменить("{""#value"":null}", "null", ТелоСообщения);
		
		ТипОбъектаXDTO = ФабрикаXDTO.Тип(КомпонентыОбмена.XMLСхема, ТипXDTO);
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Возврат ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON, ТипОбъектаXDTO);
		
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Не удалось прочитать объект XDTO из JSON.'"));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ОбъектФормата_Структура

// Выполняет преобразование объекта XDTO в структуру с данными.
//
// Параметры:
//  КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//  ОбъектXDTO - ОбъектXDTO - значение, которое необходимо преобразовать.
//
// Возвращаемое значение:
//  Структура - структура, имитирующая объект XDTO.
//    Ключи структуры соответствуют свойствам объекта XDTO.
//    Значения соответствуют значениям свойств объекта XDTO.
//
Функция ОбъектФорматаВСтруктуру(КомпонентыОбмена, ОбъектXDTO)
	
	Приемник = Новый Структура;
	
	Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл
		
		КонвертацияСвойстваФорматаВЭлементСтруктуры(ОбъектXDTO, Свойство, Приемник, КомпонентыОбмена);
		
	КонецЦикла;
	
	КлючевыеСвойстваКопия = Неопределено;
	СсылкаКопия = Неопределено;
	ИмяКлючевыхСвойств = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата();
	СодержитКлючевыеСвойства = КомпонентыОбмена.ЭтоEnterpriseData
		И Приемник.Свойство(ИмяКлючевыхСвойств, КлючевыеСвойстваКопия)
		И ТипЗнч(КлючевыеСвойстваКопия) = ТипСтруктура();
	Если СодержитКлючевыеСвойства Тогда
		ИмяСсылки = КлассСсылкаФормата(КомпонентыОбмена, Неопределено);
		Если КлючевыеСвойстваКопия.Свойство(ИмяСсылки, СсылкаКопия) Тогда
			Приемник.Вставить(ИмяСсылки, СсылкаКопия);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

Процедура КонвертацияСвойстваФорматаВЭлементСтруктуры(Источник, Свойство, Приемник,
		КомпонентыОбмена, ИмяДляСвойстваСоставногоТипа = "", ТипСвойства = Неопределено)
	
	Если Не Источник.Установлено(Свойство)
			Или Не ЭтоБазоваяСхема(КомпонентыОбмена, Свойство.URIПространстваИмен) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСвойства = ?(ИмяДляСвойстваСоставногоТипа = "", Свойство.Имя, ИмяДляСвойстваСоставногоТипа);
	ЗначениеXDTO = Источник.ПолучитьXDTO(Свойство);

	Если ТипСвойства <> Неопределено Тогда
		ТипЗначенияXDTO = ТипСвойства;
	ИначеЕсли ЗначениеXDTO <> Неопределено Тогда
		ТипЗначенияXDTO = ТипЗначенияСвойстваФормата(КомпонентыОбмена, Свойство, ЗначениеXDTO);
	Иначе
		Возврат;
	КонецЕсли;
	
	Попытка
		Если ТипЗнч(ЗначениеXDTO) = Тип("ЗначениеXDTO") Тогда
			КонвертироватьПростоеСвойства(Приемник, ИмяСвойства, ЗначениеXDTO, ТипЗначенияXDTO);
		Иначе
			Если ТипЗнч(ЗначениеXDTO) = Тип("ОбъектXDTO") Тогда
				КонвертироватьОбъектноеСвойствоФормата(
					Приемник,
					КомпонентыОбмена,
					ИмяСвойства,
					Свойство,
					ТипЗначенияXDTO,
					ЗначениеXDTO);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ОбработатьИсключение(
			ИнформацияОбОшибке(),
			СтрШаблон(НСтр("ru = 'Ошибка чтения объекта XDTO, имя свойства: <%1>.'"), ИмяСвойства));
	КонецПопытки;
	
КонецПроцедуры

Процедура КонвертироватьОбъектноеСвойствоФормата(
		Приемник, КомпонентыОбмена, ИмяСвойства, Свойство, ТипЗначенияXDTO, ЗначениеXDTO)

	КлассЗначенияXDTO = ИмяКлассаЗначенияXDTO(Свойство, ТипЗначенияXDTO);
	Если КлассЗначенияXDTO = КлассПроизвольныеДанные() Тогда
		Приемник.Вставить(ИмяСвойства, СериализаторXDTO.ПрочитатьXDTO(ЗначениеXDTO));
	ИначеЕсли КлассЗначенияXDTO = КлассТаблицаОбъекта() Тогда
		КонвертироватьТаблицуОбъекта(
			Приемник,
			КомпонентыОбмена,
			ИмяСвойства,
			Свойство,
			ТипЗначенияXDTO,
			ЗначениеXDTO);
	ИначеЕсли КлассЗначенияXDTO = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата() Тогда
		КонвертироватьКлючевоеСвойство(
			Приемник,
			КомпонентыОбмена,
			ИмяСвойства,
			ТипЗначенияXDTO,
			ЗначениеXDTO);
	ИначеЕсли КлассЗначенияXDTO = КлассОбщиеСвойства() Тогда
		КонвертироватьОбщееСвойство(
			Приемник,
			КомпонентыОбмена,
			ИмяСвойства,
			ТипЗначенияXDTO,
			ЗначениеXDTO);
	Иначе
		КонвертироватьСоставноеСвойство(
			Приемник,
			КомпонентыОбмена,
			ИмяСвойства,
			ТипЗначенияXDTO,
			ЗначениеXDTO);
	КонецЕсли;

КонецПроцедуры

// Преобразует простое значение XDTO и записывает его в приемник.
//
// Параметры:
//   Приемник     - Структура, СтрокаТаблицыЗначений - приемник преобразованного значения.
//   ИмяСвойства  - Строка - имя свойства приемника.
//   ЗначениеXDTO - Произвольный - значение свойства XDTO.
//   ТипСвойства  - ТипЗначенияXDTO - тип свойства XDTO.
//
Процедура КонвертироватьПростоеСвойства(Приемник, Знач ИмяСвойства, Знач ЗначениеXDTO, Знач ТипСвойства)
	
	Значение = ПрочитатьЗначениеXDTO(ЗначениеXDTO, ТипСвойства);
	
	Если ТипЗнч(Приемник) = ТипСтруктура() Тогда
		Приемник.Вставить(ИмяСвойства, Значение);
	Иначе
		
		Если ТипЗнч(Приемник) = Тип("СтрокаТаблицыЗначений")
			И Приемник.Владелец().Колонки.Найти(ИмяСвойства) = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Приемник[ИмяСвойства] = Значение;
	КонецЕсли;
	
КонецПроцедуры

Процедура КонвертироватьТаблицуОбъекта(Приемник, Знач КомпонентыОбмена, Знач ИмяСвойства,
													Знач СвойствоXDTO, Знач ТипЗначенияXDTO, Знач ЗначениеXDTO)
	
	// Инициализируем таблицу значений, которая отображает табличную часть объекта.
	Значение = Новый ТаблицаЗначений;
	ИнициализироватьКолонкиТаблицыОбъектаПоТипу(Значение, ТипЗначенияXDTO.Свойства[0].Тип);
	
	ТабличнаяЧастьXDTO = ЗначениеXDTO[ТипЗначенияXDTO.Свойства[0].Имя];
	Если ТипЗнч(ТабличнаяЧастьXDTO) <> Тип("СписокXDTO") Тогда
		
		МассивОбъектовXDTO = Новый Массив(1);
		МассивОбъектовXDTO[0] = ТабличнаяЧастьXDTO;
		
		ТабличнаяЧастьXDTO = МассивОбъектовXDTO;
		
	КонецЕсли;
	
	Для Каждого СтрокаXDTO Из ТабличнаяЧастьXDTO Цикл
		
		СтрокаТЧ = Значение.Добавить();
		Для Каждого СвойствоСтрокиТЧ Из СтрокаXDTO.Свойства() Цикл
			КонвертацияСвойстваФорматаВЭлементСтруктуры(СтрокаXDTO, СвойствоСтрокиТЧ, СтрокаТЧ, КомпонентыОбмена, ,
				СвойствоСтрокиТЧ.Тип);
		КонецЦикла;
		
	КонецЦикла;
	
	Приемник.Вставить(ИмяСвойства, Значение);
	
КонецПроцедуры

Процедура КонвертироватьОбщееСвойство(
		Приемник, Знач КомпонентыОбмена, Знач ИмяСвойства, Знач ТипЗначенияXDTO, Знач ЗначениеXDTO)

	Если ТипЗнч(Приемник) = ТипСтруктура() Тогда
		ПриемникГруппыСвойств = Новый Структура;
	Иначе
		ПриемникГруппыСвойств = Приемник;
	КонецЕсли;

	КонвертироватьВложенныеСвойства(
		ЗначениеXDTO,
		ТипЗначенияXDTO,
		ПриемникГруппыСвойств,
		КомпонентыОбмена);

	Если ТипЗнч(Приемник) <> ТипСтруктура() Тогда
		Возврат;
	КонецЕсли;

	Приемник.Вставить(ИмяСвойства, ПриемникГруппыСвойств);
	ПродублироватьВложенныеСвойстваВПриемнике(Приемник, ПриемникГруппыСвойств);

КонецПроцедуры

Процедура КонвертироватьВложенныеСвойства(ЗначениеXDTO, ТипЗначенияXDTO, Приемник, КомпонентыОбмена)

	Для Каждого ПодСвойство Из ЗначениеXDTO.Свойства() Цикл
		
		ОписаниеСвойства = ТипЗначенияXDTO.Свойства.Получить(ПодСвойство.Имя);
		Если ОписаниеСвойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КонвертацияСвойстваФорматаВЭлементСтруктуры(
			ЗначениеXDTO,
			ПодСвойство,
			Приемник,
			КомпонентыОбмена,
			,
			ОписаниеСвойства.Тип);
		
	КонецЦикла;

КонецПроцедуры

Процедура ПродублироватьВложенныеСвойстваВПриемнике(Приемник, ПриемникГруппыСвойств)

	ИмяКлючевыхСвойств = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства();
	ЕстьКлючевыеСвойства = Приемник.Свойство(ИмяКлючевыхСвойств);
	Для Каждого СвойствоГруппы Из ПриемникГруппыСвойств Цикл
		
		ИмяПодСвойства = СвойствоГруппы.Ключ;
		Если Приемник.Свойство(ИмяПодСвойства) Тогда
			Продолжить;
		КонецЕсли;

		Если ЕстьКлючевыеСвойства
				И Приемник[ИмяКлючевыхСвойств].Свойство(ИмяПодСвойства) Тогда
			Продолжить;
		КонецЕсли;

		Приемник.Вставить(ИмяПодСвойства, СвойствоГруппы.Значение);

	КонецЦикла;
	
КонецПроцедуры

Процедура КонвертироватьКлючевоеСвойство(Приемник, Знач КомпонентыОбмена, Знач ИмяСвойства,
																	Знач ТипЗначенияXDTO, Знач ЗначениеXDTO)
	
	Значение = Новый Структура("ЭтоНаборКлючевыхСвойств");
	Значение.Вставить("ТипЗначения",
		СтрЗаменить(ТипЗначенияXDTO.Имя, ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата(), ""));

	Для Каждого КлючевоеСвойство Из ЗначениеXDTO.Свойства() Цикл
		ОписаниеСвойства = ТипЗначенияXDTO.Свойства.Получить(КлючевоеСвойство.Имя);
		Если ОписаниеСвойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КонвертацияСвойстваФорматаВЭлементСтруктуры(ЗначениеXDTO, КлючевоеСвойство, Значение, КомпонентыОбмена, ,
			ОписаниеСвойства.Тип);
	КонецЦикла;
	
	Если ТипЗнч(Приемник) = ТипСтруктура() Тогда
		Приемник.Вставить(ИмяСвойства, Значение);
	Иначе
		Приемник[ИмяСвойства] = Значение;
	КонецЕсли;

КонецПроцедуры

Процедура КонвертироватьСоставноеСвойство(Приемник, Знач КомпонентыОбмена, Знач ИмяСвойства,
																			Знач ТипЗначенияXDTO, Знач ЗначениеXDTO)

	Для Каждого ПодСвойство Из ЗначениеXDTO.Свойства() Цикл
		
		ОписаниеСвойства = ТипЗначенияXDTO.Свойства.Получить(ПодСвойство.Имя);
		Если ОписаниеСвойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеXDTO.Установлено(ПодСвойство) Тогда
			Продолжить;
		КонецЕсли;
		
		КонвертацияСвойстваФорматаВЭлементСтруктуры(ЗначениеXDTO, ПодСвойство, Приемник, КомпонентыОбмена, ИмяСвойства,
			ОписаниеСвойства.Тип);
		Прервать;
		
	КонецЦикла;

КонецПроцедуры

Функция ПрочитатьЗначениеXDTO(ЗначениеXDTO, ТипСвойства = Неопределено)
	
	ТипСвойства = ?(ТипСвойства = Неопределено, ЗначениеXDTO.Тип(), ТипСвойства);
	
	Если ЗначениеXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтоСсылкаXDTO(ТипСвойства) Тогда // Конвертация ссылки
		
		Значение = ПрочитатьЗначениеФорматаСложногоТипа(ЗначениеXDTO, "Ссылка", ТипСвойства);
		
	ИначеЕсли ЗначениеXDTO.Тип().Фасеты <> Неопределено
		И ЗначениеXDTO.Тип().Фасеты.Перечисления <> Неопределено
		И ЗначениеXDTO.Тип().Фасеты.Перечисления.Количество() > 0 Тогда // Конвертация перечисления
		
		Значение = ПрочитатьЗначениеФорматаСложногоТипа(ЗначениеXDTO, "Перечисление", ТипСвойства);
		
	Иначе // Конвертация обычного значения.
		
		Значение = ЗначениеXDTO.Значение;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ПрочитатьЗначениеФорматаСложногоТипа(ЗначениеXDTO, СложныйТип, ТипСвойства = Неопределено)

	ТипСвойства = ?(ТипСвойства = Неопределено, ЗначениеXDTO.Тип(), ТипСвойства);
		
	СтруктураXDTO = Новый Структура;
	СтруктураXDTO.Вставить("ЭтоСсылка", СложныйТип = "Ссылка");
	СтруктураXDTO.Вставить("ЭтоПеречисление", СложныйТип = "Перечисление");
	СтруктураXDTO.Вставить("ТипЗначенияXDTO", ТипСвойства);
	СтруктураXDTO.Вставить("Значение", ЗначениеXDTO.Значение);
	
	Возврат СтруктураXDTO;
	
КонецФункции

// Определяет тип значения свойства XDTO с учетом расширения схемы.
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//   СвойствоXDTO     - СвойствоXDTO - описание свойства.
//   ЗначениеXDTO     - Произвольный - значение свойства.
//
// Возвращаемое значение:
//  ТипЗначенияXDTO - тип свойства объекта XDTO.
//
Функция ТипЗначенияСвойстваФормата(Знач КомпонентыОбмена, Знач СвойствоXDTO, ЗначениеXDTO)
	
	Результат = ЗначениеXDTO.Тип();
	Если СвойствоXDTO.ОбъектВладелец = Неопределено Тогда
		
		// Владельца может не быть у полностью нового объекта, который добавляется расширением
		// Например, работаем со справочником, который отсутствует в типовой конфигурации.
		Возврат Результат;
		
	КонецЕсли;
	
	ПространствоИменСвойства = СвойствоXDTO.URIПространстваИмен;
	Если ЭтоБазоваяСхема(КомпонентыОбмена, ПространствоИменСвойства) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	ТипВладельцаСвойства = СвойствоXDTO.ОбъектВладелец.Тип();
	
	ПространствоИменВладельца = ТипВладельцаСвойства.URIПространстваИмен;
	Если НЕ ЭтоБазоваяСхема(КомпонентыОбмена, ПространствоИменВладельца) Тогда
		
		// Свойство должно принадлежать объекту XDTO базовой схемы
		Возврат Результат;
		
	КонецЕсли;
	
	ОбъектРасширенияФормата = ФабрикаXDTO.Тип(ПространствоИменСвойства, ТипВладельцаСвойства.Имя);
	Если ОбъектРасширенияФормата <> Неопределено Тогда
		
		СвойствоОбъектаРасширенияФормата = ОбъектРасширенияФормата.Свойства.Получить(СвойствоXDTO.Имя);
		Если СвойствоОбъектаРасширенияФормата <> Неопределено Тогда
			
			Результат = СвойствоОбъектаРасширенияФормата.Тип;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет класс значения свойства для выбора алгоритма преобразования в структуру.
//
// Параметры:
//   СвойствоXDTO     - СвойствоXDTO - описание свойства.
//   ТипЗначенияXDTO  - ТипЗначенияXDTO, ТипОбъектаXDTO - тип значения свойства.
//
// Возвращаемое значение:
//   Строка - имя класса значения свойства.
//
Функция ИмяКлассаЗначенияXDTO(Знач СвойствоXDTO, Знач ТипЗначенияXDTO)
	
	Если СвойствоXDTO.Имя = "AdditionalInfo" Тогда
		Возврат КлассПроизвольныеДанные();
	ИначеЕсли ЭтоТипТаблицыОбъекта(ТипЗначенияXDTO) Тогда
		Возврат КлассТаблицаОбъекта();
	ИначеЕсли СтрНайти(ТипЗначенияXDTO.Имя, ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()) > 0 Тогда
		Возврат ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства();
	ИначеЕсли СтрНайти(ТипЗначенияXDTO.Имя, ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата()) > 0 Тогда
		Возврат ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата();
	ИначеЕсли СтрНайти(ТипЗначенияXDTO.Имя, КлассОбщиеСвойства()) > 0 Тогда
		Возврат КлассОбщиеСвойства();
	Иначе
		Возврат КлассСоставныеСвойства();
	КонецЕсли;
	
КонецФункции

// Параметры:
//   Таблица - ТаблицаЗначений - таблица для инициализации колонок.
//   Тип - ТипОбъектаXDTO - тип объекта.
//
Процедура ИнициализироватьКолонкиТаблицыОбъектаПоТипу(Таблица, Знач Тип)
	
	Для Каждого Колонка Из Тип.Свойства Цикл
		Если СтрНайти(Колонка.Тип.Имя, КлассОбщиеСвойства()) > 0 Тогда
			ИнициализироватьКолонкиТаблицыОбъектаПоТипу(Таблица, Колонка.Тип);
		Иначе
			Таблица.Колонки.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Структура_ДанныеИБ

Функция СтруктураОбъектаФорматаВДанныеИБ(КомпонентыОбмена, Знач ПравилоКонвертации, ДанныеXDTO,
																		Действие = "КонвертироватьИЗаписать")
	
	НомерВторогоЭтапа = НомерВторогоЭтапаКонвертации();

	КонтекстИдентификации = КонтекстИдентификацииПолученныхДанных(
		КомпонентыОбмена,
		ПравилоКонвертации,
		ДанныеXDTO);
	ЗначениеДействияКонвертироватьИЗаписать = ДействиеКонвертироватьИЗаписать();

	ПолученныеДанные = ИнициализироватьПолученныеДанные(ПравилоКонвертации);
	СоставСвойств = ?(
		Действие = КонтекстИдентификации.ЗначениеДействияПолучитьСсылку,
		"СвойстваПоиска",
		"Все");
	
	Если ПодготовитьСсылкуПолученныхДанных(
			КомпонентыОбмена,
			ПравилоКонвертации,
			ДанныеXDTO,
			Действие,
			ПолученныеДанные,
			КонтекстИдентификации) Тогда
		Возврат КонтекстИдентификации.Результат;
	КонецЕсли;
	
	// Конвертация свойств, для которых не нужно выполнение обработчика.
	КонвертацияСвойствСтруктурыОбъектаXDTO(
		КомпонентыОбмена,
		ДанныеXDTO,
		ПолученныеДанные,
		ПравилоКонвертации,
		1,
		СоставСвойств);
	
	Если Действие = КонтекстИдентификации.ЗначениеДействияПолучитьСсылку
			И КомпонентыОбмена.ЭтоEnterpriseData Тогда
		ДанныеXDTO = Новый Структура(ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства(),
			ОбщегоНазначения.СкопироватьРекурсивно(ДанныеXDTO));
	КонецЕсли;
	
	ПриКонвертацииДанныхXDTO(
		ДанныеXDTO,
		ПолученныеДанные,
		КомпонентыОбмена,
		ПравилоКонвертации.ПриКонвертацииДанныхXDTO);
		
	Если Действие = КонтекстИдентификации.ЗначениеДействияПолучитьСсылку
			И КомпонентыОбмена.ЭтоEnterpriseData Тогда
		ДанныеXDTO = ОбщегоНазначения.СкопироватьРекурсивно(
			ДанныеXDTO[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()]);
	КонецЕсли;
		
	КонвертацияСвойствСтруктурыОбъектаXDTO(
		КомпонентыОбмена,
		ДанныеXDTO,
		ПолученныеДанные,
		ПравилоКонвертации,
		НомерВторогоЭтапа,
		СоставСвойств);
	
	// В результате конвертации свойств объект мог быть записан в случае наличия циклической ссылки.
	Если КонтекстИдентификации.ПолученныеДанныеСсылка <> Неопределено
			И ОбщегоНазначения.СсылкаСуществует(
				КонтекстИдентификации.ПолученныеДанныеСсылка) Тогда
		КонтекстИдентификации.ДанныеИБ =
			КонтекстИдентификации.ПолученныеДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если ИдентифицироватьПолученныеДанныеПоПолям(
			КомпонентыОбмена,
			ПравилоКонвертации,
			ПолученныеДанные,
			Действие,
			КонтекстИдентификации) Тогда
		Возврат КонтекстИдентификации.Результат;
	КонецЕсли;
	
	ЗаписыватьОбъектВИБ = Действие = ЗначениеДействияКонвертироватьИЗаписать;
	Если КонтекстИдентификации.ВариантИдентификации = "ПоПолямПоиска"
			Или КонтекстИдентификации.ВариантИдентификации
				= КонтекстИдентификации.ЗначениеВариантаСначалаПоУИДПотомПоПолям Тогда
		// Объекты, при идентификации которых используются поля поиска,
		// должны быть записаны в информационную базу с целью получения одной и той же ссылки на объект при каждом поиске.
		ЗаписыватьОбъектВИБ = Истина;
	КонецЕсли;
	
	Если ЗаписыватьОбъектВИБ Тогда
		Возврат ЗаписатьПолученныеДанныеВИБ(
			КомпонентыОбмена,
			ПравилоКонвертации,
			ПолученныеДанные,
			КонтекстИдентификации.ДанныеИБ,
			Действие,
			КонтекстИдентификации.ЗначениеДействияПолучитьСсылку,
			ЗначениеДействияКонвертироватьИЗаписать);
	КонецЕсли;

	Возврат ПолученныеДанные;

КонецФункции

Функция КонтекстИдентификацииПолученныхДанных(
		КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO)

	Результат = Новый Структура;
	Результат.Вставить("ДанныеИБ", Неопределено);
	Результат.Вставить("ПолученныеДанныеСсылка", Неопределено);
	Результат.Вставить("ОригинальныйУИДСтрокой", Неопределено);
	Результат.Вставить("Результат", Неопределено);
	Результат.Вставить("ЗначениеДействияПолучитьСсылку", ДействиеПолучитьСсылку());
	Результат.Вставить(
		"ЗначениеВариантаСначалаПоУИДПотомПоПолям",
		ВариантИдентификацииСначалаПоУИДПотомПоПолям());
	Результат.Вставить(
		"ВариантИдентификации",
		СокрЛП(ПравилоКонвертации.ВариантИдентификации));
	КлассСсылкаФормата = КлассСсылкаФормата(
		КомпонентыОбмена,
		ПравилоКонвертации.Свойства);
	Результат.Вставить("КлассСсылкаФормата", КлассСсылкаФормата);
	Результат.Вставить(
		"ДанныеФорматаСодержатСсылку",
		ДанныеXDTO.Свойство(КлассСсылкаФормата));

	Возврат Результат;

КонецФункции

Функция ПодготовитьСсылкуПолученныхДанных(
		КомпонентыОбмена, ПравилоКонвертации, ДанныеXDTO, Действие,
		ПолученныеДанные, КонтекстИдентификации)

	Если Не ПравилоКонвертации.ЭтоСсылочныйТип Тогда
		Возврат Ложь;
	КонецЕсли;

	КонтекстИдентификации.ПолученныеДанныеСсылка = ПолученныеДанные.Ссылка;
	ВариантИдентификацииПоИдентификатору =
		КонтекстИдентификации.ВариантИдентификации = "ПоУникальномуИдентификатору"
		Или КонтекстИдентификации.ВариантИдентификации
			= КонтекстИдентификации.ЗначениеВариантаСначалаПоУИДПотомПоПолям;
	Если Не КонтекстИдентификации.ДанныеФорматаСодержатСсылку
			Или Не ВариантИдентификацииПоИдентификатору Тогда
		КонтекстИдентификации.ПолученныеДанныеСсылка =
			ПравилоКонвертации.МенеджерОбъекта.ПолучитьСсылку(
				Новый УникальныйИдентификатор());
		ПолученныеДанные.УстановитьСсылкуНового(
			КонтекстИдентификации.ПолученныеДанныеСсылка);
		Возврат Ложь;
	КонецЕсли;

	КонтекстИдентификации.ОригинальныйУИДСтрокой = ?(
		КомпонентыОбмена.ЭтоEnterpriseData,
		ДанныеXDTO[КонтекстИдентификации.КлассСсылкаФормата].Значение,
		ДанныеXDTO[КонтекстИдентификации.КлассСсылкаФормата]);
	КонтекстИдентификации.ПолученныеДанныеСсылка = СсылкаПоУИД(
		ПравилоКонвертации.ТипДанных,
		КонтекстИдентификации.ОригинальныйУИДСтрокой,
		КомпонентыОбмена);

	КонтекстИдентификации.ДанныеИБ =
		КонтекстИдентификации.ПолученныеДанныеСсылка.ПолучитьОбъект();
	ПолученныеДанные.УстановитьСсылкуНового(
		КонтекстИдентификации.ПолученныеДанныеСсылка);
	Если Действие <> КонтекстИдентификации.ЗначениеДействияПолучитьСсылку Тогда
		Возврат Ложь;
	КонецЕсли;

	Если КонтекстИдентификации.ДанныеИБ <> Неопределено Тогда
		КонтекстИдентификации.Результат = КонтекстИдентификации.ДанныеИБ.Ссылка;
		Возврат Истина;
	КонецЕсли;

	Если КонтекстИдентификации.ВариантИдентификации = "ПоУникальномуИдентификатору" Тогда
		КонтекстИдентификации.Результат =
			КонтекстИдентификации.ПолученныеДанныеСсылка;
		Возврат Истина;
	КонецЕсли;

	// При комбинированной идентификации поиск продолжается по полям.
	КонтекстИдентификации.ДанныеИБ = Неопределено;
	Возврат Ложь;

КонецФункции

Функция ИдентифицироватьПолученныеДанныеПоПолям(
		КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные,
		Действие, КонтекстИдентификации)

	ИдентифицироватьПоПолям =
		КонтекстИдентификации.ВариантИдентификации = "ПоПолямПоиска"
		Или КонтекстИдентификации.ВариантИдентификации
			= КонтекстИдентификации.ЗначениеВариантаСначалаПоУИДПотомПоПолям;
	Если КонтекстИдентификации.ДанныеИБ <> Неопределено
			Или ПравилоКонвертации.ЭтоРегистр
			Или Не ИдентифицироватьПоПолям Тогда
		Возврат Ложь;
	КонецЕсли;

	КонтекстИдентификации.ДанныеИБ = СсылкаОбъектаПоСвойствамОбъектаФормата(
		ПравилоКонвертации,
		ПолученныеДанные,
		КонтекстИдентификации.ДанныеФорматаСодержатСсылку,
		КомпонентыОбмена,
		КонтекстИдентификации.ОригинальныйУИДСтрокой);
	Если Не ЗначениеЗаполнено(КонтекстИдентификации.ДанныеИБ) Тогда
		КонтекстИдентификации.ДанныеИБ = Неопределено;
	КонецЕсли;

	Если КонтекстИдентификации.ДанныеИБ = Неопределено
			Или Не ПравилоКонвертации.ЭтоСсылочныйТип Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Действие = КонтекстИдентификации.ЗначениеДействияПолучитьСсылку Тогда
		КонтекстИдентификации.Результат = КонтекстИдентификации.ДанныеИБ;
		Возврат Истина;
	КонецЕсли;

	КонтекстИдентификации.ДанныеИБ =
		КонтекстИдентификации.ДанныеИБ.ПолучитьОбъект();
	Возврат Ложь;

КонецФункции

Функция ЗаписатьПолученныеДанныеВИБ(
		КомпонентыОбмена, ПравилоКонвертации, ПолученныеДанные, ДанныеИБ,
		Действие, ЗначениеДействияПолучитьСсылку, ЗначениеДействияКонвертироватьИЗаписать)

	ЭтоПолнаяЗагрузкаОбъекта = Действие = ЗначениеДействияКонвертироватьИЗаписать
		Или ПравилоКонвертации.РазрешитьСоздаватьОбъектИзСтруктуры
		Или (Действие = ЗначениеДействияПолучитьСсылку И ДанныеИБ = Неопределено);

	Если ЭтоПолнаяЗагрузкаОбъекта
			И ПравилоКонвертации.ЕстьОбработчикПередЗаписьюПолученныхДанных Тогда
		ПередЗаписьюПолученныхДанных(
			ПолученныеДанные,
			ДанныеИБ,
			КомпонентыОбмена,
			ПравилоКонвертации.ПередЗаписьюПолученныхДанных,
			ПравилоКонвертации.Свойства);
	КонецЕсли;

	ДанныеДляЗаписиВИБ = ПодготовитьДанныеДляЗаписиВИБ(
		ПравилоКонвертации,
		ПолученныеДанные,
		ДанныеИБ); // СправочникОбъектИмяСправочника, ДокументОбъектИмяДокумента
	Если ДанныеДляЗаписиВИБ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ПравилоКонвертации.ЭтоСсылочныйТип И ЭтоПолнаяЗагрузкаОбъекта Тогда
		ПровестиГенерациюКодаНомераПриНеобходимости(ДанныеДляЗаписиВИБ);
	КонецЕсли;

	Если ПравилоКонвертации.ЭтоСсылочныйТип И ДанныеДляЗаписиВИБ.ПометкаУдаления Тогда
		ДанныеДляЗаписиВИБ.ПометкаУдаления = Ложь;
	КонецЕсли;

	Если ПравилоКонвертации.ЭтоДокумент Тогда
		ЗаписатьПолученныйДокументВИБ(
			КомпонентыОбмена,
			ПравилоКонвертации,
			ДанныеДляЗаписиВИБ);
	Иначе
		ЗаписатьОбъектВИБ(
			КомпонентыОбмена,
			ДанныеДляЗаписиВИБ,
			ПравилоКонвертации.ТипДанных);
	КонецЕсли;
	
	Возврат ДанныеДляЗаписиВИБ;
	
КонецФункции

Функция ПодготовитьДанныеДляЗаписиВИБ(ПравилоКонвертации, ПолученныеДанные, ДанныеИБ)

	Если ДанныеИБ = Неопределено Тогда
		Возврат ПолученныеДанные;
	КонецЕсли;

	Если ПолученныеДанные <> Неопределено Тогда
		ЗаполнитьДанныеИБПоПолученнымДанным(ДанныеИБ, ПолученныеДанные, ПравилоКонвертации);
	КонецЕсли;

	Возврат ДанныеИБ;

КонецФункции

Процедура ЗаписатьПолученныйДокументВИБ(КомпонентыОбмена, ПравилоКонвертации, ДанныеДляЗаписиВИБ)

	Попытка
		Если Не ПравилоКонвертации.ДокументМожетПроводиться Тогда
			ЗаписатьОбъектВИБ(
				КомпонентыОбмена,
				ДанныеДляЗаписиВИБ,
				ПравилоКонвертации.ТипДанных);
			Возврат;
		КонецЕсли;

		Если ДанныеДляЗаписиВИБ.Проведен Тогда
			ЗаписатьПолученныйПроведенныйДокумент(
				КомпонентыОбмена,
				ПравилоКонвертации,
				ДанныеДляЗаписиВИБ);
		Иначе
			ЗаписатьПолученныйНепроведенныйДокумент(
				КомпонентыОбмена,
				ПравилоКонвертации,
				ДанныеДляЗаписиВИБ);
		КонецЕсли;
	Исключение
		ОбработатьИсключение(
			ИнформацияОбОшибке(),
			НСтр("ru = 'Ошибка записи объекта в информационную базу'"));
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьПолученныйПроведенныйДокумент(
		КомпонентыОбмена, ПравилоКонвертации, ДанныеДляЗаписиВИБ)

	ДанныеДляЗаписиВИБ.Проведен = Ложь;
	//@skip-check bsl-legacy-check-string-literal
	ДокументПроведенВИБ = Не ДанныеДляЗаписиВИБ.ЭтоНовый()
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляЗаписиВИБ.Ссылка, "Проведен");
	Если ДокументПроведенВИБ Тогда
		ОтменитьПроведениеОбъектаВИБ(ДанныеДляЗаписиВИБ, КомпонентыОбмена);
	Иначе
		ЗаписатьОбъектВИБ(
			КомпонентыОбмена,
			ДанныеДляЗаписиВИБ,
			ПравилоКонвертации.ТипДанных);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьПолученныйНепроведенныйДокумент(
		КомпонентыОбмена, ПравилоКонвертации, ДанныеДляЗаписиВИБ)

	Если ДанныеДляЗаписиВИБ.ЭтоНовый() Тогда
		ЗаписатьОбъектВИБ(
			КомпонентыОбмена,
			ДанныеДляЗаписиВИБ,
			ПравилоКонвертации.ТипДанных);
	Иначе
		ОтменитьПроведениеОбъектаВИБ(ДанныеДляЗаписиВИБ, КомпонентыОбмена);
	КонецЕсли;

КонецПроцедуры

Функция ИнициализироватьПолученныеДанные(ПравилоКонвертации)
	
	ПолученныеДанные = Неопределено;
	
	Если ПравилоКонвертации.ЭтоДокумент Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьДокумент();
	ИначеЕсли ПравилоКонвертации.ЭтоСправочник
		Или ПравилоКонвертации.ЭтоПланВидовХарактеристик Тогда
		МенеджерОбъекта = ПравилоКонвертации.МенеджерОбъекта; // СправочникМенеджер
		Если ПравилоКонвертации.ПравилоДляГруппыСправочника Тогда
			ПолученныеДанные = МенеджерОбъекта.СоздатьГруппу();
		Иначе
			ПолученныеДанные = МенеджерОбъекта.СоздатьЭлемент();
		КонецЕсли;
	ИначеЕсли ПравилоКонвертации.ЭтоРегистр Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьНаборЗаписей();
	ИначеЕсли ПравилоКонвертации.ЭтоБизнесПроцесс Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьБизнесПроцесс();
	ИначеЕсли ПравилоКонвертации.ЭтоЗадача Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьЗадачу();
	ИначеЕсли ПравилоКонвертации.ЭтоПланСчетов Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьСчет();
	ИначеЕсли ПравилоКонвертации.ЭтоПланВидовРасчета Тогда
		ПолученныеДанные = ПравилоКонвертации.МенеджерОбъекта.СоздатьВидРасчета();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПолученныеДанные;
	
КонецФункции

Функция СсылкаПоУИД(ТипЗначенияОбъектаИБ, УИДОбъектаXDTO, КомпонентыОбмена)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗначенияОбъектаИБ);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ПустаяСсылка = ОписаниеТипов.ПривестиЗначение();

	МенеджерОбъектаМетаданных = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПустаяСсылка);
	
	Возврат МенеджерОбъектаМетаданных.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДОбъектаXDTO));
	
КонецФункции

Процедура КонвертацияСвойствСтруктурыОбъектаXDTO(
		КомпонентыОбмена,
		ДанныеXDTO,
		ПолученныеДанные,
		ПравилоКонвертации,
		НомерЭтапа = 1,
		СоставСвойств = "Все")
	
	Попытка
		КонвертироватьСвойстваШапки(
			КомпонентыОбмена,
			ДанныеXDTO,
			ПолученныеДанные,
			ПравилоКонвертации,
			НомерЭтапа,
			СоставСвойств);

		Если СоставСвойств = "СвойстваПоиска" Тогда
			Возврат;
		КонецЕсли;

		Для Каждого ТабличнаяЧасть Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
			КонвертироватьТабличнуюЧастьПервогоЭтапа(
				КомпонентыОбмена,
				ДанныеXDTO,
				ПолученныеДанные,
				ТабличнаяЧасть,
				НомерЭтапа);
			КонвертироватьТабличнуюЧастьВторогоЭтапа(
				КомпонентыОбмена,
				ДанныеXDTO,
				ПолученныеДанные,
				ТабличнаяЧасть,
				НомерЭтапа);
		КонецЦикла;
	Исключение
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Ошибка конвертации свойств.'"));
	КонецПопытки;

КонецПроцедуры

Процедура КонвертироватьСвойстваШапки(
		КомпонентыОбмена, ДанныеXDTO, ПолученныеДанные, ПравилоКонвертации, НомерЭтапа, СоставСвойств)

	Для Каждого ПКС Из ПравилоКонвертации.Свойства Цикл

		Если СоставСвойств = "СвойстваПоиска"
				И Не ПКС.ОбработкаПоисковогоСвойства Тогда
			Продолжить;
		КонецЕсли;

		КонвертацияСвойстваСтруктурыОбъектаXDTO(
			КомпонентыОбмена,
			ДанныеXDTO,
			ПолученныеДанные.ДополнительныеСвойства,
			ПолученныеДанные,
			ПКС,
			НомерЭтапа);

	КонецЦикла;

КонецПроцедуры

Процедура КонвертироватьТабличнуюЧастьПервогоЭтапа(
		КомпонентыОбмена, ДанныеXDTO, ПолученныеДанные, ОписаниеТабличнойЧасти, НомерЭтапа)

	Если НомерЭтапа <> 1
			Или Не ЗначениеЗаполнено(ОписаниеТабличнойЧасти.ТЧКонфигурации)
			Или Не ЗначениеЗаполнено(ОписаниеТабличнойЧасти.ТЧФормата) Тогда
		Возврат;
	КонецЕсли;

	ТЧФормата = Неопределено;
	Если Не ДанныеXDTO.Свойство(ОписаниеТабличнойЧасти.ТЧФормата, ТЧФормата)
			Или ТЧФормата.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ИменаКолонок = Новый Массив;
	Для Каждого КолонкаТЧ Из ТЧФормата.Колонки Цикл
		ИменаКолонок.Добавить(КолонкаТЧ.Имя);
	КонецЦикла;
	ИменаКолонокСтрокой = СтрСоединить(ИменаКолонок, ",");

	Для Каждого ДанныеСтрокиXDTO Из ТЧФормата Цикл

		СтрокаТЧ = ПолученныеДанные[ОписаниеТабличнойЧасти.ТЧКонфигурации].Добавить();
		СтруктураДанныхСтрокиXDTO = Новый Структура(ИменаКолонокСтрокой);
		ЗаполнитьЗначенияСвойств(СтруктураДанныхСтрокиXDTO, ДанныеСтрокиXDTO);

		Для Каждого ПКС Из ОписаниеТабличнойЧасти.Свойства Цикл
			Если ПКС.ИспользуетсяАлгоритмКонвертации Тогда
				Продолжить;
			КонецЕсли;
			
			КонвертацияСвойстваСтруктурыОбъектаXDTO(
				КомпонентыОбмена,
				СтруктураДанныхСтрокиXDTO,
				ПолученныеДанные.ДополнительныеСвойства,
				СтрокаТЧ,
				ПКС,
				НомерЭтапа);
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

Процедура КонвертироватьТабличнуюЧастьВторогоЭтапа(
		КомпонентыОбмена, ДанныеXDTO, ПолученныеДанные, ОписаниеТабличнойЧасти, НомерЭтапа)

	ОбрабатыватьСтроки = НомерЭтапа = НомерВторогоЭтапаКонвертации()
		И ОписаниеТабличнойЧасти.ИспользуетсяАлгоритмКонвертации
		И ЗначениеЗаполнено(ОписаниеТабличнойЧасти.ТЧКонфигурации)
		И ПолученныеДанные.ДополнительныеСвойства.Свойство(ОписаниеТабличнойЧасти.ТЧКонфигурации);
	Если Не ОбрабатыватьСтроки Тогда
		Возврат;
	КонецЕсли;

	СтруктурыСтрок = ПолученныеДанные.ДополнительныеСвойства[ОписаниеТабличнойЧасти.ТЧКонфигурации];
	КоличествоСтрок = ПолученныеДанные[ОписаниеТабличнойЧасти.ТЧКонфигурации].Количество();
	Для НомерСтроки = 1 По СтруктурыСтрок.Количество() Цикл

		Если НомерСтроки <= КоличествоСтрок Тогда
			СтрокаТЧ = ПолученныеДанные[ОписаниеТабличнойЧасти.ТЧКонфигурации][НомерСтроки - 1];
		Иначе
			СтрокаТЧ = ПолученныеДанные[ОписаниеТабличнойЧасти.ТЧКонфигурации].Добавить();
		КонецЕсли;
		
		Для Каждого ПКС Из ОписаниеТабличнойЧасти.Свойства Цикл
			Если Не ПКС.ИспользуетсяАлгоритмКонвертации Тогда
				Продолжить;
			КонецЕсли;
			
			КонвертацияСвойстваСтруктурыОбъектаXDTO(
				КомпонентыОбмена,
				ДанныеXDTO,
				ПолученныеДанные.ДополнительныеСвойства,
				СтрокаТЧ,
				ПКС,
				НомерЭтапа,
				ОписаниеТабличнойЧасти.ТЧКонфигурации);
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

Процедура КонвертацияСвойстваСтруктурыОбъектаXDTO(
		КомпонентыОбмена,
		ДанныеXDTO,
		ДополнительныеСвойства,
		ПриемникДанных,
		ПКС,
		НомерЭтапа = 1,
		ИмяТЧ = "")
	
	Если ПустаяСтрока(ПКС.СвойствоКонфигурации)
			Или ПКС.СвойствоКонфигурации = КлассСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗначениеСвойства = "";
		Если НомерЭтапа = 1 Тогда
			ЗначениеПолучено = ПолучитьЗначениеСвойстваПервогоЭтапаКонвертации(
				КомпонентыОбмена,
				ДанныеXDTO,
				ПриемникДанных,
				ПКС,
				ЗначениеСвойства);
		Иначе
			ЗначениеПолучено = ПолучитьЗначениеСвойстваВторогоЭтапаКонвертации(
				ДополнительныеСвойства,
				ПриемникДанных,
				ПКС,
				НомерЭтапа,
				ИмяТЧ,
				ЗначениеСвойства);
		КонецЕсли;

		Если Не ЗначениеПолучено Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			Возврат;
		КонецЕсли;
		
		ПравилоКонвертацииСвойства = ПКС.ПравилоКонвертацииСвойства;
		УдалятьСозданныеПоКлючевымСвойствам = КомпонентыОбмена.УдалятьСозданныеПоКлючевымСвойствам;
		РазобратьИнструкциюПолучения(
			ЗначениеСвойства,
			ПравилоКонвертацииСвойства,
			УдалятьСозданныеПоКлючевымСвойствам);
		
		Если ТипЗнч(ЗначениеСвойства) <> ТипСтруктура() Тогда
			ПриемникДанных[ПКС.СвойствоКонфигурации] = ЗначениеСвойства;
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПравилоКонвертацииСвойства) Тогда
			Возврат;
		КонецЕсли;

		Если КонвертироватьПредопределенноеЗначение(
				КомпонентыОбмена,
				ПравилоКонвертацииСвойства,
				ЗначениеСвойства,
				ПриемникДанных,
				ПКС.СвойствоКонфигурации) Тогда
			Возврат;
		КонецЕсли;

		ПравилоКонвертации = Новый Структура(
			"ПравилоКонвертации, УдалятьСозданныеПоКлючевымСвойствам",
			ПКОПоИмени(КомпонентыОбмена, ПравилоКонвертацииСвойства),
			УдалятьСозданныеПоКлючевымСвойствам);
		ДанныеДляЗаписиВИБ = СтруктураОбъектаФорматаВДанныеИБ(
			КомпонентыОбмена,
			ПравилоКонвертации,
			ЗначениеСвойства,
			ДействиеПолучитьСсылку());
		
		Если ДанныеДляЗаписиВИБ <> Неопределено Тогда
			ПриемникДанных[ПКС.СвойствоКонфигурации] = ДанныеДляЗаписиВИБ.Ссылка;
		КонецЕсли;
	Исключение
		ШаблонОшибки = НСтр("ru = 'Ошибка конвертации свойства объекта XDTO, имя свойства: <%1>.'");
		ОбработатьИсключение(
			ИнформацияОбОшибке(),
			СтрШаблон(ШаблонОшибки, ПКС.СвойствоКонфигурации));
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьЗначениеСвойстваВторогоЭтапаКонвертации(
		ДополнительныеСвойства, ПриемникДанных, ПКС, НомерЭтапа, ИмяТЧ, ЗначениеСвойства)

	Если НомерЭтапа <> НомерВторогоЭтапаКонвертации()
			Или Не ПКС.ИспользуетсяАлгоритмКонвертации Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ЗначениеЗаполнено(ИмяТЧ) Тогда
		//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
		ИсточникДанных = ДополнительныеСвойства[ИмяТЧ][ПриемникДанных.НомерСтроки - 1];
	Иначе
		ИсточникДанных = ДополнительныеСвойства;
	КонецЕсли;

	Если ИсточникДанных.Свойство(ПКС.СвойствоКонфигурации) Тогда
		ЗначениеСвойства = ИсточникДанных[ПКС.СвойствоКонфигурации];
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция ПолучитьЗначениеСвойстваПервогоЭтапаКонвертации(
		КомпонентыОбмена, ДанныеXDTO, ПриемникДанных, ПКС, ЗначениеСвойства)

	Если Не ЗначениеЗаполнено(ПКС.СвойствоФормата) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ПКС.ОбработкаКлючевогоСвойства
			И КомпонентыОбмена.ЭтоEnterpriseData
			И Не ДанныеXDTO.Свойство("ЭтоНаборКлючевыхСвойств") Тогда
		ИсточникДанных = ДанныеXDTO[ОбменДаннымиXDTOСервер.КлассКлючевыеСвойства()];
	Иначе
		ИсточникДанных = ДанныеXDTO;
	КонецЕсли;

	ИмяСвойстваФормата = СокрЛП(ПКС.СвойствоФормата);
	Если СтрНайти(ИмяСвойстваФормата, ".") > 0 Тогда
		ПолучитьЗначениеВложенныхСвойств(
			ИсточникДанных,
			СтрРазделить(ИмяСвойстваФормата, ".", Ложь),
			ЗначениеСвойства);
		Возврат Истина;
	КонецЕсли;

	СвойствоНайдено = ИсточникДанных.Свойство(ИмяСвойстваФормата, ЗначениеСвойства);
	Если Не СвойствоНайдено
			И Не ПКС.ОбработкаКлючевогоСвойства
			И Не ПКС.ИспользуетсяАлгоритмКонвертации Тогда
		ЗарегистрироватьОтсутствующееСвойство(ПриемникДанных, ИмяСвойстваФормата);
	КонецЕсли;

	Возврат Истина;

КонецФункции

Процедура ЗарегистрироватьОтсутствующееСвойство(ПриемникДанных, ИмяСвойства)

	ИмяСписка = "СвойстваОтсутствующиеВПолученныхДанных";
	Если ПриемникДанных.ДополнительныеСвойства.Свойство(ИмяСписка) Тогда
		ПриемникДанных.ДополнительныеСвойства[ИмяСписка]
			= ПриемникДанных.ДополнительныеСвойства[ИмяСписка] + "," + ИмяСвойства;
	Иначе
		ПриемникДанных.ДополнительныеСвойства.Вставить(ИмяСписка, ИмяСвойства);
	КонецЕсли;

КонецПроцедуры

Процедура РазобратьИнструкциюПолучения(
		ЗначениеСвойства, ПравилоКонвертацииСвойства, УдалятьСозданныеПоКлючевымСвойствам)

	Если ТипЗнч(ЗначениеСвойства) <> ТипСтруктура()
			Или Не ЗначениеСвойства.Свойство("ИмяПКО")
			Или Не ЗначениеСвойства.Свойство("Значение") Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеСвойства.Свойство("УдалятьСозданныеПоКлючевымСвойствам") Тогда
		УдалятьСозданныеПоКлючевымСвойствам = ЗначениеСвойства.УдалятьСозданныеПоКлючевымСвойствам;
	КонецЕсли;

	ПравилоКонвертацииСвойства = ЗначениеСвойства.ИмяПКО;
	ЗначениеСвойства = ЗначениеСвойства.Значение;

КонецПроцедуры

Функция КонвертироватьПредопределенноеЗначение(
		КомпонентыОбмена, ИмяПравила, ЗначениеСвойства, ПриемникДанных, ИмяСвойства)

	ПКПД = КомпонентыОбмена.ПравилаКонвертацииПредопределенныхДанных.Найти(
		ИмяПравила,
		"ИмяПКПД");
	Если ПКПД = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ПриемникДанных[ИмяСвойства] = ПКПД.КонвертацииЗначенийПриПолучении.Получить(
		ЗначениеСвойства.Значение);
	Возврат Истина;

КонецФункции

Функция СсылкаОбъектаПоСвойствамОбъектаФормата(
		ПравилоКонвертации, ПолученныеДанные, ДанныеФорматаСодержатСсылку,
		КомпонентыОбмена, ОригинальныйУИДСтрокой = "")

	Если ПравилоКонвертации.ПоляПоиска = Неопределено
			Или ТипЗнч(ПравилоКонвертации.ПоляПоиска) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВариантыПоискаЗапросом = Новый Массив;
	РезультатПлатформенногоПоиска = Неопределено;
	ПриоритетВарианта = 0;
	Для Каждого ОписаниеПолейПоиска Из ПравилоКонвертации.ПоляПоиска Цикл

		ПриоритетВарианта = ПриоритетВарианта + 1;
		ПоляПоиска = Новый Структура(ОписаниеПолейПоиска);
		ЗаполнитьЗначенияСвойств(ПоляПоиска, ПолученныеДанные);
		Если Не ПоляПоискаЗаполнены(ПравилоКонвертации, ПоляПоиска) Тогда
			Продолжить;
		КонецЕсли;
		
		ИспользованПлатформенныйПоиск = Ложь;
		Результат = НайтиОбъектПлатформеннымМетодом(
			ПравилоКонвертации,
			ПоляПоиска,
			ИспользованПлатформенныйПоиск);
		Если ЗначениеЗаполнено(Результат) Тогда
			РезультатПлатформенногоПоиска = Новый Структура(
				"Приоритет, Ссылка",
				ПриоритетВарианта,
				Результат);
			Прервать;
		КонецЕсли;

		Если Не ИспользованПлатформенныйПоиск Тогда
			ВариантПоискаЗапросом = Новый Структура(
				"Приоритет, ПоляПоиска",
				ПриоритетВарианта,
				ПоляПоиска);
			ВариантыПоискаЗапросом.Добавить(ВариантПоискаЗапросом);
		КонецЕсли;

	КонецЦикла;

	РезультатПоискаЗапросом = НайтиОбъектПоВариантамПоискаЗапросом(
		ПравилоКонвертации,
		ВариантыПоискаЗапросом);
	Если РезультатПоискаЗапросом = Неопределено Тогда
		Возврат ?(
			РезультатПлатформенногоПоиска = Неопределено,
			Неопределено,
			РезультатПлатформенногоПоиска.Ссылка);
	КонецЕсли;

	Если РезультатПлатформенногоПоиска = Неопределено
			Или РезультатПоискаЗапросом.Приоритет
				< РезультатПлатформенногоПоиска.Приоритет Тогда
		Возврат РезультатПоискаЗапросом.Ссылка;
	КонецЕсли;

	Возврат РезультатПлатформенногоПоиска.Ссылка;

КонецФункции

Функция ПоляПоискаЗаполнены(ПравилоКонвертации, ПоляПоиска)

	Для Каждого ПолеПоиска Из ПоляПоиска Цикл
		Если ЗначениеЗаполнено(ПолеПоиска.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		ДопустимПустойРодитель = (ПравилоКонвертации.ЭтоСправочник
			Или ПравилоКонвертации.ЭтоПланВидовХарактеристик)
			И ПолеПоиска.Ключ = "Родитель";
		Если Не ДопустимПустойРодитель Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

Функция НайтиОбъектПлатформеннымМетодом(
		ПравилоКонвертации, ПоляПоиска, ИспользованПлатформенныйПоиск)

	ПоискДокументаПоНомеру = ПравилоКонвертации.ЭтоДокумент
		И ПоляПоиска.Количество() = КоличествоПолейПоискаДокумента()
		И ПоляПоиска.Свойство("Дата")
		И ПоляПоиска.Свойство("Номер");
	Если ПоискДокументаПоНомеру Тогда
		ИспользованПлатформенныйПоиск = Истина;
		Результат = ПравилоКонвертации.МенеджерОбъекта.НайтиПоНомеру(
			ПоляПоиска.Номер,
			ПоляПоиска.Дата);
		Возврат ?(Результат.Пустая(), Неопределено, Результат);
	КонецЕсли;

	Если ПравилоКонвертации.ЭтоСправочник
			И ПоляПоиска.Количество() = 1
			И ПоляПоиска.Свойство("Наименование") Тогда
		ИспользованПлатформенныйПоиск = Истина;
		Возврат ПравилоКонвертации.МенеджерОбъекта.НайтиПоНаименованию(
			ПоляПоиска.Наименование,
			Истина);
	КонецЕсли;

	Если ПравилоКонвертации.ЭтоСправочник
			И ПоляПоиска.Количество() = 1
			И ПоляПоиска.Свойство("Код") Тогда
		ИспользованПлатформенныйПоиск = Истина;
		Возврат ПравилоКонвертации.МенеджерОбъекта.НайтиПоКоду(ПоляПоиска.Код);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция НайтиОбъектПоВариантамПоискаЗапросом(ПравилоКонвертации, ВариантыПоиска)

	Если ВариантыПоиска.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	ЧастиЗапроса = Новый Массив;
	НомерВарианта = 0;
	Для Каждого ВариантПоиска Из ВариантыПоиска Цикл

		НомерВарианта = НомерВарианта + 1;
		УсловияОтбора = Новый Массив;
		НомерПоля = 0;
		Для Каждого ПолеПоиска Из ВариантПоиска.ПоляПоиска Цикл

			НомерПоля = НомерПоля + 1;
			ИмяПараметра = "Значение" + XMLСтрока(НомерВарианта) + "_" + XMLСтрока(НомерПоля);
			УсловиеОтбора = УсловиеОтбораПоПолю(
				ПравилоКонвертации,
				ПолеПоиска,
				ИмяПараметра);
			УсловияОтбора.Добавить(УсловиеОтбора);
			Запрос.УстановитьПараметр(ИмяПараметра, ПолеПоиска.Значение);
			
		КонецЦикла;

		ЧастьЗапроса =
		"ВЫБРАТЬ
		|	&Приоритет КАК Приоритет,
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	&ПолноеИмя КАК Таблица
		|ГДЕ
		|	&УсловиеОтбора";
		ЧастьЗапроса = СтрЗаменить(
			ЧастьЗапроса,
			"&Приоритет",
			XMLСтрока(ВариантПоиска.Приоритет));
		ЧастьЗапроса = СтрЗаменить(ЧастьЗапроса, "&ПолноеИмя", ПравилоКонвертации.ПолноеИмя);
		ЧастьЗапроса = СтрЗаменить(
			ЧастьЗапроса,
			"&УсловиеОтбора",
			СтрСоединить(УсловияОтбора, " И "));
		ЧастиЗапроса.Добавить(ЧастьЗапроса);

	КонецЦикла;

	Запрос.Текст = СтрСоединить(
		ЧастиЗапроса,
		Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	МинимальныйПриоритет = Неопределено;
	Результат = Неопределено;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если МинимальныйПриоритет = Неопределено
				Или Выборка.Приоритет < МинимальныйПриоритет Тогда
			МинимальныйПриоритет = Выборка.Приоритет;
			Результат = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура(
		"Приоритет, Ссылка",
		МинимальныйПриоритет,
		Результат);

КонецФункции

Функция УсловиеОтбораПоПолю(ПравилоКонвертации, ПолеПоиска, ИмяПараметра)

	Если ОбменДаннымиПовтИсп.ЭтоСтроковыйРеквизитНеограниченнойДлины(
			ПравилоКонвертации.ПолноеИмя,
			ПолеПоиска.Ключ) Тогда

		Результат = "ВЫРАЗИТЬ(Таблица.[Ключ] КАК СТРОКА([ДлинаСтроки])) = &[Параметр]";
		Результат = СтрЗаменить(Результат, "[Ключ]", ПолеПоиска.Ключ);
		Результат = СтрЗаменить(
			Результат,
			"[ДлинаСтроки]",
			Формат(СтрДлина(ПолеПоиска.Значение), "ЧГ=0"));
	Иначе
		Результат = СтрЗаменить("Таблица.[Ключ] = &[Параметр]", "[Ключ]", ПолеПоиска.Ключ);
	КонецЕсли;

	Возврат СтрЗаменить(Результат, "[Параметр]", ИмяПараметра);
	
КонецФункции

Процедура ЗаполнитьДанныеИБПоПолученнымДанным(ДанныеИБ, ПолученныеДанные, ПравилоКонвертации)
	
	СвойстваОтсутствующиеВПолученныхДанных = Новый Массив;
	Если ПолученныеДанные.ДополнительныеСвойства.Свойство("СвойстваОтсутствующиеВПолученныхДанных") Тогда
		
		СвойстваОтсутствующиеВПолученныхДанных
			= СтрРазделить(ПолученныеДанные.ДополнительныеСвойства.СвойстваОтсутствующиеВПолученныхДанных, ",", Ложь);
		
	КонецЕсли;
	
	ПоляКопии = ПравилоКонвертации.Свойства.ВыгрузитьКолонку("СвойствоКонфигурации");
	Если ПоляКопии.Количество() > 0 Тогда
		
		Для НомерПоля = 0 По ПоляКопии.ВГраница() Цикл
			
			ПоляКопии[НомерПоля] = СокрЛП(ПоляКопии[НомерПоля]);
			
		КонецЦикла;
		
		Для НомерОтсутствующегоПоля = 0 По СвойстваОтсутствующиеВПолученныхДанных.ВГраница() Цикл
			
			СвойстваОтсутствующиеВПолученныхДанных[НомерОтсутствующегоПоля]
				= СокрЛП(СвойстваОтсутствующиеВПолученныхДанных[НомерОтсутствующегоПоля]);
			
			ИндексОтсутствующегоПоля = ПоляКопии.Найти(СвойстваОтсутствующиеВПолученныхДанных[НомерОтсутствующегоПоля]);
			Если ИндексОтсутствующегоПоля <> Неопределено Тогда
				
				ПоляКопии.Удалить(ИндексОтсутствующегоПоля);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПоляКопируемые = СтрСоединить(ПоляКопии, ",");
		ПоляИсключаемые = СтрСоединить(СвойстваОтсутствующиеВПолученныхДанных, ",");
		
		ЗаполнитьЗначенияСвойств(ДанныеИБ, ПолученныеДанные, ПоляКопируемые, ПоляИсключаемые);
		
	КонецЕсли;
	
	Для Каждого КонвертацииТЧ Из ПравилоКонвертации.СвойстваТабличныхЧастей Цикл
		
		ИмяТЧ = КонвертацииТЧ.ТЧКонфигурации;
		
		Если ПустаяСтрока(ИмяТЧ) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеИБ[ИмяТЧ].Очистить();
		ДанныеИБ[ИмяТЧ].Загрузить(ПолученныеДанные[ИмяТЧ].Выгрузить());
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПровестиГенерациюКодаНомераПриНеобходимости(Объект)
	
	ИмяТипаОбъекта = ОбщегоНазначения.ВидОбъектаПоТипу(ТипЗнч(Объект.Ссылка));
	
	// По типу документа смотрим заполнен код или номер.
	Если ИмяТипаОбъекта = "Документ"
		Или ИмяТипаОбъекта = "БизнесПроцесс"
		Или ИмяТипаОбъекта = "Задача" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Номер) Тогда
			
			Объект.УстановитьНовыйНомер();
			
		КонецЕсли;
		
	ИначеЕсли ИмяТипаОбъекта = "Справочник"
		Или ИмяТипаОбъекта = "ПланВидовХарактеристик" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Код)
			И Объект.Метаданные().Автонумерация Тогда
			
			Объект.УстановитьНовыйКод();
			
		КонецЕсли;
	Иначе
		// Для объектов других типов генерация кода или номера не требуется.
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура СнятьПометкуУдаленияСПредопределенногоЭлемента(Объект, ТипОбъекта, КомпонентыОбмена)
	
	ПометкаПредопределенный = Новый Структура("ПометкаУдаления, Предопределенный", Ложь, Ложь);
	ЗаполнитьЗначенияСвойств(ПометкаПредопределенный, Объект);
	
	Если ПометкаПредопределенный.ПометкаУдаления
		И ПометкаПредопределенный.Предопределенный Тогда
			
		Объект.ПометкаУдаления = Ложь;
		
		ВызватьИсключение НСтр("ru = 'Ошибка установки свойства предопределенного элемента.
			|Нельзя помечать на удаление предопределенный элемент. Пометка на удаление для объекта не установлена.'");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОбменДаннымиЗагрузка(КомпонентыОбмена, Объект) 
	
	ИмяДополнительногоСвойства = "ОтключитьМеханизмРегистрацииОбъектов";

	Объект.ОбменДанными.Загрузка = КомпонентыОбмена.ОбменДаннымиЗагрузка;
	кфкИнтеграция.Отключить(Объект);
	
	Если КомпонентыОбмена.ОтключитьМеханизмРегистрации Тогда
		Объект.ДополнительныеСвойства.Вставить(ИмяДополнительногоСвойства, Истина);
		
	ИначеЕсли Объект.ДополнительныеСвойства.Свойство(ИмяДополнительногоСвойства) Тогда
		Объект.ДополнительныеСвойства.Удалить(ИмяДополнительногоСвойства);
	Иначе
		// Дополнительное свойство отсутствует, изменение не требуется.
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Записывает объект в информационную базу.
//
// Параметры:
//  КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//  Объект - Произвольный - СправочникОбъект, ДокументОбъект и др записываемый объект.
//  Тип - Строка - тип объекта строкой.
// 
Процедура ЗаписатьОбъектВИБ(КомпонентыОбмена, Объект, Тип)
	
	УстановитьОбменДаннымиЗагрузка(КомпонентыОбмена, Объект);
	
	// Выполняем проверку на пометку удаления предопределенного элемента.
	СнятьПометкуУдаленияСПредопределенногоЭлемента(Объект, Тип, КомпонентыОбмена);
	
	ИспользоватьТранзакции = КомпонентыОбмена.ИспользоватьТранзакции;
	
	Если ИспользоватьТранзакции Тогда
		//@skip-check begin-transaction
		НачатьТранзакцию();
	КонецЕсли;
	Попытка
		
		// Записываем объект в транзакцию.
		Объект.Записать();
		
		Если ИспользоватьТранзакции Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		Если ИспользоватьТранзакции Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ОбработатьИсключение(ИнформацияОбОшибке(), НСтр("ru = 'Ошибка записи объекта в базу данных'"));
	КонецПопытки;
	
КонецПроцедуры

// Отменяет проведение объекта в информационной базе.
//
// Параметры:
//  Объект      - ДокументОбъект - документ для отмены проведения.
//  КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//
// Возвращаемое значение:
//   Булево - признак успешной отмены проведения.
//
Функция ОтменитьПроведениеОбъектаВИБ(Объект, КомпонентыОбмена = Неопределено)
	
	ИмяСвойстваУдаленияДвижений = "СинхронизацияДанныхЧерезУниверсальныйФорматУдалениеДвижений";

	// Проверка на коллизии дат запрета загрузки.
	Объект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения");
	
	// Параметр "СинхронизацияДанныхЧерезУниверсальныйФорматУдалениеДвижений" используется при 
	// обработке удаления движений, например, в модуле набора записей регистра накопления.
	// Если разработчик определил такой параметр в правилах конвертации, пропускаем данный этап.
	Если НЕ Объект.ДополнительныеСвойства.Свойство(ИмяСвойстваУдаленияДвижений) Тогда
		
		Объект.ДополнительныеСвойства.Вставить(ИмяСвойстваУдаленияДвижений, Истина);
		
	КонецЕсли;
	
	ПроведениеДокументаОтменено = Ложь;
	ИспользоватьТранзакции = КомпонентыОбмена.ИспользоватьТранзакции;
	
	Если ИспользоватьТранзакции Тогда
		//@skip-check begin-transaction
		НачатьТранзакцию();
	КонецЕсли;
	Попытка
		
		Если Объект.ДополнительныеСвойства.Свойство("ИспользоватьОтменуПроведенияДляОчисткиДвижений")
			И Объект.ДополнительныеСвойства.ИспользоватьОтменуПроведенияДляОчисткиДвижений = Истина Тогда
			
			УстановитьОбменДаннымиЗагрузка(КомпонентыОбмена, Объект);
			Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
			УстановитьОбменДаннымиЗагрузка(КомпонентыОбмена, Объект);
			
		Иначе
			
			// Устанавливаем режим загрузки данных для объекта.
			УстановитьОбменДаннымиЗагрузка(КомпонентыОбмена, Объект);
			
			// Отменяем проведение документа.
			Объект.Проведен = Ложь;
			Объект.Записать();
			
			ОбменДаннымиСервер.УдалитьДвиженияУДокумента(Объект);
			
		КонецЕсли;
		
		Объект.ДополнительныеСвойства.Удалить(ИмяСвойстваУдаленияДвижений);
		
		ПроведениеДокументаОтменено = Истина;
		Если ИспользоватьТранзакции Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		
		Если ИспользоватьТранзакции Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ШаблонТекста = НСтр("ru ='При отмене проведения документа:
			|%1
			|перед его повторной загрузкой произошла ошибка:
			|%2. 
			|Проблему можно проигнорировать (скрыть) если документ после загрузки проведен.'");
		ОбработатьИсключение(ИнформацияОбОшибке(), ШаблонТекста);
		
	КонецПопытки;
	
	Возврат ПроведениеДокументаОтменено;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПринудительноеЗавершениеРаботы(КомпонентыОбмена)
	
	//@skip-check undefined-variable
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Если КомпонентыОбмена.ФлагОшибки Или КомпонентыОбмена.ФлагПропустить Тогда
		ВызватьИсключение(НСтр("ru = 'Принудительное завершение работы обработчика обмена.'"),
			КатегорияОшибки.ПринудительноеЗавершениеРаботы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередКонвертацией(КомпонентыОбмена, Источник)
	
	Попытка
		
		Если КомпонентыОбмена.ЭтоМенеджерОбменКФК Тогда
			КомпонентыОбмена.МенеджерОбмена.ПередКонвертацией(КомпонентыОбмена, Источник);
			
		Иначе
			КомпонентыОбмена.МенеджерОбмена.ПередКонвертацией(КомпонентыОбмена);
			
		КонецЕсли;
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), "ПК:ПередКонвертацией");
	КонецПопытки;
	
	ПринудительноеЗавершениеРаботы(КомпонентыОбмена);
	
КонецПроцедуры

Процедура ПослеКонвертации(КомпонентыОбмена, Источник, Результат)
	
	Попытка
		
		Если КомпонентыОбмена.ЭтоМенеджерОбменКФК Тогда
			КомпонентыОбмена.МенеджерОбмена.ПослеКонвертации(КомпонентыОбмена, Источник, Результат);
			
		Иначе
			КомпонентыОбмена.МенеджерОбмена.ПослеКонвертации(КомпонентыОбмена);
			
		КонецЕсли;
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), "ПК:ПослеКонвертации");
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриОбработкеПОД(КомпонентыОбмена, ПравилоОбработки, ИспользованиеПКО, ОбъектОбработки)
	
	Если Не ЗначениеЗаполнено(ПравилоОбработки.ПриОбработке) Тогда
		Возврат;
	КонецЕсли;
		
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ОбъектОбработки",  ОбъектОбработки);
	СтруктураПараметров.Вставить("ИспользованиеПКО", ИспользованиеПКО);
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);

	Попытка
		
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ПравилоОбработки.ПриОбработке, СтруктураПараметров);
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), НСтр("ru = 'ПОД:ПриОбработке'"));
	КонецПопытки;
	
	ОбъектОбработки  = СтруктураПараметров.ОбъектОбработки;
	ИспользованиеПКО = СтруктураПараметров.ИспользованиеПКО;
	КомпонентыОбмена = СтруктураПараметров.КомпонентыОбмена;
	
	ПринудительноеЗавершениеРаботы(КомпонентыОбмена);
	
КонецПроцедуры

Процедура ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, Знач ИмяОбработчика, КомпонентыОбмена, СтекВыгрузки)
		
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ДанныеИБ", ДанныеИБ);
	СтруктураПараметров.Вставить("ДанныеXDTO", ДанныеXDTO);
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	СтруктураПараметров.Вставить("СтекВыгрузки", СтекВыгрузки);

	Попытка
		
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), НСтр("ru = 'ПКО:ПриОтправкеДанных'"));
	КонецПопытки;
	
	ДанныеXDTO       = СтруктураПараметров.ДанныеXDTO;
	КомпонентыОбмена = СтруктураПараметров.КомпонентыОбмена;
	СтекВыгрузки     = СтруктураПараметров.СтекВыгрузки;
	
	ПринудительноеЗавершениеРаботы(КомпонентыОбмена);
	
КонецПроцедуры

Процедура ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена, Знач ИмяОбработчика)
	
	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ДанныеXDTO", ДанныеXDTO);
	СтруктураПараметров.Вставить("ПолученныеДанные", ПолученныеДанные);
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	
	Попытка
		
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), НСтр("ru = 'ПКО:ПриКонвертацииДанныхXDTO'"));
	КонецПопытки;
	
	ДанныеXDTO               = СтруктураПараметров.ДанныеXDTO;
	ПолученныеДанные         = СтруктураПараметров.ПолученныеДанные;
	КомпонентыОбмена         = СтруктураПараметров.КомпонентыОбмена;
	
	ПринудительноеЗавершениеРаботы(КомпонентыОбмена);
	
КонецПроцедуры

Процедура ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КомпонентыОбмена, ИмяОбработчика, КонвертацияСвойств)

	МенеджерОбмена = КомпонентыОбмена.МенеджерОбмена;
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ДанныеИБ", ДанныеИБ);
	СтруктураПараметров.Вставить("ПолученныеДанные", ПолученныеДанные);
	СтруктураПараметров.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	СтруктураПараметров.Вставить("КонвертацияСвойств", КонвертацияСвойств);

	Попытка
		
		МенеджерОбмена.ВыполнитьПроцедуруМодуляМенеджера(ИмяОбработчика, СтруктураПараметров);
		
	Исключение
		ОбработатьИсключениеОбработчика(ИнформацияОбОшибке(), НСтр("ru = 'ПКО:ПередЗаписьюПолученныхДанных'"));
	КонецПопытки;
	
	ДанныеИБ                 = СтруктураПараметров.ДанныеИБ;
	ПолученныеДанные         = СтруктураПараметров.ПолученныеДанные;
	КомпонентыОбмена         = СтруктураПараметров.КомпонентыОбмена;
	КонвертацияСвойств       = СтруктураПараметров.КонвертацияСвойств;
	
	ПринудительноеЗавершениеРаботы(КомпонентыОбмена);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Сбросить результат конвертации.
// 
// Параметры:
//  КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
Процедура СброситьРезультатКонвертации(КомпонентыОбмена)
	
	КомпонентыОбмена.ФлагОшибки = Ложь;
	КомпонентыОбмена.ФлагПропустить = Ложь;
	КомпонентыОбмена.ПротоколКонвертации = Новый Массив;
	
	ПользовательскиеНастройкиКонвертации(КомпонентыОбмена);
		
КонецПроцедуры

Процедура ПолучитьЗначениеВложенныхСвойств(ИсточникСвойства, ВложенныеСвойства, ЗначениеСвойства)
	ТекущийИсточникСвойства = ИсточникСвойства;
	ТекущееЗначениеСвойства = Неопределено;
	Для Уровень = 0 По ВложенныеСвойства.Количество() - 1 Цикл
		Если НЕ ТекущийИсточникСвойства.Свойство(ВложенныеСвойства[Уровень], ТекущееЗначениеСвойства) Тогда
			Прервать;
		КонецЕсли;
		Если Уровень = ВложенныеСвойства.Количество() - 1 Тогда
			ЗначениеСвойства = ТекущееЗначениеСвойства;
		ИначеЕсли ТипЗнч(ТекущееЗначениеСвойства) <> ТипСтруктура() Тогда
			Прервать;
		Иначе
			ТекущийИсточникСвойства = ТекущееЗначениеСвойства;
			ТекущееЗначениеСвойства = Неопределено;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПоместитьЗначениеВложенныхСвойств(ПолучательСвойства, ВложенныеСвойства, ЗначениеСвойства, ЭтоСтрокаТЧ)
	ИмяСвойства = ВложенныеСвойства[0];
	ЗначениеВложенныхСвойств = Неопределено;
	Если ЭтоСтрокаТЧ Тогда
		Если ПолучательСвойства.Владелец().Колонки.Найти(ИмяСвойства) = Неопределено Тогда
			ПолучательСвойства.Владелец().Колонки.Добавить(ИмяСвойства);
		Иначе
			ЗначениеВложенныхСвойств = ПолучательСвойства[ИмяСвойства];
		КонецЕсли;
	Иначе
		Если НЕ ПолучательСвойства.Свойство(ИмяСвойства, ЗначениеВложенныхСвойств) Тогда
			ПолучательСвойства.Вставить(ИмяСвойства);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеВложенныхСвойств = Неопределено Тогда
		ЗначениеВложенныхСвойств = Новый Структура;
	КонецЕсли;
	СтруктураВложенныхСвойств = ЗначениеВложенныхСвойств;
	МаксимальныйУровень = ВложенныеСвойства.Количество() - 1;
	Для Уровень = 1 По МаксимальныйУровень Цикл
		ИмяВложенногоСвойства = ВложенныеСвойства[Уровень];
		Если Уровень = МаксимальныйУровень Тогда
			СтруктураВложенныхСвойств.Вставить(ИмяВложенногоСвойства, ЗначениеСвойства);
			Прервать;
		КонецЕсли;
		ПолучательВложенногоСвойства = Неопределено;
		СтруктураВложенныхСвойств.Свойство(ИмяВложенногоСвойства, ПолучательВложенногоСвойства);
		Если ПолучательВложенногоСвойства = Неопределено Тогда
			ПолучательВложенногоСвойства = Новый Структура;
		КонецЕсли;
		ПолучательВложенногоСвойства.Вставить(ИмяВложенногоСвойства, Новый Структура);
		СтруктураВложенныхСвойств = ПолучательВложенногоСвойства;
	КонецЦикла;
	ПолучательСвойства[ИмяСвойства] = ЗначениеВложенныхСвойств;
КонецПроцедуры

Функция ЭтоБазоваяСхема(Знач КомпонентыОбмена, Знач ПространствоИмен)
	
	Возврат ПустаяСтрока(ПространствоИмен) 
		Или КомпонентыОбмена.БазовыеСхемыФормата.Получить(ПространствоИмен) <> Неопределено;
		
КонецФункции

Функция XMLБазоваяСхема()
	
	Возврат "http://www.1c.ru/SSL/Exchange/Message";
	
КонецФункции

Функция ЭтоСсылкаXDTO(Знач Тип)
	
	Возврат ВРег(Тип.Имя) = "UUID" Или ФабрикаXDTO.Тип(XMLБазоваяСхема(), "Ref").ЭтоПотомок(Тип);
	
КонецФункции

Функция ЭтоТипТаблицыОбъекта(Знач ТипСвойстваXDTO)
	
	Если ТипЗнч(ТипСвойстваXDTO) = Тип("ТипОбъектаXDTO")
		И ТипСвойстваXDTO.Свойства.Количество() = 1 Тогда
		
		Возврат ТипСвойстваXDTO.Свойства[0].ВерхняяГраница <> 1;
		
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Функция НомерВторогоЭтапаКонвертации()
	Возврат 1 + 1;
КонецФункции

Функция КоличествоПолейПоискаДокумента()
	Возврат 1 + 1;
КонецФункции

Функция ЭтоСтандартныйРеквизитОбъектаПолучения(ИмяРеквизита)
	Возврат ИмяРеквизита = "Наименование"
		Или ИмяРеквизита = "Код"
		Или ИмяРеквизита = "ЭтоГруппа"
		Или ИмяРеквизита = "Родитель"
		Или ИмяРеквизита = "Владелец"
		Или ИмяРеквизита = "Дата"
		Или ИмяРеквизита = "Номер";
КонецФункции

Функция ЭтоТаблицаРегистра(ТипТаблицы)
	Возврат ТипТаблицы = "РегистрСведений"
		Или ТипТаблицы = "РегистрНакопления"
		Или ТипТаблицы = "РегистрБухгалтерии"
		Или ТипТаблицы = "РегистрРасчета";
КонецФункции

Функция ЗначениеНеЗаполнено(КомпонентыОбмена, Значение)
	Возврат Значение = Null
		Или Значение = Неопределено
		Или Не (КомпонентыОбмена.ОтключитьПреобразованиеВNull Или ЗначениеЗаполнено(Значение));
КонецФункции

Функция ЗначениеСоответствуетПростомуТипуФормата(Значение, ТипФормата)
	Возврат (ТипЗнч(Значение) = Тип("Строка") И СтрНайти(ТипФормата.Имя, "string") > 0)
		Или (ТипЗнч(Значение) = Тип("Число") И СтрНайти(ТипФормата.Имя, "decimal") > 0)
		Или (ТипЗнч(Значение) = Тип("Булево") И СтрНайти(ТипФормата.Имя, "boolean") > 0)
		Или (ТипЗнч(Значение) = Тип("Дата") И СтрНайти(ТипФормата.Имя, "date") > 0);
КонецФункции

Функция НаправлениеОбменаПолучение()
	Возврат "Получение";
КонецФункции

Функция ТипСтруктура()
	Возврат Тип("Структура");
КонецФункции

Функция ТипОбщегоСоставногоСвойства()
	Возврат "ОбщееСоставноеСвойство";
КонецФункции

Функция ДействиеПолучитьСсылку()
	Возврат "ПолучитьСсылку";
КонецФункции

Функция ДействиеКонвертироватьИЗаписать()
	Возврат "КонвертироватьИЗаписать";
КонецФункции

Функция ВариантИдентификацииСначалаПоУИДПотомПоПолям()
	Возврат "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
КонецФункции

#Область Классы

// Возвращает имя класса общих свойств.
//
// Возвращаемое значение:
//   Строка - имя класса общих свойств.
//
Функция КлассОбщиеСвойства()
	Возврат "ОбщиеСвойства";
КонецФункции

Функция КлассСоставныеСвойства()
	Возврат "СоставныеСвойства";
КонецФункции

Функция КлассПроизвольныеДанные()
	Возврат "ПроизвольныеДанные";
КонецФункции

Функция КлассТаблицаОбъекта()
	Возврат "ТаблицаОбъекта";
КонецФункции

Функция КлассСсылка()
	Возврат "Ссылка";
КонецФункции

Функция КлассСсылкаФормата(КомпонентыОбмена, Свойства)
	
	Если КомпонентыОбмена.ЭтоEnterpriseData Тогда
		Возврат "Ссылка";
		
	ИначеЕсли Свойства = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось определить ключ ссылки формата'");
		
	Иначе
		ПКС = Свойства.Найти(КлассСсылка(), "СвойствоКонфигурации");
		Возврат ?(ПКС = Неопределено Или ПустаяСтрока(ПКС.СвойствоФормата),
			"afabaa4629db4804a2f35446d5befe0b", // заглушка
			ПКС.СвойствоФормата);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПоискПравилОбмена

// ПОД по имени.
// 
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	Имя - Строка - Имя ПОД
// 
// Возвращаемое значение:
//	Неопределено, Структура - Правило обработки данных:
Функция ПОДПоИмени(КомпонентыОбмена, Имя)
	
	Результат = КомпонентыОбмена.ПравилаОбработкиДанных.Найти(Имя, "Имя");
	Если Результат = Неопределено Тогда
		
		ОбъектВыборкиФормата = Неопределено;
		Если КомпонентыОбмена.НаправлениеОбмена = НаправлениеОбменаПолучение()
				И КомпонентыОбмена.ОбъектыВыборкиФормата.Свойство(Имя, ОбъектВыборкиФормата) Тогда
			ШаблонЗаголовка = НСтр("ru = 'В схеме формата обмена отсутствует XDTO!
			|ПОД: %1
			|Формата обмена: %2
			|Тип XDTO: %3'");
			ВызватьИсключение СтрШаблон(ШаблонЗаголовка, Имя, КомпонентыОбмена.XMLСхема, ОбъектВыборкиФормата);
			
		Иначе
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не найдено ПОД с именем %1'"), Имя);
			
		КонецЕсли;
		
	Иначе
		Возврат Результат;
		
	КонецЕсли;

КонецФункции

// ПКО по имени.
// 
// Параметры:
//	КомпонентыОбмена - см. ИнициализироватьКомпонентыОбмена
//	Имя - Строка - Имя ПКО
// 
// Возвращаемое значение:
//	Неопределено, СтрокаТаблицыЗначений - Правило конвертации объекта.
Функция ПКОПоИмени(КомпонентыОбмена, Имя)
	
	Результат = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти(Имя, "ИмяПКО");
	Если Результат = Неопределено Тогда
		
		ОбъектФормата = Неопределено;
		Если КомпонентыОбмена.ОбъектыФормата.Свойство(Имя, ОбъектФормата) Тогда
			ШаблонЗаголовка = НСтр("ru = 'В схеме формата обмена отсутствует XDTO!
			|ПКО: %1
			|Формата обмена: %2
			|Тип XDTO: %3'");
			ВызватьИсключение СтрШаблон(ШаблонЗаголовка, Имя, КомпонентыОбмена.XMLСхема, ОбъектФормата);
			
		Иначе
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не найдено ПКО с именем %1'"), Имя);
			
		КонецЕсли;
		
	Иначе
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
