///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Задание = кфкФоновыеОперацииСлужебный.РегламентноеЗадание();
	
	Идентификатор = Задание.УникальныйИдентификатор;
	Наименование = Задание.Наименование;
//	Использование = Задание.Использование;
	ИмяПользователя = Задание.ИмяПользователя;
	Если Не ПустаяСтрока(Задание.ИмяПользователя) Тогда
		Пользователь = Пользователи.НайтиПоИмени(Задание.ИмяПользователя);
	КонецЕсли;
	Расписание = Задание.Расписание;
	ПредставлениеРасписания = Строка(Задание.Расписание);
	КоличествоПовторовПриАварийномЗавершении = Задание.КоличествоПовторовПриАварийномЗавершении;
	ИнтервалПовтораПриАварийномЗавершении = Задание.ИнтервалПовтораПриАварийномЗавершении;
	
	ПоследнееФЗ = Задание.ПоследнееЗадание;
	Если Не ПоследнееФЗ = Неопределено Тогда
		
		ПоследнееЗаданиеСостояние = Строка(ПоследнееФЗ.Состояние);
		ПоследнееЗаданиеНачало = ПоследнееФЗ.Начало;
		ПоследнееЗаданиеКонец = ПоследнееФЗ.Конец;
		
		Если Не ПоследнееФЗ.ИнформацияОбОшибке = Неопределено Тогда
			ПоследнееЗаданиеТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ПоследнееФЗ.ИнформацияОбОшибке);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область РегламентноеЗадание

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	УстановитьСвойствоРегламентногоЗаданияНаСервере(Идентификатор, "Наименование", Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		Отказ = Ложь;
		ИмяПользователя = ПолучитьИмяПользователя(Пользователь, Отказ);
		Если Отказ Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Пользователь ИБ не существует!'"), , , "Пользователь");
			Возврат;
		КонецЕсли;
		
	Иначе
		ИмяПользователя = "";
		
	КонецЕсли;
	
	УстановитьСвойствоРегламентногоЗаданияНаСервере(Идентификатор, "ИмяПользователя", ИмяПользователя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРасписанияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("ДиалогРасписанияЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПовторовПриАварийномЗавершенииПриИзменении(Элемент)
	
	УстановитьСвойствоРегламентногоЗаданияНаСервере(Идентификатор, "КоличествоПовторовПриАварийномЗавершении", КоличествоПовторовПриАварийномЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалПовтораПриАварийномЗавершенииПриИзменении(Элемент)
	
	УстановитьСвойствоРегламентногоЗаданияНаСервере(Идентификатор, "ИнтервалПовтораПриАварийномЗавершении", ИнтервалПовтораПриАварийномЗавершении);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Навигация

&НаКлиенте
Процедура ПерейтиОсновное(Команда)
	ВладелецФормы.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиФоновыеЗадания(Команда)
	ОткрытьСтраницу("ФоновыеЗадания");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиОчереди(Команда)
	ОткрытьСтраницу("Очереди");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиЛогирование(Команда)
	ОткрытьСтраницу("Логирование");
КонецПроцедуры

#КонецОбласти

#Область РегламентноеЗадание

&НаКлиенте
Процедура ИспользоватьРегламентноеЗадание(Команда)
	
	//@skip-check property-return-type
	Значение = Не ВладелецФормы.ИспользоватьРегламентноеЗадание;
	//@skip-check property-return-type
	ВладелецФормы.ИспользоватьРегламентноеЗадание = Значение;
	УстановитьСвойствоРегламентногоЗаданияНаСервере(Идентификатор, "Использование", Значение);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	//@skip-check dynamic-access-method-not-found
	ВладелецФормы.УстановитьВидимостьДоступность();
	
	// НАВИГАЦИЯ
	Элементы.ПерейтиФоновыеЗадания.Картинка = ВладелецФормы.Элементы.ПерейтиФоновыеЗадания.Картинка;
	Элементы.ПерейтиРегламентноеЗаданиеСтатус.Картинка = ВладелецФормы.Элементы.ПерейтиРегламентноеЗадание.Картинка;
	
	// РЕГЛАМЕНТНОЕ ЗАДАНИЕ
	//@skip-check property-return-type
	Использовать = ВладелецФормы.ИспользоватьРегламентноеЗадание; // Булево
	Элементы.ГруппаСвойстваРегламентногоЗадания.Доступность = Использовать;
	Элементы.ИспользоватьРегламентноеЗадание.Пометка = Использовать;
	
КонецПроцедуры

#Область Навигация

&НаКлиенте
Процедура ОткрытьСтраницу(ИмяСтраницы)
	
	ОткрытьФорму("Обработка.кфкПанельАдминистрирования.Форма." + ИмяСтраницы, , ВладелецФормы, , ВладелецФормы.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область РегламентноеЗадание

// Диалог расписания завершение.
// 
// Параметры:
//  Результат - РасписаниеРегламентногоЗадания - Расписание
//  ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ДиалогРасписанияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСвойствоРегламентногоЗаданияНаСервере(Идентификатор, "Расписание", Результат);
	
	Расписание = Результат;
	ПредставлениеРасписания = Строка(Расписание);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСвойствоРегламентногоЗаданияНаСервере(Идентификатор, ИмяСвойства, Значение)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	Задание[ИмяСвойства] = Значение;
	Задание.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяПользователя(Пользователь, Отказ)
	
	Результат = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	//@skip-check bsl-legacy-check-string-literal
	ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"); // УникальныйИдентификатор
	Если ИдентификаторПользователяИБ = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
		Отказ = Истина;
		
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если ПользовательИБ = Неопределено Тогда
			Отказ = Истина;
			
		Иначе
			Результат = ПользовательИБ.Имя;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
