///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

#Область Метаданные

// Проверка того, что переданное значение является ссылочным типом данных.
// Для типа Неопределено возвращается Ложь.
//
// Замеры:
//	* ОбщегоНазначения.ЭтоСсылка - Длительность = 0.014с, Среднее = 0.000014с
//	* кфкОбщегоНазначенияСлужебный.ЭтоСсылка - Длительность = 0.008с, Среднее = 0.000008с
//	
// Параметры:
//  Значение - Произвольный - для проверки на ссылочный тип данных.
//
// Возвращаемое значение:
//  Булево - Истина, если это ссылка.
//
Функция ЭтоСсылка(Значение) Экспорт
	
	ТипXML = СериализаторXDTO.XMLТипЗнч(Значение);
	Возврат ТипXML <> Неопределено И СтрНайти(ТипXML.ИмяТипа, "Ref.") > 0;
	
КонецФункции

// Создать набор записей.
// 
// Параметры:
//  Менеджер - РегистрСведенийМенеджер - Менеджер
// 
// Возвращаемое значение:
//  РегистрСведенийНаборЗаписейИмяРегистраСведений - Набор записей
Функция СоздатьНаборЗаписей(Менеджер) Экспорт
	
	НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
	кфкИнтеграция.Отключить(НаборЗаписей);
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Возврат НаборЗаписей;
	
КонецФункции

// Возвращает ключи регистра на основе переданного объекта метаданных.
//
// Параметры:
//   ОбъектМД - ОбъектМетаданныхРегистрСведений - объект метаданных, для которого необходимо получить ключи регистра
//
// Возвращаемое значение:
//   Массив Из Строка - ключи регистра
Функция КлючиРегистра(ОбъектМД) Экспорт
	
	Результат = Новый Массив; // Массив Из Строка
	
	// Периодичность
	Если ОбъектМД.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		Результат.Добавить(ОбъектМД.СтандартныеРеквизиты.Период.Имя);
	КонецЕсли;
	
	// Регистратор
	Если ОбъектМД.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
		Результат.Добавить(ОбъектМД.СтандартныеРеквизиты.Регистратор.Имя);
	КонецЕсли;
	
	// Измерения
	Для Каждого Измерение Из ОбъектМД.Измерения Цикл
		Результат.Добавить(Измерение.Имя);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Данные

// Создает массив и копирует в него значения, содержащиеся в колонке выборке запроса.
// 
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса - Выборка, колонку которой нужно выгрузить в массив.
//  ИмяКолонки - Строка - имя поля коллекции, значения которого нужно выгрузить.
//  ТолькоУникальныеЗначения - Булево - если Истина, то в массив будут включены только различающиеся значения.
// 
// Возвращаемое значение:
//  Массив Из Произвольный - значения колонки.
Функция ВыбратьКолонку(Выборка, ИмяКолонки, ТолькоУникальныеЗначения = Ложь) Экспорт

	Результат = Новый Массив; // Массив Из Произвольный
	
	Пока Выборка.Следующий() Цикл
		
		Значение = Выборка[ИмяКолонки]; // Произвольный
				
		Если ТолькоУникальныеЗначения Тогда
			
			Если Результат.Найти(Значение) = Неопределено Тогда
				//@skip-check typed-value-adding-to-untyped-collection
				Результат.Добавить(Значение);
			КонецЕсли;
			
		Иначе
			//@skip-check typed-value-adding-to-untyped-collection
			Результат.Добавить(Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СериализацияХранилища

// Помещает произвольное значение в ХранилищеЗначения.
// 
// Параметры:
//  Значение - Произвольный - Значение
// 
// Возвращаемое значение:
//  ХранилищеЗначения - Значение хранилище
Функция ЗначениеВХранилище(Значение) Экспорт
	Возврат Новый ХранилищеЗначения(ОбщегоНазначения.ЗначениеВСтрокуXML(Значение), Новый СжатиеДанных(9));
КонецФункции

// Получает произвольное значение из ХранилищеЗначения.
// 
// Параметры:
//  ДанныеХранилища - ХранилищеЗначения - Хранилище значения
// 
// Возвращаемое значение:
//  Неопределено, Произвольный - Значение из хранилища
Функция ЗначениеИзХранилища(ДанныеХранилища) Экспорт
	
	Данные = ДанныеХранилища.Получить();
	Если Данные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаXML = Строка(Данные);
	Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаXML);
	
КонецФункции

#КонецОбласти

#Область ПриведениеЗначения

// Преобразует дату в строку в соответствии с заданным форматом.
//
// Параметры:
//   Значение - Дата - Дата, которую необходимо преобразовать в строку
//   ВариантЗаписи - ВариантЗаписиДатыJSON - Вариант записи даты в формате JSON
//   ЗначениеПустойДаты - Строка - Значение, которое возвращается, если дата пустая (по умолчанию: "")
//
// Возвращаемое значение:
//   Строка - Представление даты в строковом формате
Функция ДатаВСтроку(Значение, ВариантЗаписи, ЗначениеПустойДаты = "") Экспорт
	
	Если Значение = Дата(1, 1, 1) Тогда
		Возврат ЗначениеПустойДаты;
		
	Иначе
		Возврат ЗаписатьДатуJSON(Значение, ФорматДатыJSON.ISO, ВариантЗаписи);
	КонецЕсли;
	
КонецФункции

// Преобразует дату в формате миллисекунд с начала Unix-эпохи в строку в формате ISO с миллисекундами.
//
// Параметры:
//   Значение - Число - Дата в формате миллисекунд с начала Unix-эпохи.
//   ЗначениеПустойДаты - Строка - Значение, которое возвращается, если дата пустая (по умолчанию: "")
//
// Возвращаемое значение:
//   Строка - Дата в формате ISO с миллисекундами
Функция ДатаМсВСтроку(Значение, ЗначениеПустойДаты = "") Экспорт
	
	Если Значение = 0 Тогда
		Возврат ЗначениеПустойДаты;
	КонецЕсли;
	
	Секунды = Цел(Значение / 1000);
	Возврат ЗаписатьДатуJSON(Дата(1, 1, 1) + Секунды, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата)
		+ "." + СтрЗаменить(XMLСтрока(Значение - Секунды * 1000), ".", "") + "Z";
	
КонецФункции

#КонецОбласти

#Область СериализацияJSON

// Преобразует значение в строку JSON при помощи метода глобального контекста ЗаписатьJSON.
// Допускаются не все типы значений, подробности см. в синтакс-помощнике.
// Даты преобразуются в формат ISO (YYYY-MM-DDThh:mm:ssZ).
// 
// Параметры:
//  Значение - Произвольный
//
// Возвращаемое значение:
//  Строка
//
Функция ЗначениеВJSON(Знач Значение) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, Значение, , "ПреобразованиеЗначенияВJSON", кфкОбщегоНазначенияСлужебный); 
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Функция вызывается для всех свойств, тип которых не поддерживает преобразование в формат JSON напрямую, см. ЗначениеВJSON
// 
// Параметры:
//  Свойство - Строка - Имя свойства, если выполняется запись структуры или соответствия;
//  Значение - Произвольный - Исходное значение;
//  ДополнительныеПараметры - Произвольный - Дополнительные параметры, которые указаны в вызове метода ЗаписатьJSON;
//  Отказ - Булево - Отказ от записи свойства.
// 
// Возвращаемое значение:
//	Строка, Неопределено - Значение 
Функция ПреобразованиеЗначенияВJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Если Значение = NULL Тогда 
		Возврат Неопределено;
		
	ИначеЕсли ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Или ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Значение)) Тогда
		Возврат XMLСтрока(Значение);
		
	Иначе
		Возврат Значение;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РаботаСАрхивами

// Выполняет чтение данных из архива GZip.
//
// Параметры:
//	СжатыеДанные - ДвоичныеДанные - данные упакованные GZip.
//
// Возвращаемое значение:
//	ДвоичныеДанные - распакованные данные.
//
Функция ПрочитатьGZip(СжатыеДанные) Экспорт

	РазмерПрефиксаGZip = 10;
	РазмерПостфиксаGZip = 8;

	ЧтениеДанных = Новый ЧтениеДанных(СжатыеДанные);
	ЧтениеДанных.Пропустить(РазмерПрефиксаGZip);
	РазмерСжатыхДанных = ЧтениеДанных.ИсходныйПоток().Размер() - РазмерПрефиксаGZip - РазмерПостфиксаGZip;

	ПотокZip = Новый ПотокВПамяти(ZipРазмерLFH() + РазмерСжатыхДанных + ZipРазмерDD() + ZipРазмерCDH() + ZipРазмерEOCD());
	ЗаписьДанных = Новый ЗаписьДанных(ПотокZip);
	ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(ZipLFH());
	ЧтениеДанных.КопироватьВ(ЗаписьДанных, РазмерСжатыхДанных);

	ЗаписьДанных.Закрыть();
	ЗаписьДанных = Новый ЗаписьДанных(ПотокZip);

	CRC32 = ЧтениеДанных.ПрочитатьЦелое32();
	РазмерНесжатыхДанных = ЧтениеДанных.ПрочитатьЦелое32();
	ЧтениеДанных.Закрыть();

	ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(ZipDD(CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных));
	ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(ZipCDH(CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных));
	ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(ZipEOCD(РазмерСжатыхДанных));
	ЗаписьДанных.Закрыть();

	Возврат ПрочитатьZip(ПотокZip);

КонецФункции

// Выполняет запись данных в архив GZip.
//
// Параметры:
//	Данные - ДвоичныеДанные - исходные данные.
//
// Возвращаемое значение:
//	ДвоичныеДанные - данные упакованные GZip.
//
Функция ЗаписатьGZip(Данные) Экспорт

	ЧтениеДанных = Новый ЧтениеДанных(ЗаписатьZip(Данные));

	НачальноеСмещение = 14;
	ЧтениеДанных.Пропустить(НачальноеСмещение);
	CRC32 = ЧтениеДанных.ПрочитатьЦелое32();

	РазмерСжатыхДанных = ЧтениеДанных.ПрочитатьЦелое32();
	РазмерИсходныхДанных = ЧтениеДанных.ПрочитатьЦелое32();

	РазмерИмениФайла = ЧтениеДанных.ПрочитатьЦелое16();
	РазмерДополнительногоПоля = ЧтениеДанных.ПрочитатьЦелое16();
	ЧтениеДанных.Пропустить(РазмерИмениФайла + РазмерДополнительногоПоля);

	ПотокGZip = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(ПотокGZip);
	ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(GZipHeader());
	ЧтениеДанных.КопироватьВ(ЗаписьДанных, РазмерСжатыхДанных);
	ЗаписьДанных.Закрыть();
	ЗаписьДанных = Новый ЗаписьДанных(ПотокGZip);

	ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(GZipFooter(CRC32, РазмерИсходныхДанных));

	Возврат ПотокGZip.ЗакрытьИПолучитьДвоичныеДанные();

КонецФункции

#КонецОбласти

#Область Прочее

// Проверяет, является ли текущий пользователь полноправным
// 
// Возвращаемое значение:
//  Булево - Это полноправный пользователь
Функция ЭтоПолноправныйПользователь() Экспорт
	
	Возврат Пользователи.ЭтоПолноправныйПользователь(, Истина) Или Пользователи.РолиДоступны("кфкПолныеПрава");
	
КонецФункции

// Версия подсистемы.
// 
// Возвращаемое значение:
//  Строка - Версия подсистемы
Функция ВерсияПодсистемы() Экспорт
	Возврат "9.9.9.9";
КонецФункции

// Возвращает имя подсистемы 'Адаптер Kafka'
// 
// Возвращаемое значение:
//	Строка - Имя подсистемы
Функция ИмяПодсистемы() Экспорт
	Возврат НСтр("ru = 'Адаптер Kafka'");
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КодированиеДекодированиеДанных

Функция ПрочитатьZip(СжатыеДанные, ТекстОшибки = Неопределено)

#Если МобильноеПриложениеСервер Тогда
	ВызватьИсключение(НСтр("ru = 'Работа с Zip-файлами в мобильной платформе не поддерживается'"));
#Иначе
	
	Каталог = ПолучитьИмяВременногоФайла();
	ЧтениеZip = Новый ЧтениеZipФайла(СжатыеДанные);
	ИмяФайла = ЧтениеZip.Элементы[0].Имя;
	Попытка
		ЧтениеZip.Извлечь(ЧтениеZip.Элементы[0], Каталог, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	Исключение
		// Игнорируем проверку целостности архива, просто читаем результат
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	ЧтениеZip.Закрыть();

	Результат = Новый ДвоичныеДанные(Каталог + ПолучитьРазделительПути() + ИмяФайла);
	УдалитьФайлы(Каталог);

	Возврат Результат;
	
#КонецЕсли

КонецФункции

Функция ЗаписатьZip(Данные)

#Если МобильноеПриложениеСервер Тогда
	ВызватьИсключение(НСтр("ru = 'Работа с Zip-файлами в мобильной платформе не поддерживается'"));
#Иначе
	
	ВременныйФайл = ПолучитьИмяВременногоФайла(".bin");
	Данные.Записать(ВременныйФайл);
	ПотокZip = Новый ПотокВПамяти;
	ЗаписьZip = Новый ЗаписьZipФайла(ПотокZip);
	ЗаписьZip.Добавить(ВременныйФайл);
	ЗаписьZip.Записать();
	УдалитьФайлы(ВременныйФайл);

	Возврат ПотокZip.ЗакрытьИПолучитьДвоичныеДанные();
	
#КонецЕсли

КонецФункции

#Область СлужебныеСтруктурыZip

// Описание структур см. здесь https://pkware.cachefly.net/webdocs/casestudies/APPNOTE.TXT

Функция ZipРазмерLFH()

	Возврат 34;

КонецФункции

Функция ZipРазмерDD()

	Возврат 16;

КонецФункции

Функция ZipРазмерCDH()

	Возврат 50;

КонецФункции

Функция ZipРазмерEOCD()

	Возврат 22;

КонецФункции

Функция ZipLFH()

	// Local file header
	Буфер = Новый БуферДвоичныхДанных(ZipРазмерLFH());
	Буфер.ЗаписатьЦелое32(0, 67324752); // signature 0x04034b50
	Буфер.ЗаписатьЦелое16(4, 20);       // version
	Буфер.ЗаписатьЦелое16(6, 10);       // bit flags
	Буфер.ЗаписатьЦелое16(8, 8);        // compression method
	Буфер.ЗаписатьЦелое16(10, 0);       // time
	Буфер.ЗаписатьЦелое16(12, 0);       // date
	Буфер.ЗаписатьЦелое32(14, 0);       // crc-32
	Буфер.ЗаписатьЦелое32(18, 0);       // compressed size
	Буфер.ЗаписатьЦелое32(22, 0);       // uncompressed size
	Буфер.ЗаписатьЦелое16(26, 4);       // filename legth - "data"
	Буфер.ЗаписатьЦелое16(28, 0);       // extra field length
	Буфер.Записать(30, ПолучитьБуферДвоичныхДанныхИзСтроки("data", "ascii", Ложь));

	Возврат Буфер;

КонецФункции

Функция ZipDD(CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных)

	// Data descriptor
	Буфер = Новый БуферДвоичныхДанных(ZipРазмерDD());
	Буфер.ЗаписатьЦелое32(0, 134695760);
	Буфер.ЗаписатьЦелое32(4, CRC32);
	Буфер.ЗаписатьЦелое32(8, РазмерСжатыхДанных);
	Буфер.ЗаписатьЦелое32(12, РазмерНесжатыхДанных);

	Возврат Буфер;

КонецФункции

Функция ZipCDH(CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных)

	// Central directory header
	Буфер = Новый БуферДвоичныхДанных(ZipРазмерCDH());
	Буфер.ЗаписатьЦелое32(0, 33639248);              // signature 0x02014b50
	Буфер.ЗаписатьЦелое16(4, 798);                   // version made by
	Буфер.ЗаписатьЦелое16(6, 20);                    // version needed to extract
	Буфер.ЗаписатьЦелое16(8, 10);                    // bit flags
	Буфер.ЗаписатьЦелое16(10, 8);                    // compression method
	Буфер.ЗаписатьЦелое16(12, 0);                    // time
	Буфер.ЗаписатьЦелое16(14, 0);                    // date
	Буфер.ЗаписатьЦелое32(16, CRC32);                // crc-32
	Буфер.ЗаписатьЦелое32(20, РазмерСжатыхДанных);   // compressed size
	Буфер.ЗаписатьЦелое32(24, РазмерНесжатыхДанных); // uncompressed size
	Буфер.ЗаписатьЦелое16(28, 4);                    // file name length
	Буфер.ЗаписатьЦелое16(30, 0);                    // extra field length
	Буфер.ЗаписатьЦелое16(32, 0);                    // file comment length
	Буфер.ЗаписатьЦелое16(34, 0);                    // disk number start
	Буфер.ЗаписатьЦелое16(36, 0);                    // internal file attributes
	Буфер.ЗаписатьЦелое32(38, 2176057344);           // external file attributes
	Буфер.ЗаписатьЦелое32(42, 0);                    // relative offset of local header
	Буфер.Записать(46, ПолучитьБуферДвоичныхДанныхИзСтроки("data", "ascii", Ложь));

	Возврат Буфер;

КонецФункции

Функция ZipEOCD(РазмерСжатыхДанных)

	// End of central directory
	РазмерCDH = 50;
	Буфер = Новый БуферДвоичныхДанных(ZipРазмерEOCD());
	Буфер.ЗаписатьЦелое32(0, 101010256); // signature 0x06054b50
	Буфер.ЗаписатьЦелое16(4, 0); // number of this disk
	Буфер.ЗаписатьЦелое16(6, 0); // number of the disk with the start of the central directory
	Буфер.ЗаписатьЦелое16(8, 1); // total number of entries in the central directory on this disk
	Буфер.ЗаписатьЦелое16(10, 1); // total number of entries in the central directory
	Буфер.ЗаписатьЦелое32(12, РазмерCDH); // size of the central directory
	// offset of start of central directory with respect to the starting disk number
	Буфер.ЗаписатьЦелое32(16, ZipРазмерLFH() + РазмерСжатыхДанных + ZipРазмерDD());
	Буфер.ЗаписатьЦелое16(20, 0); // the starting disk number

	Возврат Буфер;

КонецФункции

#КонецОбласти

#Область СлужебныеСтруктурыGZip

// Описание структур см. здесь https://www.ietf.org/rfc/rfc1952.txt

Функция GZipРазмерHeader()

	Возврат 10;

КонецФункции

Функция GZipРазмерFooter()

	Возврат 8;

КонецФункции

Функция GZipHeader()

	Буфер = Новый БуферДвоичныхДанных(GZipРазмерHeader());
	Буфер[0] = 31;               // ID1 0x1f
	Буфер[1] = 139;              // ID2 0x8b
	Буфер[2] = 8;                // compression method (08 for DEFLATE)
	Буфер[3] = 0;                // header flags
	Буфер.ЗаписатьЦелое32(4, 0); // timestamp
	Буфер[8] = 0;                // compression flags
	Буфер[9] = 255;              // operating system ID

	Возврат Буфер;

КонецФункции

Функция GZipFooter(CRC32, РазмерИсходныхДанных)

	Буфер = Новый БуферДвоичныхДанных(GZipРазмерFooter());
	Буфер.ЗаписатьЦелое32(0, CRC32);
	Буфер.ЗаписатьЦелое32(4, РазмерИсходныхДанных);

	Возврат Буфер;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
