// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Регистрация ссылочного типа.
// 
// Параметры:
//  ОписаниеЗапроса - Структура - Описание запроса:
//	 * Текст - Строка - Текст запроса
//	 * Параметры - Структура - Параметры запроса
//	Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер
//	ПолучитьОбъект - Булево - Получить объект ссылочного типа
Процедура ВыполнитьРегистрациюСсылочногоТипа(ОписаниеЗапроса, Продюсер, ПолучитьОбъект) Экспорт
	
	Счетчик = 0;
	МаксРазмерПорции = кфкОбработкаСобытийСлужебный.МаксРазмерПорцииРегистрации();
	ПараметрыРегистрации = кфкОбработкаСобытийСлужебный.ПараметрыРегистрации(Продюсер, Истина);
	СобытиеРегистрации = Перечисления.кфкСобытияРегистрации.Принудительно;
	
	Выборка = ВыборкаДанныхСсылочногоТипа(ОписаниеЗапроса);
	
	ПараметрыПрогресса = НачалоПрогресса(Выборка.Количество());
	ОбработатьИтерациюПрогресса(ПараметрыПрогресса, 0); // старт
	Пока Выборка.Следующий() Цикл
		
		Счетчик = Счетчик + 1;
		
		ОбъектРегистрации = ?(ПолучитьОбъект, Выборка.Ссылка.ПолучитьОбъект(), Выборка.Ссылка);
		кфкОбработкаСобытийСлужебный.ПоместитьВОчередьИсходящих(ОбъектРегистрации, СобытиеРегистрации, "", Ложь, ПараметрыРегистрации);
		
		Если Счетчик >= МаксРазмерПорции Тогда // порционная запись
			кфкОбработкаСобытийСлужебный.ЗавершитьРегистрацию(ПараметрыРегистрации, Истина);
			ОбработатьИтерациюПрогресса(ПараметрыПрогресса, Счетчик);
			Счетчик = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Счетчик > 0 Тогда
		кфкОбработкаСобытийСлужебный.ЗавершитьРегистрацию(ПараметрыРегистрации);
	КонецЕсли;
	ЗавершитьПрогресс(ПараметрыПрогресса, Счетчик);
	
КонецПроцедуры

// Выполнить регистрацию регистра.
// 
// Параметры:
//  ОписаниеЗапроса - Структура - Описание запроса:
//	 * Текст - Строка - Текст запроса
//	 * Параметры - Структура - Параметры запроса
//	Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер
//	ПолноеИмя - Строка - Полное имя объекта регистрации
Процедура ВыполнитьРегистрациюРегистра(ОписаниеЗапроса, Продюсер, ПолноеИмя) Экспорт
	
	Счетчик = 0;
	МаксРазмерПорции = кфкОбработкаСобытийСлужебный.МаксРазмерПорцииРегистрации();
	ПараметрыРегистрации = кфкОбработкаСобытийСлужебный.ПараметрыРегистрации(Продюсер, Истина);
	СобытиеРегистрации = Перечисления.кфкСобытияРегистрации.Принудительно;
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
	Выборка = ВыборкаДанныхРегистра(ОписаниеЗапроса);
	
	ПараметрыПрогресса = НачалоПрогресса(Выборка.Количество());
	ОбработатьИтерациюПрогресса(ПараметрыПрогресса, 0); // старт
	Пока Выборка.Следующий() Цикл
		
		Счетчик = Счетчик + 1;
		
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		
		Если Счетчик >= МаксРазмерПорции Тогда // порционная запись
			кфкОбработкаСобытийСлужебный.ПоместитьВОчередьИсходящих(НаборЗаписей, СобытиеРегистрации, "", Ложь, ПараметрыРегистрации);
			кфкОбработкаСобытийСлужебный.ЗавершитьРегистрацию(ПараметрыРегистрации, Истина);
			ОбработатьИтерациюПрогресса(ПараметрыПрогресса, Счетчик);
			НаборЗаписей.Очистить();
			Счетчик = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Счетчик > 0 Тогда
		кфкОбработкаСобытийСлужебный.ПоместитьВОчередьИсходящих(НаборЗаписей, СобытиеРегистрации, "", Ложь, ПараметрыРегистрации);
		кфкОбработкаСобытийСлужебный.ЗавершитьРегистрацию(ПараметрыРегистрации);
	КонецЕсли;
	ЗавершитьПрогресс(ПараметрыПрогресса, Счетчик);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выборка данных ссылочного типа.
// 
// Параметры:
//  ОписаниеЗапроса - Структура - Описание запроса:
//	 * Текст - Строка - Текст запроса
//	 * Параметры - Структура - Параметры запроса 
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка данных ссылочного типа:
//	 * Ссылка - ЛюбаяСсылка - Ссылка на объект регистрации
Функция ВыборкаДанныхСсылочногоТипа(ОписаниеЗапроса)
	
	Запрос = СформироватьЗапрос(ОписаниеЗапроса);
	
	Возврат Запрос.Выполнить().Выбрать(); // TODO: ВыбратьПоСсылкам - возвращает объекты, но на практике прироста нет
	
КонецФункции

// Выборка данных регистра.
// 
// Параметры:
//  ОписаниеЗапроса - Структура - Описание запроса:
//	 * Текст - Строка - Текст запроса
//	 * Параметры - Структура - Параметры запроса
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка данных регистра
Функция ВыборкаДанныхРегистра(ОписаниеЗапроса)
	
	Запрос = СформироватьЗапрос(ОписаниеЗапроса);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция СформироватьЗапрос(ОписаниеЗапроса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ОписаниеЗапроса.Текст;
	Для Каждого Параметр Из ОписаниеЗапроса.Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Возврат Запрос;
	
КонецФункции

// Начало прогресса.
// 
// Параметры:
//  Количество - Число - Количество
// 
// Возвращаемое значение:
// 	Структура - Начало прогресса:
//	 * Начало - Дата - Начало
//	 * Процент - Число - Процент
//	 * Количество - Число - Количество
//	 * Обработано - Число - Обработано
//	 * ПиковаяСкорость - Число - Пиковая скорость
Функция НачалоПрогресса(Количество)
	
	Результат = Новый Структура;
	Результат.Вставить("Начало", ТекущаяУниверсальнаяДата());
	Результат.Вставить("Процент", -1);
	Результат.Вставить("Количество", Количество);
	Результат.Вставить("Обработано", 0);
	Результат.Вставить("ПиковаяСкорость", 0);
	
	Возврат Результат;
	
КонецФункции

// Обработать итерацию прогресса.
// 
// Параметры:
//  Параметры - Структура - Параметры:
//	 * Начало - Дата - Начало
//	 * Процент - Число - Процент
//	 * Количество - Число - Количество
//	 * Обработано - Число - Обработано
//	 * ПиковаяСкорость - Число - Пиковая скорость
//  Количество - Число - Количество
Процедура ОбработатьИтерациюПрогресса(Параметры, Количество = 1)
	
	Параметры.Обработано = Параметры.Обработано + Количество;
	
	Процент = ?(Параметры.Количество > 0, Окр(Параметры.Обработано / Параметры.Количество * 100, 2), 0);
	
	Если Параметры.Процент < Процент Тогда
		
		Прошло = ТекущаяУниверсальнаяДата() - Параметры.Начало; // Число
		СредняяСкорость = ?(Прошло > 0, Окр(Параметры.Обработано / Прошло, 2), 0);
		ОставшеесяВремя = ?(СредняяСкорость > 0, Окр((Параметры.Количество - Параметры.Обработано) / СредняяСкорость, 0), 0); // Число 
		
		Параметры.Процент = Процент;
		Параметры.ПиковаяСкорость = Макс(Параметры.ПиковаяСкорость, СредняяСкорость);
		
		// Зарегистрировано
		Шаблон = НСтр("ru = 'Зарегистрировано: %1 из %2'");
		ТекстСообщения = СтрШаблон(Шаблон, Параметры.Обработано, Параметры.Количество);
		// Скорость
		Если Параметры.ПиковаяСкорость > 0 Тогда
			Шаблон = НСтр("ru = 'Скорость: %1 записей/сек (пиковая: %2)'");
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон(Шаблон, СредняяСкорость, Параметры.ПиковаяСкорость);
		КонецЕсли;
		// Время
		Если Прошло > 0 Или ОставшеесяВремя > 0 Тогда
			Шаблон = НСтр("ru = 'Время: прошло %1,
				|       осталось ~ %2'");
			ТекстСообщения = ТекстСообщения + Символы.ПС
				+ СтрШаблон(Шаблон, ПредставлениеВремени(Прошло), ПредставлениеВремени(ОставшеесяВремя));
		КонецЕсли;
		
		ДлительныеОперации.СообщитьПрогресс(Параметры.Процент, ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

// Завершить прогресс.
// 
// Параметры:
// Параметры:
//  Параметры - Структура - Параметры:
//	 * Начало - Дата - Начало
//	 * Процент - Число - Процент
//	 * Количество - Число - Количество
//	 * Обработано - Число - Обработано
//	 * ПиковаяСкорость - Число - Пиковая скорость
//  Количество - Число - Количество
Процедура ЗавершитьПрогресс(Параметры, Количество)
	
	ОбработатьИтерациюПрогресса(Параметры, Количество);
	
	Если Параметры.Обработано > кфкОбработкаСобытийСлужебный.МаксРазмерПорцииРегистрации() Тогда // Макс+1
		
		Прошло = ТекущаяУниверсальнаяДата() - Параметры.Начало; // Число
		СредняяСкорость = ?(Прошло > 0, Окр(Параметры.Обработано / Прошло, 2), 0);
		
		ШаблонСообщения = НСтр("ru = 'Зарегистрировано: %1
							   |Скорость: %2 записей/сек (пиковая: %3)
							   |Затраченное время: %4'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения,
			Параметры.Обработано, // Зарегистрировано
			СредняяСкорость, Параметры.ПиковаяСкорость, // Скорость
			ПредставлениеВремени(Прошло)); // Время
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает текстовое представление интервала времени, заданного в секундах.
//
// Параметры:
//
//  Время - Число - интервал времени в секундах.
//
//  ПолноеПредставление	- Булево - кратное или полное представление времени.
//		Например, интервал 1 000 000 секунд:
//		1) полное представление:  11 дней 13 часов 46 минут 40 секунд;
//		2) краткое представление: 11 дней 13 часов.
//  
//  ВыводитьСекунды - Булево - Ложь, если секунды не требуются.
//  
// Возвращаемое значение:
//   Строка - представление интервала времени.
//
Функция ПредставлениеВремени(Знач Время, ПолноеПредставление = Истина, ВыводитьСекунды = Истина)
	Результат = "";
	
	Если Время = 0 Тогда
		Возврат НСтр("ru = '<1 сек'");
	КонецЕсли;
	
	// Представление единиц измерения времени в винительном падеже для количеств: 1, 2-4, 5-20.
	ПредставлениеНедель = НСтр("ru = ';%1 неделю;;%1 недели;%1 недель;%1 недели'");
	ПредставлениеДней   = НСтр("ru = ';%1 день;;%1 дня;%1 дней;%1 дня'");
	ПредставлениеЧасов  = НСтр("ru = ';%1 час;;%1 часа;%1 часов;%1 часа'");
	ПредставлениеМинут  = НСтр("ru = ';%1 минуту;;%1 минуты;%1 минут;%1 минуты'");
	ПредставлениеСекунд = НСтр("ru = ';%1 секунду;;%1 секунды;%1 секунд;%1 секунды'");
	
	Если Время < 0 Тогда
		Время = -Время;
	КонецЕсли;
	
	КоличествоНедель = Цел(Время / 60/60/24/7);
	КоличествоДней   = Цел(Время / 60/60/24);
	КоличествоЧасов  = Цел(Время / 60/60);
	КоличествоМинут  = Цел(Время / 60);
	КоличествоСекунд = Цел(Время);
	
	КоличествоСекунд = КоличествоСекунд - КоличествоМинут * 60;
	КоличествоМинут  = КоличествоМинут - КоличествоЧасов * 60;
	КоличествоЧасов  = КоличествоЧасов - КоличествоДней * 24;
	КоличествоДней   = КоличествоДней - КоличествоНедель * 7;
	
	Если Не ВыводитьСекунды Тогда
		КоличествоСекунд = 0;
	КонецЕсли;
	
	Если КоличествоНедель > 0 И КоличествоДней+КоличествоЧасов+КоличествоМинут+КоличествоСекунд=0 Тогда
		Результат = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеНедель, КоличествоНедель);
	Иначе
		КоличествоДней = КоличествоДней + КоличествоНедель * 7;
		
		Счетчик = 0;
		Если КоличествоДней > 0 Тогда
			Результат = Результат + СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеДней, КоличествоДней) + " ";
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		Если КоличествоЧасов > 0 Тогда
			Результат = Результат + СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеЧасов, КоличествоЧасов) + " ";
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		Если (ПолноеПредставление Или Счетчик < 2) И КоличествоМинут > 0 Или Время = 0 И Не ВыводитьСекунды Тогда
			Результат = Результат + СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеМинут, КоличествоМинут) + " ";
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		Если ВыводитьСекунды И (ПолноеПредставление Или Счетчик < 2) И (КоличествоСекунд > 0 Или КоличествоНедель+КоличествоДней+КоличествоЧасов+КоличествоМинут = 0) Тогда
			Результат = Результат + СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеСекунд, КоличествоСекунд);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СокрП(Результат);
	
КонецФункции

#КонецОбласти

#КонецЕсли
