///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

#Область УправлениеФЗ

// Запустить интеграцию kafka.
Процедура ЗапуститьРегламентноеЗадание() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.кфкЗапускИнтеграции);
	
	ЗапуститьПотоки = ПолучитьФункциональнуюОпцию("кфкИспользоватьИнтеграцию")
		И Не ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции");
	
	Если ЗапуститьПотоки Тогда
		ЗапуститьПотоки();
	КонецЕсли;
	
КонецПроцедуры

// Получить потоки.
// 
// Параметры:
//  Состояние - Неопределено, СостояниеФоновогоЗадания - Состояние
// 
// Возвращаемое значение:
//  Массив Из ФоновоеЗадание - Потоки
Функция ПолучитьПотоки(Состояние = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", "");
	Если Состояние <> Неопределено Тогда
		Отбор.Вставить("Состояние", Состояние);
	КонецЕсли;
	
	Для Каждого Элемент Из СписокВсехОпераций() Цикл
		
		// Однопоточный режим
		Отбор.ИмяМетода = ИмяМетодаПотока(Элемент.Значение);
		Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, Задания);
		
		// Многопоточный режим
		Отбор.ИмяМетода = Отбор.ИмяМетода + "ВПотоке";
		Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, Задания);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Регламентное задание.
// 
// Возвращаемое значение:
//  РегламентноеЗадание - Регламентное задание
Функция РегламентноеЗадание() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектМД = Метаданные.РегламентныеЗадания.кфкЗапускИнтеграции;
	Задания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные", ОбъектМД));
	Если Задания.Количество() Тогда
		Задание = Задания[0];
	Иначе
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(ОбъектМД);
		Задание.Использование = Ложь;
		Задание.Записать();
		
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

// Запустить потоки интеграции
Процедура ЗапуститьПотоки() Экспорт
	
	// Для запуска служебных операций
	ЕстьВходящийПоток = Ложь;
	ЕстьИсходящийПоток = Ложь;
	
	// ИсходящиеСообщения & ВходящиеСообщения
	Таблица = ТаблицаРаспределенияПотоков();
	ДиспетчерыЗадач = Таблица.Скопировать(, "Ссылка,Представление,ПодпотокиОбработки,ПодпотокиТранспорта");
	ДиспетчерыЗадач.Свернуть("Ссылка,Представление,ПодпотокиОбработки,ПодпотокиТранспорта");
	Для Каждого ДиспетчерЗадач Из ДиспетчерыЗадач Цикл
		
		ТипНаправления = ТипЗнч(ДиспетчерЗадач.Ссылка);
		
		НастройкиОбработки = Новый Массив; // Массив Из СправочникСсылка.кфкПродюсеры, СправочникСсылка.кфкКонсьюмеры
		НастройкиТранспорта = Новый Массив; // Массив Из СправочникСсылка.кфкПродюсеры, СправочникСсылка.кфкКонсьюмеры
		Для Каждого Строка Из Таблица.НайтиСтроки(Новый Структура("Ссылка", ДиспетчерЗадач.Ссылка)) Цикл
			
			Если Не Строка.БлокироватьОбработку Тогда
				НастройкиОбработки.Добавить(Строка.Настройка);
			КонецЕсли;
			
			Если Не Строка.БлокироватьТранспорт Тогда
				НастройкиТранспорта.Добавить(Строка.Настройка);
			КонецЕсли;
			
		КонецЦикла;
		
		Стратегия = НоваяСтратегияРаспределения();
		ЗаполнитьЗначенияСвойств(Стратегия, ДиспетчерЗадач);
		
		ПараметрыЗадания = Новый Массив(4);
		ПараметрыЗадания[0] = Новый Структура;
		ПараметрыЗадания[1] = Новый Массив; // Массив Из СправочникСсылка.кфкПродюсеры, СправочникСсылка.кфкКонсьюмеры - Список продюсеров или консьюмеров
		ПараметрыЗадания[2] = Стратегия; // Структура - Стратегия распределения очереди по потокам, см. НоваяСтратегияРаспределения
		ПараметрыЗадания[3] = Ложь; // Булево - Интерактивный режим (из формы элемента продюсера).
		
		Для Каждого Элемент Из СписокОперацийОбмена(ТипНаправления) Цикл
			
			Настройки = ?(Элемент.Пометка, НастройкиТранспорта, НастройкиОбработки);
			Если Настройки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Ключ = КлючЗадания(Элемент.Значение, ДиспетчерЗадач.Ссылка);
			Наименование = ПредставлениеЗадания(Элемент.Представление, ДиспетчерЗадач.Представление);
			ИмяМетода = ИмяМетодаПотока(Элемент.Значение);
			
			ПараметрыЗадания[0] = Новый Структура("Ключ, Наименование, ИмяМетода", Ключ, Наименование, ИмяМетода);
			ПараметрыЗадания[1] = Настройки;
			
			ЗапуститьФЗ(Ключ, ИмяМетода, Наименование, ПараметрыЗадания);
			
			// Определяем необходимость запуска служебных потоков
			Если ТипНаправления = Тип("СправочникСсылка.кфкПродюсеры") Тогда
				ЕстьИсходящийПоток = Истина;
			ИначеЕсли ТипНаправления = Тип("СправочникСсылка.кфкКонсьюмеры") Тогда
				ЕстьВходящийПоток = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Служебные
	Для Каждого Элемент Из СписокСлужебныхОпераций(ЕстьИсходящийПоток, ЕстьВходящийПоток) Цикл
		ЗапуститьФЗ(
			КлючЗадания(Элемент.Значение),
			ИмяМетодаПотока(Элемент.Значение),
			ПредставлениеЗадания(Элемент.Представление));
	КонецЦикла;
	
КонецПроцедуры

// Запустить поток в интерактивном режиме.
// 
// Параметры:
//  Настройка - СправочникСсылка.кфкПродюсеры, СправочникСсылка.кфкКонсьюмеры - Настройка
//  ЭтоОбработка - Булево - Истина обработка, иначе транспорт
//  Идентификатор - УникальныйИдентификатор - Идентификатор формы
// 
// Возвращаемое значение:
//  Структура - параметры выполнения задания, см. ДлительныеОперации.ВыполнитьПроцедуру.
Функция ЗапуститьПотокИнтерактивно(Настройка, ЭтоОбработка, Идентификатор) Экспорт
	
	ТНастройка = ТипЗнч(Настройка);
	ШаблонОперации = ?(ЭтоОбработка, ОписаниеОперацииОбработки(ТНастройка), ОписаниеОперацииТранспорта(ТНастройка));
	
	Ключ = КлючЗадания(ШаблонОперации.Имя, НСтр("ru = 'РучнойРежим'"));
	Наименование = ПредставлениеЗадания(ШаблонОперации.Синоним, НСтр("ru = 'Ручной режим'"));
	ИмяМетода = ИмяМетодаПотока(ШаблонОперации.Имя);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(Идентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Наименование;
	ПараметрыВыполнения.КлючФоновогоЗадания = Ключ;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.СРасширениямиБазыДанных = Истина;
	
	Операция = Новый Структура("Ключ, Наименование, ИмяМетода", Ключ, Наименование, ИмяМетода);
	
	Результат = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		Операция.ИмяМетода,
		Операция, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Настройка), НоваяСтратегияРаспределения(), Истина);
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ФоновыеОперации

#Область СериализацияСообщений

// Сериализация сообщений
// 
// Параметры:
//  Операция - Структура - Описание операции обмена, см. ОписаниеОперацииОбмена
//  Продюсеры - Массив Из СправочникСсылка.кфкПродюсеры - Список продюсеров
//  СтратегияРаспределения - Структура - Стратегия распределения очереди по потокам, см. НоваяСтратегияРаспределения:
//	 * ПодпотокиОбработки - Число - Допустимое число вложенных потоков обработки
//	 * МинРазмерПакета - Число - Минимальный количество сообщений в очереди потока
//	 * МаксРазмерПакета - Число - Максимальное количество сообщений в очереди потока
//	ИнтерактивныйРежим - Булево - Интерактивный режим (из формы элемента продюсера).
Процедура СериализацияСообщений(Операция, Продюсеры, СтратегияРаспределения, ИнтерактивныйРежим = Ложь) Экспорт
	
	// многопоточность
	Потоки = Новый Массив; // Массив Из УникальныйИдентификатор
	// стратегия распределения
	МинРазмерПакета = СтратегияРаспределения.МинРазмерПакета;
	МаксРазмерПакета = СтратегияРаспределения.МаксРазмерПакета;
	ПодпотокиОбработки = СтратегияРаспределения.ПодпотокиОбработки;
	МаксРазмерВыборки = МаксРазмерПакета * ПодпотокиОбработки;
	// указатели
	Указатели = ПустаяТаблицаУказателейПотоков();
	ИДОперации = ИДОперации_УказательСериализацииСообщений();
	РазделОперации = ПолучитьРазделОперации(Продюсеры);
	УказательНачалаВыборки = ПолучитьПозицию(ИДОперации, РазделОперации.Значение);
	// обработка
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкОчередьПотоков); // РегистрСведенийНаборЗаписей.кфкОчередьПотоков
	Правила = Справочники.кфкПродюсеры.ПравилаСериализации(Продюсеры);
	
	Активен = Истина;
	Пока Активен Цикл //@skip-check query-in-loop
		
		УказательПустойВыборки = УказательПустойВыборки();
		Выборка = ВыборкаСериализацииСообщений(Продюсеры, МаксРазмерВыборки, УказательНачалаВыборки);
		Если Выборка.Количество() = 0 Тогда
			Если Не ИнтерактивныйРежим И ПолучитьФункциональнуюОпцию("кфкИспользоватьПотоковыйРежим") Тогда
				АктуализироватьПотоки(Потоки);
				ОбновитьСтатусУказателей(Указатели, Потоки);
				ВызватьПаузу(5000);
				
			ИначеЕсли Указатели.Количество() = 0 Тогда
				Активен = Ложь;
				
			Иначе
				ОжидатьЗавершенияПотоков(Потоки);
				ЗафиксироватьУказатели(Указатели, Потоки);
				
			КонецЕсли;
			
		Иначе
			РазмерПакета = Макс(Мин(Цел(Выборка.Количество() / ПодпотокиОбработки), МаксРазмерПакета), МинРазмерПакета);
			
			ДоступныеПотоки = ОжидатьСвободныеПотоки(Операция, Потоки, ПодпотокиОбработки, Правила);
			ЗафиксироватьУказатели(Указатели, ДоступныеПотоки);
			
			ИндексПотока = 0;
			ИдентификаторПотока = ДоступныеПотоки[ИндексПотока];
			
			Счетчик = 0;
			МеткаИзмененияМС = 0;
			Пока Выборка.Следующий() Цикл
				Счетчик = Счетчик + 1;
				МеткаИзмененияМС = Выборка.МеткаИзмененияМС;
				
				НоваяСтрока = Очередь.Добавить();
				НоваяСтрока.Ключ = Выборка.КлючЗаписи;
				НоваяСтрока.ВременнаяМетка = Выборка.ДатаРегистрацииМС;
				НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
				
				Если Счетчик >= РазмерПакета Тогда
					Счетчик = 0;
					
					Очередь.Записать(РежимЗамещения.Добавление);
					ДобавитьУказательПотока(Указатели, ИдентификаторПотока, МеткаИзмененияМС);
					Очередь.Очистить();
					
					Если ИндексПотока < ДоступныеПотоки.ВГраница() Тогда
						ИндексПотока = ИндексПотока + 1;
						
					Иначе
						ИндексПотока = 0;
						ДоступныеПотоки = ОжидатьСвободныеПотоки(Операция, Потоки, ПодпотокиОбработки, Правила);
						ЗафиксироватьУказатели(Указатели, ДоступныеПотоки);
						
					КонецЕсли;
					ИдентификаторПотока = ДоступныеПотоки[ИндексПотока];
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Очередь.Количество() Тогда
				Очередь.Записать(РежимЗамещения.Добавление);
				ДобавитьУказательПотока(Указатели, ИдентификаторПотока, МеткаИзмененияМС);
				Очередь.Очистить();
			КонецЕсли;
			
		КонецЕсли;
		
		Если Активен И ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			Активен = Ложь;
			ОжидатьЗавершенияПотоков(Потоки);
			ЗафиксироватьУказатели(Указатели, Потоки);
		КонецЕсли;
		
		ОбновитьУказательНачалаВыборки(УказательНачалаВыборки, Указатели, УказательПустойВыборки, Потоки, ИДОперации,
			РазделОперации);
		
	КонецЦикла;
	
	ЗавершитьПотоки(Потоки);
	
КонецПроцедуры

// Сериализация сообщений в потоке.
// 
// Параметры:
//  Правила - Соответствие Из Строка - см. Справочники.кфкПродюсеры.ПравилаСериализации
Процедура СериализацияСообщенийВПотоке(Правила) Экспорт
	
	ИдентификаторПотока = ТекущийПоток().УникальныйИдентификатор;
	ПустойЗапрос = Дата(3999, 12, 31);
	Очереди = ОчередиИсходящих();
	МаксРазмерПакета = НоваяСтратегияРаспределения().МаксРазмерПакета;
	
	Пока Истина Цикл
		
		Если ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			ОчиститьОчередьПотоков(ИдентификаторПотока);
			Прервать;
		КонецЕсли;
		
		Выборка = ВыборкаСериализацияСообщенийВПотоке(ИдентификаторПотока, МаксРазмерПакета);
		Если Выборка.Количество() = 0 Тогда
			ПустойЗапрос = Мин(ПустойЗапрос, ТекущаяУниверсальнаяДата());
			Если ПустойЗапрос > ТекущаяУниверсальнаяДата() - ТаймаутПростояПотока() Тогда
				ВызватьПаузу(5000);
			Иначе
				Прервать;
			КонецЕсли;
			
		Иначе
			ПустойЗапрос = Дата(3999, 12, 31);
			
			ОбработчикСериализацииСообщений(Выборка, Очереди, ИдентификаторПотока, Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Сериализация сообщения.
// 
// Параметры:
//	Сообщение - Структура, РегистрСведенийКлючЗаписи.кфкИсходящиеСообщения - Сообщение:
//	 * КлючЗаписи - Строка - Ключ записи
//	 * ДатаРегистрацииМС - Число - Дата регистрации в миллисекундах
Процедура СериализацияСообщения(Сообщение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.ДатаРегистрацииМС КАК ДатаРегистрацииМС,
	|	Т.ИсходныеДанные КАК ИсходныеДанные,
	|	Т.ЭтоУдаление КАК ЭтоУдаление,
	|	Т.Продюсер КАК Продюсер,
	|	Т.ТипОбъект КАК ТипОбъект,
	|	Т.ТипИсходныхДанных КАК ТипИсходныхДанных,
	|	Т.КлючОбъекта КАК КлючОбъекта,
	|	Т.СобытиеРегистрации КАК СобытиеРегистрации,
	|	Т.ДатаРегистрации КАК ДатаРегистрации,
	|	Т.ДатаОбработки КАК ДатаОбработки,
	|	Т.ТекстЖурнала КАК ТекстЖурнала,
	|	Т.КоличествоОбработок КАК КоличествоОбработок,
	|	Т.КоличествоВыгрузок КАК КоличествоВыгрузок
	|ИЗ
	|	РегистрСведений.кфкИсходящиеСообщения КАК Т
	|ГДЕ
	|	Т.КлючЗаписи = &КлючЗаписи
	|	И Т.ДатаРегистрацииМС = &ДатаРегистрацииМС
	|	И НЕ 0 В
	|		(ВЫБРАТЬ
	|			0
	|		ИЗ
	|			РегистрСведений.кфкОчередьПотоков КАК ОП
	|		ГДЕ
	|			ОП.Ключ = Т.КлючЗаписи)";
	Запрос.УстановитьПараметр("КлючЗаписи", Сообщение.КлючЗаписи);
	Запрос.УстановитьПараметр("ДатаРегистрацииМС", Сообщение.ДатаРегистрацииМС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		//@skip-check bsl-legacy-check-string-literal
		Правила = Справочники.кфкПродюсеры.ПравилаСериализации(Выборка["Продюсер"]);
		
		Выборка.Сбросить();
		ОбработчикСериализацииСообщений(Выборка, ОчередиИсходящих(), "СЕРИАЛИЗАЦИЯ-СООБЩЕНИЯ", Правила);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаСообщений

// Отправка сообщений в kafka.
// 
// Параметры:
//  Операция - Структура - Описание операции обмена, см. ОписаниеОперацииОбмена
//	Продюсеры - Массив Из СправочникСсылка.кфкПродюсеры - Список продюсеров
//	СтратегияРаспределения - Структура - Стратегия распределения очереди по потокам, см. НоваяСтратегияРаспределения:
//	 * ПодпотокиТранспорта - Число - Допустимое число вложенных потоков обработки
//	 * МинРазмерПакета - Число - Минимальный количество сообщений в очереди потока
//	 * МаксРазмерПакета - Число - Максимальное количество сообщений в очереди потока
//	ИнтерактивныйРежим - Булево - Интерактивный режим (из формы элемента продюсера).
Процедура ОтправкаСообщенийВKafka(Операция, Продюсеры, СтратегияРаспределения, ИнтерактивныйРежим = Ложь) Экспорт
	
	// многопоточность
	Потоки = Новый Массив; // Массив Из УникальныйИдентификатор
	// стратегия распределения
	МинРазмерПакета = СтратегияРаспределения.МинРазмерПакета;
	МаксРазмерПакета = СтратегияРаспределения.МаксРазмерПакета * 10;
	ПодпотокиТранспорта = СтратегияРаспределения.ПодпотокиТранспорта;
	МаксРазмерВыборки = МаксРазмерПакета * ПодпотокиТранспорта;
	// указатели
	Указатели = ПустаяТаблицаУказателейПотоков();
	ИДОперации = ИДОперации_УказательОтправкиИсходящихСообщений();
	РазделОперации = ПолучитьРазделОперации(Продюсеры);
	УказательНачалаВыборки = ПолучитьПозицию(ИДОперации, РазделОперации.Значение);
	// обработка
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкОчередьПотоков); // РегистрСведенийНаборЗаписей.кфкОчередьПотоков
	ПараметрыПотока = Новый Массив(2);
	ПараметрыПотока[0] = Справочники.кфкПродюсеры.Топики(Продюсеры);
	ПараметрыПотока[1] = ИспользоватьПакетнуюПубликацию(Продюсеры);
	
	Активен = Истина;
	Пока Активен Цикл //@skip-check query-in-loop
		
		УказательПустойВыборки = УказательПустойВыборки();
		Выборка = ВыборкаОтправкиИсходящихСообщений(Продюсеры, МаксРазмерВыборки, УказательНачалаВыборки);
		Если Выборка.Количество() = 0 Тогда
			Если Не ИнтерактивныйРежим И ПолучитьФункциональнуюОпцию("кфкИспользоватьПотоковыйРежим") Тогда
				АктуализироватьПотоки(Потоки);
				ОбновитьСтатусУказателей(Указатели, Потоки);
				ВызватьПаузу(5000);
				
			ИначеЕсли Указатели.Количество() = 0 Тогда
				Активен = Ложь;
				
			Иначе
				ОжидатьЗавершенияПотоков(Потоки);
				ЗафиксироватьУказатели(Указатели, Потоки);
				
			КонецЕсли;
			
		Иначе
			РазмерПакета = Макс(Мин(Цел(Выборка.Количество() / ПодпотокиТранспорта), МаксРазмерПакета), МинРазмерПакета);
			
			ДоступныеПотоки = ОжидатьСвободныеПотоки(Операция, Потоки, ПодпотокиТранспорта, ПараметрыПотока);
			ЗафиксироватьУказатели(Указатели, ДоступныеПотоки);
			
			ИндексПотока = 0;
			ИдентификаторПотока = ДоступныеПотоки[ИндексПотока];
			
			Счетчик = 0;
			МеткаИзмененияМС = 0;
			Пока Выборка.Следующий() Цикл
				Счетчик = Счетчик + 1;
				МеткаИзмененияМС = Выборка.МеткаИзмененияМС;
				
				НоваяСтрока = Очередь.Добавить();
				НоваяСтрока.Ключ = Выборка.КлючЗаписи;
				НоваяСтрока.ВременнаяМетка = Выборка.ДатаРегистрацииМС;
				НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
				
				Если Счетчик >= РазмерПакета Тогда
					Счетчик = 0;
					
					Очередь.Записать(РежимЗамещения.Добавление);
					ДобавитьУказательПотока(Указатели, ИдентификаторПотока, МеткаИзмененияМС);
					Очередь.Очистить();
					
					Если ИндексПотока < ДоступныеПотоки.ВГраница() Тогда
						ИндексПотока = ИндексПотока + 1;
						
					Иначе
						ИндексПотока = 0;
						ДоступныеПотоки = ОжидатьСвободныеПотоки(Операция, Потоки, ПодпотокиТранспорта, ПараметрыПотока);
						ЗафиксироватьУказатели(Указатели, ДоступныеПотоки);
						
					КонецЕсли;
					ИдентификаторПотока = ДоступныеПотоки[ИндексПотока];
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Очередь.Количество() Тогда
				Очередь.Записать(РежимЗамещения.Добавление);
				ДобавитьУказательПотока(Указатели, ИдентификаторПотока, МеткаИзмененияМС);
				Очередь.Очистить();
			КонецЕсли;
			
		КонецЕсли;
		
		Если Активен И ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			Активен = Ложь;
			ОжидатьЗавершенияПотоков(Потоки);
			ЗафиксироватьУказатели(Указатели, Потоки);
		КонецЕсли;
		
		ОбновитьУказательНачалаВыборки(УказательНачалаВыборки, Указатели, УказательПустойВыборки, Потоки, ИДОперации,
			РазделОперации);
		
	КонецЦикла;
	
	ЗавершитьПотоки(Потоки);
	
КонецПроцедуры

// Отправка сообщений в kafka в потоке.
// 
// Параметры:
//	Топики - Соответствие Из Строка - см. Справочники.кфкПродюсеры.Топики
//	ПакетнаяПубликация - Булево - Использовать пакетную публикацию
Процедура ОтправкаСообщенийВKafkaВПотоке(Топики, ПакетнаяПубликация) Экспорт
	
	ИдентификаторПотока = ТекущийПоток().УникальныйИдентификатор;
	ПустойЗапрос = Дата(3999, 12, 31);
	Сессии = Новый Соответствие;
	Очереди = ОчередиИсходящих();
	МаксРазмерПакета = НоваяСтратегияРаспределения().МаксРазмерПакета;
	
	Пока Истина Цикл
		
		Если ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			ОчиститьОчередьПотоков(ИдентификаторПотока);
			Прервать;
		КонецЕсли;
		
		Выборка = ВыборкаОтправкиИсходящихСообщенийВПотоке(ИдентификаторПотока, МаксРазмерПакета, ПакетнаяПубликация);
		Если Выборка.Количество() = 0 Тогда
			ПустойЗапрос = Мин(ПустойЗапрос, ТекущаяУниверсальнаяДата());
			Если ПустойЗапрос > ТекущаяУниверсальнаяДата() - ТаймаутПростояПотока() Тогда
				ВызватьПаузу(5000);
			Иначе
				Прервать;
			КонецЕсли;
			
		Иначе
			ПустойЗапрос = Дата(3999, 12, 31);
			
			Если ПакетнаяПубликация Тогда
				Пока Выборка.Следующий() Цикл
					ВыборкаТ = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); // уровень ТипОбъект
					Пока ВыборкаТ.Следующий() Цикл
						ИмяТопика = Топики.Получить(НРег(XMLСтрока(ВыборкаТ.Продюсер) + ВыборкаТ.ТипОбъект)); // Строка
						ОбработчикОтправкиПакетИсходящихСообщений(ВыборкаТ.Выбрать(), Сессии, Очереди,
							ИдентификаторПотока, ВыборкаТ.Продюсер, ИмяТопика);
					КонецЦикла;
				КонецЦикла;
				
			Иначе
				ОбработчикОтправкиИсходящихСообщений(Выборка, Сессии, Очереди, ИдентификаторПотока, Топики);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	кфкИнтеграцияСлужебный.ЗакрытьСессииПродюсера(Сессии);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаСообщений

// Загрузка сообщений из kafka.
// 
// Параметры:
//	Операция - Структура - Описание операции обмена, см. ОписаниеОперацииОбмена
//	Консьюмеры - Массив Из СправочникСсылка.кфкКонсьюмеры - Список консьюмеров
//	СтратегияРаспределения - Структура - Стратегия распределения очереди по потокам, см. НоваяСтратегияРаспределения:
//	 * ПодпотокиТранспорта - Число - Допустимое число вложенных потоков обработки
//	 * МинРазмерПакета - Число - Минимальный количество сообщений в очереди потока
//	 * МаксРазмерПакета - Число - Максимальное количество сообщений в очереди потока
//	ИнтерактивныйРежим - Булево - Интерактивный режим (из формы элемента консьюмера).
Процедура ЗагрузкаСообщенийИзKafka(Операция, Консьюмеры, СтратегияРаспределения, ИнтерактивныйРежим = Ложь) Экспорт
	
	// многопоточность
	Потоки = Новый Массив; // Массив Из УникальныйИдентификатор
	КЭШ = Новый Структура;
	
	// обработка
	Очередь1 = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкОчередьПотоков); // РегистрСведенийНаборЗаписей.кфкОчередьПотоков
	Очередь2 = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкОчередьПотоков); // РегистрСведенийНаборЗаписей.кфкОчередьПотоков
	ОчередьПотоков = ОчередьПотоковЗагрузкиСообщений();
	
	Пока Истина Цикл //@skip-check query-in-loop
		
		СостояниеОчереди = 0;
		Распределение = ТаблицаРаспределенияЧтенияКонсьюмеров(Консьюмеры, СтратегияРаспределения, СостояниеОчереди, КЭШ);
		Распределение.Сортировать("НомерПотока Убыв");
		МаксНомерПотока = ?(Распределение.Количество() = 0, 0, Распределение[0].НомерПотока);
		Если МаксНомерПотока = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось определить количество потоков для чтения сообщений Kafka'");
			
		ИначеЕсли СостояниеОчереди = 0
				И (ИнтерактивныйРежим Или Не ПолучитьФункциональнуюОпцию("кфкИспользоватьПотоковыйРежим")) Тогда
			Прервать;
			
		КонецЕсли;
		// Добавление новых потоков (если необходимо)
		Если Потоки.Количество() < МаксНомерПотока Тогда
			Для НомерПотока = 1 По МаксНомерПотока Цикл
				Задание = ЗапуститьПоток(Операция, НомерПотока);
				Если Потоки.Найти(Задание.УникальныйИдентификатор) = Неопределено Тогда // если новый поток
					// добавляем в список потоков
					Потоки.Вставить(НомерПотока-1, Задание.УникальныйИдентификатор);
					// добавляем команду
					Очередь1.Очистить();
					Очередь1.Отбор.Сбросить();
					Очередь1.Отбор.ИдентификаторПотока.Установить(Задание.УникальныйИдентификатор);
					НоваяСтрока = Очередь1.Добавить();
					НоваяСтрока.Ключ = КомандаЗагрузкаСообщенийАктивно();
					НоваяСтрока.ВременнаяМетка = ТекущаяУниверсальнаяДатаВМиллисекундах();
					НоваяСтрока.ИдентификаторПотока = Задание.УникальныйИдентификатор;
					Очередь1.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Передача распределения в потоки и удаление лишних потоков
		ОбновитьРаспределениеКонсьюмеров(Распределение, Потоки, Очередь1, Очередь2, ОчередьПотоков);
		
		Если ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			Прервать;
		КонецЕсли;
		
		ВызватьПаузу(5000);
		
		АктуализироватьПотоки(Потоки);
		
	КонецЦикла;
	
	ЗавершитьПотоки(Потоки, Ложь);
	
КонецПроцедуры

// Загрузка сообщений из kafka в потоке.
Процедура ЗагрузкаСообщенийИзKafkaВПотоке() Экспорт
	
	ИдентификаторПотока = ТекущийПоток().УникальныйИдентификатор;
	РазмерПакета = НоваяСтратегияРаспределения().МаксРазмерПакета;
	Сессии = Новый Соответствие;
	
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкВходящиеСообщения); // РегистрСведенийНаборЗаписей.кфкВходящиеСообщения
	
	БезРаспределения = Дата(3999, 12, 31);
	БлокироватьЗавершенияДо = ТекущаяУниверсальнаяДата() + 60; // первую минуту блокируем завершение
	
	// получаем команду о запуске
	ЕстьКоманда = ЕстьКомандаЗагрузкиСообщений(ИдентификаторПотока);
	
	//@skip-check query-in-loop
	Пока ЕстьКоманда Или БлокироватьЗавершенияДо > ТекущаяУниверсальнаяДата() Цикл
		
		Консьюмеры = КонсьюмерыЗагрузкиСообщений(ИдентификаторПотока);
		ЗакрытьСессииКонсьюмераПараллельногоПотока(Сессии, Консьюмеры);
		Если Консьюмеры.Количество() = 0 Тогда
			БезРаспределения = Мин(БезРаспределения, ТекущаяУниверсальнаяДата());
			Если БезРаспределения > ТекущаяУниверсальнаяДата() - ТаймаутПростояПотока() Тогда
				ВызватьПаузу(5000);
			Иначе
				Прервать;
			КонецЕсли;
			
		Иначе
			БезРаспределения = Дата(3999, 12, 31);
			
			Загружено = Ложь;
			ОбработчикЗагрузкиПакетСообщений(Консьюмеры, Сессии, Очередь, РазмерПакета, Загружено);
			Если Не Загружено Тогда
				ВызватьПаузу(5000);
			КонецЕсли;;
			
		КонецЕсли;
		
		ЕстьКоманда = ЕстьКомандаЗагрузкиСообщений(ИдентификаторПотока); // выполяем пока команду не удалили
		
	КонецЦикла;
	
	кфкИнтеграцияСлужебный.ЗакрытьСессииКонсьюмера(Сессии);
	
КонецПроцедуры

#КонецОбласти

#Область ДесериализацияСообщений

// Десериализация сообщений.
// 
// Параметры:
//  Операция - Структура - Описание операции обмена, см. ОписаниеОперацииОбмена
//  Консьюмеры - Массив Из СправочникСсылка.кфкКонсьюмеры - Список консьюмеров
//  СтратегияРаспределения - Структура - Стратегия распределения очереди по потокам, см. НоваяСтратегияРаспределения:
//	 * ПодпотокиОбработки - Число - Допустимое число вложенных потоков обработки
//	 * МинРазмерПакета - Число - Минимальный количество сообщений в очереди потока
//	 * МаксРазмерПакета - Число - Максимальное количество сообщений в очереди потока
//	ИнтерактивныйРежим - Булево - Интерактивный режим (из формы элемента консьюмера).
Процедура ДесериализацияСообщений(Операция, Консьюмеры, СтратегияРаспределения, ИнтерактивныйРежим = Ложь) Экспорт
	
	// многопоточность
	Потоки = Новый Массив; // Массив Из УникальныйИдентификатор
	// стратегия распределения
	МинРазмерПакета = СтратегияРаспределения.МинРазмерПакета;
	МаксРазмерПакета = СтратегияРаспределения.МаксРазмерПакета;
	ПодпотокиОбработки = СтратегияРаспределения.ПодпотокиОбработки;
	МаксРазмерВыборки = МаксРазмерПакета * ПодпотокиОбработки;
	// указатели
	Указатели = ПустаяТаблицаУказателейПотоков();
	ИДОперации = ИДОперации_УказательДесериализацииСообщений();
	РазделОперации = ПолучитьРазделОперации(Консьюмеры);
	УказательНачалаВыборки = ПолучитьПозицию(ИДОперации, РазделОперации.Значение);
	// обработка
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкОчередьПотоков); // РегистрСведенийНаборЗаписей.кфкОчередьПотоков
	Правила = Справочники.кфкКонсьюмеры.ПравилаДесериализации(Консьюмеры);
	
	Активен = Истина;
	Пока Активен Цикл //@skip-check query-in-loop
		
		УказательПустойВыборки = УказательПустойВыборки();
		Выборка = ВыборкаДесериализацииСообщений(Консьюмеры, МаксРазмерВыборки, УказательНачалаВыборки);
		Если Выборка.Количество() = 0 Тогда
			Если Не ИнтерактивныйРежим И ПолучитьФункциональнуюОпцию("кфкИспользоватьПотоковыйРежим") Тогда
				АктуализироватьПотоки(Потоки);
				ОбновитьСтатусУказателей(Указатели, Потоки);
				ВызватьПаузу(5000);
				
			ИначеЕсли Указатели.Количество() = 0 Тогда
				Активен = Ложь;
				
			Иначе
				ОжидатьЗавершенияПотоков(Потоки);
				ЗафиксироватьУказатели(Указатели, Потоки);
				
			КонецЕсли;
			
		Иначе
			РазмерПакета = Макс(Мин(Цел(Выборка.Количество() / ПодпотокиОбработки), МаксРазмерПакета), МинРазмерПакета);
			
			ДоступныеПотоки = ОжидатьСвободныеПотоки(Операция, Потоки, ПодпотокиОбработки, Правила);
			ЗафиксироватьУказатели(Указатели, ДоступныеПотоки);
			
			ИндексПотока = 0;
			ИдентификаторПотока = ДоступныеПотоки[ИндексПотока];
			
			Счетчик = 0;
			МеткаИзмененияМС = 0;
			Пока Выборка.Следующий() Цикл
				Счетчик = Счетчик + 1;
				МеткаИзмененияМС = Выборка.МеткаИзмененияМС;
				
				НоваяСтрока = Очередь.Добавить();
				НоваяСтрока.Ключ = Выборка.КлючЗаписи;
				НоваяСтрока.ВременнаяМетка = Выборка.ДатаЗагрузкиМС;
				НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
				
				Если Счетчик >= РазмерПакета Тогда
					Счетчик = 0;
					
					Очередь.Записать(РежимЗамещения.Добавление);
					ДобавитьУказательПотока(Указатели, ИдентификаторПотока, МеткаИзмененияМС);
					Очередь.Очистить();
					
					Если ИндексПотока < ДоступныеПотоки.ВГраница() Тогда
						ИндексПотока = ИндексПотока + 1;
						
					Иначе
						ИндексПотока = 0;
						ДоступныеПотоки = ОжидатьСвободныеПотоки(Операция, Потоки, ПодпотокиОбработки, Правила);
						ЗафиксироватьУказатели(Указатели, ДоступныеПотоки);
						
					КонецЕсли;
					ИдентификаторПотока = ДоступныеПотоки[ИндексПотока];
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Очередь.Количество() Тогда
				Очередь.Записать(РежимЗамещения.Добавление);
				ДобавитьУказательПотока(Указатели, ИдентификаторПотока, МеткаИзмененияМС);
				Очередь.Очистить();
			КонецЕсли;
			
		КонецЕсли;
		
		Если Активен И ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			Активен = Ложь;
			ОжидатьЗавершенияПотоков(Потоки);
			ЗафиксироватьУказатели(Указатели, Потоки);
		КонецЕсли;
		
		ОбновитьУказательНачалаВыборки(УказательНачалаВыборки, Указатели, УказательПустойВыборки, Потоки, ИДОперации,
			РазделОперации);
		
	КонецЦикла;
	
	ЗавершитьПотоки(Потоки);
	
КонецПроцедуры

// Обработка десериализации сообщени в потоке.
// 
// Параметры:
//  Правила - Соответствие Из Строка - см. Справочники.кфкКонсьюмеры.ПравилаДесериализации
Процедура ДесериализацияСообщенийВПотоке(Правила) Экспорт
	
	ИдентификаторПотока = ТекущийПоток().УникальныйИдентификатор;
	ПустойЗапрос = Дата(3999, 12, 31);
	Очереди = ОчередиВходящих();
	МаксРазмерПакета = НоваяСтратегияРаспределения().МаксРазмерПакета;
	
	Пока Истина Цикл
		
		Если ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			ОчиститьОчередьПотоков(ИдентификаторПотока);
			Прервать;
		КонецЕсли;
		
		Выборка = ВыборкаДесериализацииСообщенийВПотоке(ИдентификаторПотока, МаксРазмерПакета);
		Если Выборка.Количество() = 0 Тогда
			ПустойЗапрос = Мин(ПустойЗапрос, ТекущаяУниверсальнаяДата());
			Если ПустойЗапрос > ТекущаяУниверсальнаяДата() - ТаймаутПростояПотока() Тогда
				ВызватьПаузу(5000);
			Иначе
				Прервать;
			КонецЕсли;
			
		Иначе
			ПустойЗапрос = Дата(3999, 12, 31);
			
			ОбработчикДесериализацииСообщений(Выборка, Очереди, ИдентификаторПотока, Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Десериализация сообщения.
// 
// Параметры:
//	Сообщение - Структура, РегистрСведенийКлючЗаписи.кфкВходящиеСообщения - Сообщение:
//	 * КлючЗаписи - Строка - Ключ записи
//	 * ДатаЗагрузкиМС - Число - Дата загрузки в миллисекундах
Процедура ДесериализацияСообщения(Сообщение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Консьюмер КАК Консьюмер,
	|	Т.Топик КАК Топик,
	|	Т.Раздел КАК Раздел,
	|	Т.Смещение КАК Смещение,
	|	Т.КлючСообщения КАК КлючСообщения,
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.Заголовки КАК Заголовки,
	|	Т.ТелоСообщения КАК ТелоСообщения,
	|	Т.ДатаЗаписи КАК ДатаЗаписи,
	|	Т.ДатаЗагрузки КАК ДатаЗагрузки,
	|	Т.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС,
	|	Т.ДатаОбработки КАК ДатаОбработки,
	|	Т.ТекстЖурнала КАК ТекстЖурнала,
	|	Т.КоличествоОбработок КАК КоличествоОбработок
	|ИЗ
	|	РегистрСведений.кфкВходящиеСообщения КАК Т
	|ГДЕ
	|	Т.КлючЗаписи = &КлючЗаписи
	|	И Т.ДатаЗагрузкиМС = &ДатаЗагрузкиМС
	|	И НЕ 0 В
	|		(ВЫБРАТЬ
	|			0
	|		ИЗ
	|			РегистрСведений.кфкОчередьПотоков КАК ОП
	|		ГДЕ
	|			ОП.Ключ = Т.КлючЗаписи)";
	Запрос.УстановитьПараметр("КлючЗаписи", Сообщение.КлючЗаписи);
	Запрос.УстановитьПараметр("ДатаЗагрузкиМС", Сообщение.ДатаЗагрузкиМС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		//@skip-check bsl-legacy-check-string-literal
		Правила = Справочники.кфкКонсьюмеры.ПравилаДесериализации(Выборка["Консьюмер"]);
		
		Выборка.Сбросить();
		ОбработчикДесериализацииСообщений(Выборка, ОчередиВходящих(), "ДЕСЕРИАЛИЗАЦИЯ-СООБЩЕНИЯ", Правила);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеОперации

// Удаление дублей очереди.
Процедура УдалениеДублейОчереди() Экспорт
	
	// Указатель
	ИДОперации = ИДОперации_УказательУдаленияДублейОчереди();
	УказательНачалаВыборки = ПолучитьПозицию(ИДОперации); // Число
	УказательПогрешностьСмещения = УказательПогрешностьСмещения();
	// Параметры запроса
	МаксРазмерПакета = НоваяСтратегияРаспределения().МаксРазмерПакета * 10;
	
	// очередь исходящих сообщений
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкИсходящиеСообщения); // РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения
	
	Пока Истина Цикл
		
		Если ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			Прервать;
		КонецЕсли;
		
		Выборка = ВыборкаДублейИсходящихСообщений(МаксРазмерПакета, УказательНачалаВыборки);
		Если Выборка.Количество() = 0 Тогда
			
			// Указатель удаления
			УказательНачалаВыборки = УказательПустойВыборки();
			ОбновитьПозицию(ИДОперации, УказательНачалаВыборки);
			
			// пауза или завершение операции
			Если ПолучитьФункциональнуюОпцию("кфкИспользоватьПотоковыйРежим") Тогда
				ВызватьПаузу(5000);
			Иначе
				Прервать;
			КонецЕсли;
			
		Иначе
			
			ТекущаяДата = ТекущаяДатаСеанса();
			
			// обработка выборки
			Очередь.Очистить();
			Пока Выборка.Следующий() Цикл
				
				// Запись
				НоваяСтрока = Очередь.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.ОбработкаОтменена;
				НоваяСтрока.ДатаОбработки = ТекущаяДата;
				НоваяСтрока.ТекстЖурнала = НСтр("ru = 'Дублирует с более поздней регистрацией.'");
				НоваяСтрока.МеткаИзмененияМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
				
				УказательНачалаВыборки = Выборка.МеткаИзмененияМС - УказательПогрешностьСмещения;
				
			КонецЦикла;
			// Запись в БД
			Очередь.Записать(РежимЗамещения.Обновление);
			
			// Указатель удаления
			ОбновитьПозицию(ИДОперации, УказательНачалаВыборки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВозвратВОчередь() Экспорт
	
	// Указатель
	ИДОперации = ИДОперации_ВозвратВОчередь();
	УказательНачалаВыборки = ПолучитьПозицию(ИДОперации); // Число
	УказательПогрешностьСмещения = УказательПогрешностьСмещения();
	// Параметры запроса
	МаксКоличествоВыгрузок = 3; // Максимальное количество попыток отправки сообщения.
	МаксРазмерПакета = НоваяСтратегияРаспределения().МаксРазмерПакета;
	
	// очередь исходящих сообщений
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкИсходящиеСообщения); // РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения
	
	Пока Истина Цикл
		
		Если ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			Прервать;
		КонецЕсли;
		
		Выборка = ВыборкаВозвратаВОчередь(МаксРазмерПакета, УказательНачалаВыборки, МаксКоличествоВыгрузок);
		Если Выборка.Количество() = 0 Тогда
			
			// Указатель удаления
			УказательНачалаВыборки = УказательПустойВыборки();
			ОбновитьПозицию(ИДОперации, УказательНачалаВыборки);
			
			// завершение операции
			Прервать;
			
		Иначе
			
			// обработка выборки
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = Очередь.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Обработано;
				НоваяСтрока.МеткаИзмененияМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
				
				УказательНачалаВыборки = Выборка.МеткаИзмененияМС - УказательПогрешностьСмещения;
				
			КонецЦикла;
			// Запись в БД
			Очередь.Записать(РежимЗамещения.Обновление);
			
			// Указатель удаления
			ОбновитьПозицию(ИДОперации, УказательНачалаВыборки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Очистка хранилища очереди.
Процедура ОчисткаХранилищаОчереди() Экспорт
	
	МаксРазмерПакета = НоваяСтратегияРаспределения().МаксРазмерПакета * 10; // коэффициент режима удаления
	
	// РС.ИсходящиеСообщения
	Выборка = ВыборкаУстаревшихИсходящихСообщений(МаксРазмерПакета);
	УдалитьЗаписиРС(Выборка, РегистрыСведений.кфкИсходящиеСообщения);
	
	// РС.ВходящиеСообщения
	Выборка = ВыборкаУстаревшихВходящихСообщений(МаксРазмерПакета);
	УдалитьЗаписиРС(Выборка, РегистрыСведений.кфкВходящиеСообщения);
	
	// РС.ПозицииОпераций
	Выборка = ВыборкаПозицииОпераций();
	УдалитьЗаписиРС(Выборка, РегистрыСведений.кфкПозицииОпераций);
	
	// РС.ОчередьПотоков
	Выборка = ВыборкаИдентификаторовПотока();
	Пока Выборка.Следующий() Цикл
		
		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПотока);
		Если Задание <> Неопределено И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Продолжить;
		КонецЕсли;
		
		ОчиститьОчередьПотоков(Выборка.ИдентификаторПотока);
		
	КонецЦикла;
	
КонецПроцедуры

// Контроль интеграции.
Процедура КонтрольИнтеграции() Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("кфкИспользоватьКонтрольИнтеграции") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = РегистрыСведений.кфкПараметрыКонтроляИнтеграции.ПолучитьПараметры();
	Если Параметры.ВремяSLAИсходящих + Параметры.ВремяSLAВходящих = 0
		Или ПустаяСтрока(Параметры.ИдентификаторЧатаТГ) Или ПустаяСтрока(Параметры.ТокенБотаТГ) Тогда
		Возврат;
	КонецЕсли;
	
	Показатели = КонтроляИнтеграцииПоказатели(Параметры);
	
	Тело = Новый Массив; // Массив Из Строка

//	Исходящие сообщения
	Если Показатели.НарушенSLAИсходящих Или Показатели.ОшибкиИсходящих Тогда
		
		//@skip-check bsl-nstr-string-literal-format
		Тело.Добавить(НСтр("ru = '*✈️ Исходящие сообщения:*   '"));
		
//		Нарушен SLA
		Если Показатели.НарушенSLAИсходящих Тогда
			Шаблон = НСтр("ru = '⏱ **Нарушен SLA -** %1 сообщений не завершили обработку или выгрузку более %2 минут'");
			Тело.Добавить(СтрШаблон(Шаблон, Показатели.НарушенSLAИсходящих, Параметры.ВремяSLAИсходящих));
		КонецЕсли;
		
//		Обнаружены ошибки
		Если Показатели.ОшибкиИсходящих Тогда
			Шаблон = НСтр("ru = '❌ **Обнаружены ошибки -** %1 сообщений завершились с ошибкой'");
			Тело.Добавить(СтрШаблон(Шаблон, Показатели.ОшибкиИсходящих));
		КонецЕсли;
		
	КонецЕсли;

//	Входящие сообщения
	Если Показатели.НарушенSLAВходящих Или Показатели.ОшибкиВходящих Тогда
		
		//@skip-check bsl-nstr-string-literal-format
		Тело.Добавить(НСтр("ru = '*📩 Входящие сообщения:*   '"));
		
//		Нарушен SLA
		Если Показатели.НарушенSLAВходящих Тогда
			Шаблон = НСтр("ru = '⏱ **Нарушен SLA -** %1 сообщений не завершили обработку более %2 минут'");
			Тело.Добавить(СтрШаблон(Шаблон, Показатели.НарушенSLAВходящих, Параметры.ВремяSLAВходящих));
		КонецЕсли;
		
//		Обнаружены ошибки
		Если Показатели.ОшибкиВходящих Тогда
			Шаблон = НСтр("ru = '❌ **Обнаружены ошибки -** %1 сообщений завершились с ошибкой'");
			Тело.Добавить(СтрШаблон(Шаблон, Показатели.ОшибкиВходящих));
		КонецЕсли;
		
	КонецЕсли;
	
	Если Тело.Количество() Тогда
		ТекстСообщения = СтрСоединить(Тело, Символы.ПС);
		ОповеститьОбОшибки(Параметры, ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

#Область ВнешнееЛогирование

// Отправка исходящих логов во внешний сервис логирования
Процедура ВыгрузкаЛоговИсходящихСообщений() Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("кфкИспользоватьВнешнееЛогирование") Тогда
		Возврат;
	КонецЕсли;
	
	КонфигЛога = КонфигурацияЛогирования();
	Если КонфигЛога = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПозицииОт = ПозицииОтправкиЛогов();
	
	// Очистка очереди
	ОчередьИсходящих = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкИсходящиеСообщения); // РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения
	СтатусыКУдалению = СтатусыУдаленияСообщенийПослеОтправкиЛогов();
	
	Для Номер = 1 По КонфигЛога.КоличествоПакетов Цикл
		
		Если ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			Прервать;
		КонецЕсли;
		
		//@skip-check query-in-loop
		ОбработчикВыгрузкиЛоговИсходящихСообщений(КонфигЛога, СтатусыКУдалению.Исходящих, ОчередьИсходящих, ПозицииОт);
		
	КонецЦикла;
	
КонецПроцедуры

// Отправка входящих логов во внешний сервис логирования
Процедура ВыгрузкаЛоговВходящихСообщений() Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("кфкИспользоватьВнешнееЛогирование") Тогда
		Возврат;
	КонецЕсли;
	
	КонфигЛога = КонфигурацияЛогирования();
	Если КонфигЛога = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПозицииОт = ПозицииОтправкиЛогов();
	
	// Очистка очереди
	ОчередьВходящих = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкВходящиеСообщения); // РегистрСведенийНаборЗаписей.кфкВходящиеСообщения
	СтатусыКУдалению = СтатусыУдаленияСообщенийПослеОтправкиЛогов();
	
	Для Номер = 1 По КонфигЛога.КоличествоПакетов Цикл
		
		Если ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции") Тогда
			Прервать;
		КонецЕсли;
		
		//@skip-check query-in-loop
		ОбработчикВыгрузкиЛоговВходящихСообщений(КонфигЛога, СтатусыКУдалению.Входящих, ОчередьВходящих, ПозицииОт);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Прочее

// Новое описание правил обмена.
// 
// Возвращаемое значение:
//	Структура - описание обмена:
//	 * Тип - ПеречислениеСсылка.кфкТипыОбработчиков - Тип обработчика
//	 * ИмяМетода - Строка - Метод произвольного обработчика
//	 * ИмяМодуля - Строка - Менеджер обмена
//	 * ИмяПОД - Строка - Имя ПОД
//	 * Формат - Строка - Формат обмена
//	 * КомпонентыОбмена - Неопределено, Структура - Компоненты обмена. см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
Функция НовоеОписаниеПравилОбмена() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Тип", Перечисления.кфкТипыОбработчиков.ПустаяСсылка());
	Результат.Вставить("ИмяМетода", "");
	Результат.Вставить("ИмяМодуля", "");
	Результат.Вставить("ИмяПОД", "");
	Результат.Вставить("Формат", "");
	
	Результат.Вставить("КомпонентыОбмена", Неопределено);
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Прочее

// Возвращает представления идентификаторов операций.
// 
// Возвращаемое значение:
//	СписокЗначений Из УникальныйИдентификатор - Представления идентификатора операций
Функция ПредставленияИдентификатораОпераций() Экспорт

	// Шаблон - 00000000-XXXX-0000-NNNN-NNNNNNNNNNNN
	//  Доступные символы - [a-f0-9]
	//	XXXX - ИД раздела
	//	NNNN-NNNNNNNNNNNN - Сквозной ИД операции
	
	Результат = Новый СписокЗначений; // СписокЗначений Из УникальныйИдентификатор
	
	// ОтправкаЛогов, ИД - 1
	Результат.Добавить(ИДОперации_ОтправкаЛоговИсходящих(), НСтр("ru = 'Выгрузка логов исходящих сообщений'"));
	Результат.Добавить(ИДОперации_ОтправкаЛоговВходящих(), НСтр("ru = 'Выгрузка логов входящих сообщений'"));
	
	// КонтрольИнтеграции, ИД - 2
	Результат.Добавить(ИДОперации_КонтрольИнтеграцииИсходящих(), НСтр("ru = 'Контроль интеграции исходящих сообщений'"));
	Результат.Добавить(ИДОперации_КонтрольИнтеграцииВходящих(), НСтр("ru = 'Контроль интеграции входящих сообщений'"));
	
	// УказательНачалаВыборки, ИД - 3
	Результат.Добавить(ИДОперации_УказательСериализацииСообщений(), НСтр("ru = 'Сериализация сообщений'"));
	Результат.Добавить(ИДОперации_УказательОтправкиИсходящихСообщений(), НСтр("ru = 'Публикация сообщений'"));
	Результат.Добавить(ИДОперации_УказательУдаленияДублейОчереди(), НСтр("ru = 'Удаление дублей очереди'"));
	Результат.Добавить(ИДОперации_ВозвратВОчередь(), НСтр("ru = 'Возврат в очередь'"));
	Результат.Добавить(ИДОперации_УказательДесериализацииСообщений(), НСтр("ru = 'Десериализация сообщений'"));
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Константы

#Область ДоступныеОперации

// Возвращает список операций продюсера.
// 
// Возвращаемое значение:
//  СписокЗначений Из Строка - Операции


// Возвращает список всех операций.
// 
// Возвращаемое значение:
//  СписокЗначений Из Строка - Операции
Функция СписокВсехОпераций()
	
	Результат = Новый СписокЗначений; // СписокЗначений Из Строка
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСписок(Результат, СписокОперацийОбмена(Тип("СправочникСсылка.кфкПродюсеры")));
	ОбщегоНазначенияКлиентСервер.ДополнитьСписок(Результат, СписокОперацийОбмена(Тип("СправочникСсылка.кфкКонсьюмеры")));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСписок(Результат, СписокСлужебныхОпераций());
	
	Возврат Результат;
	
КонецФункции

// Возвращает список операций консьюмера.
// 
// Параметры:
//	ЕстьИсходящийПоток - Булево - Признак необходимости служебных исходящихопераций
//	ЕстьВходящийПоток - Булево - Признак необходимости служебных входящих операций
// 
// Возвращаемое значение:
//	СписокЗначений из Строка - Операции
Функция СписокСлужебныхОпераций(ЕстьИсходящийПоток = Истина, ЕстьВходящийПоток = Истина)
	
	Результат = Новый СписокЗначений; // СписокЗначений Из Строка
	
	// Служебные исходящие операции
	Если ЕстьИсходящийПоток Тогда
		Результат.Добавить("УдалениеДублейОчереди", НСтр("ru = 'Удаление дублей очереди'"));
		Результат.Добавить("ВозвратВОчередь", НСтр("ru = 'Возврат в очередь'"));
	КонецЕсли;
	
	// Общая служебная операция
	Результат.Добавить("ОчисткаХранилищаОчереди", НСтр("ru = 'Очистка хранилища очереди'"));
	Если ПолучитьФункциональнуюОпцию("кфкИспользоватьКонтрольИнтеграции") Тогда
		Результат.Добавить("КонтрольИнтеграции", НСтр("ru = 'Контроль интеграции'"));
	КонецЕсли;
	
	// Выгрузка логов во внешнее хранилище
	Если ПолучитьФункциональнуюОпцию("кфкИспользоватьВнешнееЛогирование") Тогда
		
		Если ЕстьИсходящийПоток Тогда
			Результат.Добавить("ВыгрузкаЛоговИсходящихСообщений", НСтр("ru = 'Выгрузка логов исходящих сообщений'"));
		КонецЕсли;
		
		Если ЕстьВходящийПоток Тогда
			Результат.Добавить("ВыгрузкаЛоговВходящихСообщений", НСтр("ru = 'Выгрузка логов входящих сообщений'"));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список операций продюсера или консьюмера.
// 
// Параметры:
//  ТипИнтеграции - Тип - Тип интеграции: СправочникСсылка.кфкПродюсеры или СправочникСсылка.кфкКонсьюмеры
//  ТипОперация - Неопределено, Булево - Истина - только обработка, Ложь - только транспорт, иначе - все
// 
// Возвращаемое значение:
//	СписокЗначений Из Строка - Список операций:
//	 * Знчаение - Строка - Имя операции
//	 * Представление - Строка - Синоним операции
//	 * ЭтоТранспорт - Булево - Это транспорт
Функция СписокОперацийОбмена(ТипИнтеграции, ТипОперация = Неопределено)
	
	Результат = Новый СписокЗначений; // СписокЗначений Из Строка
	
	Если ТипИнтеграции = Тип("СправочникСсылка.кфкПродюсеры") Тогда
		// Сериализация
		Операция = ОписаниеОперацииОбработки(ТипИнтеграции);
		Результат.Добавить(Операция.Имя, Операция.Синоним, Операция.ЭтоТранспорт);
		// Выгрузка
		Операция = ОписаниеОперацииТранспорта(ТипИнтеграции);
		Результат.Добавить(Операция.Имя, Операция.Синоним, Операция.ЭтоТранспорт);
		
	ИначеЕсли ТипИнтеграции = Тип("СправочникСсылка.кфкКонсьюмеры") Тогда
		// Десериализация
		Операция = ОписаниеОперацииОбработки(ТипИнтеграции);
		Результат.Добавить(Операция.Имя, Операция.Синоним, Операция.ЭтоТранспорт);
		// Загрузка
		Операция = ОписаниеОперацииТранспорта(ТипИнтеграции);
		Результат.Добавить(Операция.Имя, Операция.Синоним, Операция.ЭтоТранспорт);
		 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Описание операции обработки.
// 
// Параметры:
//  ТипИнтеграции - Тип - Тип интеграции: СправочникСсылка.кфкПродюсеры или СправочникСсылка.кфкКонсьюмеры
// 
// Возвращаемое значение:
//  Неопределено, Структура - Описание операции обработки:
// * Имя - Строка - Имя операции
// * Синоним - Строка - Синоним операции
// * ЭтоТранспорт - Булево - Это транспорт
Функция ОписаниеОперацииОбработки(ТипИнтеграции)
	
	Результат = Новый Структура;
	Результат.Вставить("Имя", "");
	Результат.Вставить("Синоним", "");
	Результат.Вставить("ЭтоТранспорт", Ложь);
		
	Если ТипИнтеграции = Тип("СправочникСсылка.кфкПродюсеры") Тогда
		Результат.Имя = "СериализацияСообщений";
		Результат.Синоним = НСтр("ru = 'Сериализация сообщений'");
		
	ИначеЕсли ТипИнтеграции = Тип("СправочникСсылка.кфкКонсьюмеры") Тогда
		Результат.Имя = "ДесериализацияСообщений";
		Результат.Синоним = НСтр("ru = 'Десериализация сообщений'");
		
	Иначе
		 Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Описание операции транспорта.
// 
// Параметры:
//  ТипИнтеграции - Тип - Тип интеграции: СправочникСсылка.кфкПродюсеры или СправочникСсылка.кфкКонсьюмеры
// 
// Возвращаемое значение:
//  Неопределено, Структура - Описание операции обработки:
// * Имя - Строка - Имя операции
// * Синоним - Строка - Синоним операции
// * ЭтоТранспорт - Булево - Это транспорт
Функция ОписаниеОперацииТранспорта(ТипИнтеграции)
	
	Результат = Новый Структура;
	Результат.Вставить("Имя", "");
	Результат.Вставить("Синоним", "");
	Результат.Вставить("ЭтоТранспорт", Истина);
		
	Если ТипИнтеграции = Тип("СправочникСсылка.кфкПродюсеры") Тогда
		Результат.Имя = "ОтправкаСообщенийВKafka";
		Результат.Синоним = НСтр("ru = 'Отправка сообщений в Kafka'");
		
	ИначеЕсли ТипИнтеграции = Тип("СправочникСсылка.кфкКонсьюмеры") Тогда
		Результат.Имя = "ЗагрузкаСообщенийИзKafka";
		Результат.Синоним = НСтр("ru = 'Загрузка сообщений из Kafka'");
		
	Иначе
		 Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ЗапуститьФЗ

// Имя метода потока.
// 
// Параметры:
//  КлючПотока - Строка - Ключ потока
// 
// Возвращаемое значение:
//  Строка - Имя метода
Функция ИмяМетодаПотока(КлючПотока)
	Возврат "кфкФоновыеОперацииСлужебный." + КлючПотока;
КонецФункции

// Ключ задания.
// 
// Параметры:
//  КлючПотока - Строка - Ключ потока
//  ДиспетчерЗадач - Неопределено, СправочникСсылка.кфкПродюсеры, СправочникСсылка.кфкКонсьюмеры, Строка - Диспетчер задач
// 
// Возвращаемое значение:
//  Строка - Ключ зфонового задания
Функция КлючЗадания(КлючПотока, ДиспетчерЗадач = Неопределено)
	
	Результат = "кфк" + КлючПотока;
	 
	Если ДиспетчерЗадач = Неопределено Тогда
		Возврат Результат;
		
	ИначеЕсли ТипЗнч(ДиспетчерЗадач) = Тип("Строка") Тогда
		Возврат Результат + "_" + ДиспетчерЗадач;
		
	Иначе
		Возврат Результат + "_" + Лев(XMLСтрока(ДиспетчерЗадач), 8);
		
	КонецЕсли;
	
КонецФункции

// Ключ задания.
// 
// Параметры:
//  Представление - Строка - Представление операции
//  ПредставлениеДЗ - Строка - Представление диспетчера задач
// 
// Возвращаемое значение:
//  Строка - Ключ зфонового задания
Функция ПредставлениеЗадания(Представление, ПредставлениеДЗ = "")
	Возврат ?(ПустаяСтрока(ПредставлениеДЗ), Представление, СтрШаблон("%1 (%2)", Представление, ПредставлениеДЗ));
КонецФункции

#КонецОбласти

#Область РС_ПозицииОпераций

// Шаблон - 00000000-XXXX-0000-NNNN-NNNNNNNNNNNN
//  Доступные символы - [a-f0-9]
//	XXXX - ИД раздела
//	NNNN-NNNNNNNNNNNN - Сквозной ИД операции

#Область ОтправкаЛогов // ИД - 1 

// Идентификатор операции "Отправка логов исходящих"
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор операции
Функция ИДОперации_ОтправкаЛоговИсходящих()
	Возврат Новый УникальныйИдентификатор("00000000-0001-0000-0000-111111111111");
КонецФункции

// Идентификатор операции "Отправка логов входящих"
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор операции
Функция ИДОперации_ОтправкаЛоговВходящих()
	Возврат Новый УникальныйИдентификатор("00000000-0001-0000-0000-222222222222");
КонецФункции

#КонецОбласти

#Область КонтрольИнтеграции // ИД - 2

// Идентификатор операции "Контроль интеграции исходящих"
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор операции
Функция ИДОперации_КонтрольИнтеграцииИсходящих()
	Возврат Новый УникальныйИдентификатор("00000000-0002-0000-0000-333333333333");
КонецФункции

// Идентификатор операции "Контроль интеграции входящих"
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор операции
Функция ИДОперации_КонтрольИнтеграцииВходящих()
	Возврат Новый УникальныйИдентификатор("00000000-0002-0000-0000-444444444444");
КонецФункции

#КонецОбласти

#Область УказательНачалаВыборки // ИД - 3

// Идентификатор операции "Указатель сериализации сообщений"
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор операции
Функция ИДОперации_УказательСериализацииСообщений()
	Возврат Новый УникальныйИдентификатор("00000000-0003-0000-0000-555555555555");
КонецФункции

// Идентификатор операции "Указатель отправки исходящих сообщений"
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор операции
Функция ИДОперации_УказательОтправкиИсходящихСообщений()
	Возврат Новый УникальныйИдентификатор("00000000-0003-0000-0000-666666666666");
КонецФункции

// Идентификатор операции "Указатель удаления дублей очереди"
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор операции
Функция ИДОперации_УказательУдаленияДублейОчереди()
	Возврат Новый УникальныйИдентификатор("00000000-0003-0000-0000-777777777777");
КонецФункции


// Идентификатор операции "Возврат в очередь"
// 
// Возвращаемое значение:
//	УникальныйИдентификатор - Идентификатор операции
Функция ИДОперации_ВозвратВОчередь()
	Возврат Новый УникальныйИдентификатор("00000000-0003-0000-0000-999999999999");
КонецФункции

// Идентификатор операции "Указатель десериализации сообщений"
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор операции
Функция ИДОперации_УказательДесериализацииСообщений()
	Возврат Новый УникальныйИдентификатор("00000000-0003-0000-0000-888888888888");
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ТекстЗапроса

Функция ТекстЗапросаОбработкаИсходящихСообщений(Количество)
	
	Результат = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Т1.КлючЗаписи КАК КлючЗаписи,
	|	Т1.ДатаРегистрацииМС КАК ДатаРегистрацииМС,
	|	Т1.МеткаИзмененияМС КАК МеткаИзмененияМС
	|ИЗ
	|	РегистрСведений.кфкИсходящиеСообщения КАК Т1
	|ГДЕ
	|	Т1.Продюсер В (&Продюсеры)
	|	И Т1.МеткаИзмененияМС >= &МеткаИзмененияМС
	|	И Т1.ДатаРегистрацииМС В
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(Т2.ДатаРегистрацииМС) КАК ДатаРегистрацииМС
	|		ИЗ
	|			РегистрСведений.кфкИсходящиеСообщения КАК Т2
	|		ГДЕ
	|			Т2.КлючЗаписи = Т1.КлючЗаписи)
	|	И НЕ 0 В
	|		(ВЫБРАТЬ
	|			0
	|		ИЗ
	|			РегистрСведений.кфкОчередьПотоков КАК ОП
	|		ГДЕ
	|			ОП.Ключ = Т1.КлючЗаписи)
	|	И Т1.Статус = &Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т1.МеткаИзмененияМС";
	
	Возврат СтрЗаменить(Результат, "1000", XMLСтрока(Количество));
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область УправлениеФЗ

// Запустить фоновое задание
// 
// Параметры:
//  Ключ - Строка - Ключ
//  ИмяМетода - Строка - Имя метода
//  Наименование - Строка - Наименование
//  Параметры - Неопределено, Массив Из Произвольный - Параметры
// 
// Возвращаемое значение:
//  ФоновоеЗадание - Запущенное задание
Функция ЗапуститьФЗ(Ключ, ИмяМетода, Наименование, Параметры = Неопределено)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", Ключ);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если Задания.Количество() = 0 Тогда
		Задание = ФоновыеЗадания.Выполнить(
			ИмяМетода,
			Параметры,
			Ключ,
			Наименование);
		
		Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
		КонецЕсли;
		
		Возврат Задание;
		
//		ВызватьПаузу(5000); // контроль выполнения - ждем 5 сек, затем проверяем статус ФЗ
//		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Задание.УникальныйИдентификатор);
//		Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
//			ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
//		КонецЕсли;
		
	Иначе
		Возврат Задания[0];
		
	КонецЕсли;
	
КонецФункции

// Инициирует новый вложенный поток.
// 
// Параметры:
//  ТекущееЗадание - ФоновоеЗадание, Структура - Текущий поток
//  НомерПотока - Число - Номер вложенного потока
//  Параметры - Неопределено, Массив Из Произвольный - Параметры
// 
// Возвращаемое значение:
//  ФоновоеЗадание - Новый вложенный поток
Функция ЗапуститьПоток(ТекущееЗадание, НомерПотока, Параметры = Неопределено)
	
	Возврат ЗапуститьФЗ(
		ТекущееЗадание.Ключ + "_" + Формат(НомерПотока, "ЧЦ=2; ЧН=0; ЧВН=;"),
		ТекущееЗадание.ИмяМетода + "ВПотоке",
		СтрШаблон("%1 (Поток - %2)", ТекущееЗадание.Наименование, Формат(НомерПотока, "ЧЦ=2; ЧВН=;")),
		Параметры);
	
КонецФункции

// Возвращает текущий поток.
// 
// Возвращаемое значение:
//  ФоновоеЗадание - Текущий поток
Функция ТекущийПоток()
	Возврат ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
КонецФункции

#КонецОбласти

#Область ПараллельныеПотоки

// Таблица распределения потоков.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица распределения потоков:
//	 * Ссылка - СправочникСсылка.кфкПродюсеры, СправочникСсылка.кфкКонсьюмеры - Ссылка на диспетчер задач
//	 * Представление - Строка - Представление диспетчер задач
//	 * ПодпотокиОбработки - Число - Допустимое число вложенных потоков обработки
//	 * ПодпотокиТранспорта - Число - Допустимое число вложенных транспортных потоков
//	 * Настройка - СправочникСсылка.кфкПродюсеры, СправочникСсылка.кфкКонсьюмеры - Настройка
//	 * БлокироватьОбработку - Булево - Блокировать обработку
//	 * БлокироватьТранспорт - Булево - Блокировать транспорт
Функция ТаблицаРаспределенияПотоков()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ДиспетчерыЗадач.Ссылка, ЗНАЧЕНИЕ(Справочник.кфкПродюсеры.ПустаяСсылка)) КАК Ссылка,
	|	ЕСТЬNULL(ДиспетчерыЗадач.Представление, ""Общий поток"") КАК Представление,
	|	ЕСТЬNULL(ДиспетчерыЗадач.ПодпотокиОбработки, &ПодпотокиОбработки) КАК ПодпотокиОбработки,
	|	ЕСТЬNULL(ДиспетчерыЗадач.ПодпотокиТранспорта, &ПодпотокиТранспорта) КАК ПодпотокиТранспорта,
	|	Таблица.Ссылка КАК Настройка,
	|	Таблица.БлокироватьСериализацию КАК БлокироватьОбработку,
	|	Таблица.БлокироватьПубликацию ИЛИ Брокеры.БлокироватьПубликацию КАК БлокироватьТранспорт
	|ИЗ
	|	Справочник.кфкПродюсеры КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.кфкБрокеры КАК Брокеры
	|		ПО Таблица.Брокер = Брокеры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.кфкПродюсеры КАК ДиспетчерыЗадач
	|		ПО Таблица.Родитель = ДиспетчерыЗадач.Ссылка
	|ГДЕ
	|	Таблица.ПометкаУдаления = ЛОЖЬ
	|	И Таблица.ЭтоГруппа = ЛОЖЬ
	|	И Брокеры.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДиспетчерыЗадач.Ссылка, ЗНАЧЕНИЕ(Справочник.кфкКонсьюмеры.ПустаяСсылка)),
	|	ЕСТЬNULL(ДиспетчерыЗадач.Представление, ""Общий поток""),
	|	ЕСТЬNULL(ДиспетчерыЗадач.ПодпотокиОбработки, &ПодпотокиОбработки),
	|	ЕСТЬNULL(ДиспетчерыЗадач.ПодпотокиТранспорта, &ПодпотокиТранспорта),
	|	Таблица.Ссылка,
	|	Таблица.БлокироватьДесериализацию,
	|	Таблица.БлокироватьЧтение ИЛИ Брокеры.БлокироватьЧтение
	|ИЗ
	|	Справочник.кфкКонсьюмеры КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.кфкБрокеры КАК Брокеры
	|		ПО Таблица.Брокер = Брокеры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.кфкКонсьюмеры КАК ДиспетчерыЗадач
	|		ПО Таблица.Родитель = ДиспетчерыЗадач.Ссылка
	|ГДЕ
	|	Таблица.ПометкаУдаления = ЛОЖЬ
	|	И Таблица.ЭтоГруппа = ЛОЖЬ
	|	И Брокеры.ПометкаУдаления = ЛОЖЬ";
	
	// По умолчанию
	Для Каждого Стратегия Из НоваяСтратегияРаспределения() Цикл
		Запрос.УстановитьПараметр(Стратегия.Ключ, Стратегия.Значение);
	КонецЦикла;
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Индексы.Добавить("Ссылка");
	
	Возврат Таблица;
	
КонецФункции

// Новая стратегия распределения.
// 
// Возвращаемое значение:
//  Структура - Новая стратегия распределения:
//	* ПодпотокиОбработки - Число - Допустимое число вложенных потоков обработки
//	* ПодпотокиТранспорта - Число - Допустимое число вложенных транспортных потоков
//	* МинРазмерПакета - Число - Минимальный количество сообщений в очереди потока
//	* МаксРазмерПакета - Число - Максимальное количество сообщений в очереди потока
Функция НоваяСтратегияРаспределения()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПодпотокиОбработки", 1);
	Результат.Вставить("ПодпотокиТранспорта", 1);
	
	Результат.Вставить("МинРазмерПакета", 10);
	Результат.Вставить("МаксРазмерПакета", 1000);
	
	Возврат Результат;
	
КонецФункции

// Время бездействия в секундах.
// 
// Возвращаемое значение:
//  Число - Тайм-аут простоя потока
Функция ТаймаутПростояПотока()
	Возврат 300; // 5 минут
КонецФункции

// Метод актуализирует список потоков и очищает очередь при неактивном состоянии.
// 
// Параметры:
//  Потоки - Массив Из УникальныйИдентификатор - Потоки
Процедура АктуализироватьПотоки(Потоки)
	
	Результат = Новый Массив; // Массив Из УникальныйИдентификатор
	
	Для Каждого Поток Из Потоки Цикл
		
		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Поток);
		Если Задание <> Неопределено И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Результат.Добавить(Задание.УникальныйИдентификатор);
			
		Иначе
			ОчиститьОчередьПотоков(Поток);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Потоки = Результат;
	
КонецПроцедуры

// Метод завершает все потоки и очищает их очереди.
// 
// Параметры:
//  Потоки - Массив Из УникальныйИдентификатор - Потоки
//	ОтменитьФЗ - Булево - Отменить ФЗ
Процедура ЗавершитьПотоки(Потоки, ОтменитьФЗ = Истина)
	
	Для Каждого Поток Из Потоки Цикл
		
		Если ОтменитьФЗ Тогда
			Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Поток);
			Если Задание <> Неопределено И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				Задание.Отменить();
			КонецЕсли;
		КонецЕсли;
		
		ОчиститьОчередьПотоков(Поток);
		
	КонецЦикла;
		
КонецПроцедуры

#Область ОчередьПотоков

// Очистить очередь потоков.
// 
// Параметры:
//	Идентификатор - УникальныйИдентификатор - Идентификатор потока
Процедура ОчиститьОчередьПотоков(Идентификатор)
	
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкОчередьПотоков); // РегистрСведенийНаборЗаписей.кфкОчередьПотоков
	Очередь.Отбор.ИдентификаторПотока.Установить(Идентификатор);
	Очередь.Записать();
	
КонецПроцедуры

// Ожидать завершения всех потоков.
// 
// Параметры:
//  Потоки - Массив Из УникальныйИдентификатор - Потоки
Процедура ОжидатьЗавершенияПотоков(Потоки)
	
	Пока Истина Цикл
		
		АктуализироватьПотоки(Потоки);
		Если Потоки.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ РегистрСведений.кфкОчередьПотоков
		|	ГДЕ ИдентификаторПотока В (&Идентификаторы)";
		Запрос.УстановитьПараметр("Идентификаторы", Потоки);
		Если Запрос.Выполнить().Пустой() Тогда
			Прервать;
			
		Иначе
			ВызватьПаузу(5000);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Ожидать свободный потоки
// 
// Параметры:
//  Диспетчер - Структура - Диспетчер потоков, см. ОписаниеОперацииОбмена
//  Потоки - Массив Из УникальныйИдентификатор - Потоки
//  МаксПодпотоков - Число - Допустимое число вложенных потоков
//  
//  Параметры - Неопределено, Произвольный, Массив Из Произвольный - Параметры
// 
// Возвращаемое значение:
//  Массив Из УникальныйИдентификатор - Cвободные потоки
//
Функция ОжидатьСвободныеПотоки(Диспетчер, Потоки, МаксПодпотоков, Параметры)
	
	Если Параметры = Неопределено Тогда
		ПараметрыПотока = Неопределено;
		
	ИначеЕсли ТипЗнч(Параметры) = Тип("Массив") Тогда
		ПараметрыПотока = Параметры;
		
	Иначе
		ПараметрыПотока = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры);
		
	КонецЕсли;
	
	Если Потоки.Количество() = 0 Тогда
		Задание = ЗапуститьПоток(Диспетчер, 1, ПараметрыПотока);
		Потоки.Добавить(Задание.УникальныйИдентификатор);
		Возврат Потоки;
		
	Иначе
		Пока Истина Цикл
			
			АктуализироватьПотоки(Потоки);
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ИдентификаторПотока ИЗ РегистрСведений.кфкОчередьПотоков
			|	ГДЕ ИдентификаторПотока В (&Идентификаторы)";
			Запрос.УстановитьПараметр("Идентификаторы", Потоки);
			АктивныеПотоки = кфкОбщегоНазначенияСлужебный.ВыбратьКолонку(Запрос.Выполнить().Выбрать(), "ИдентификаторПотока");
			СвободныеПотоки = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Потоки, АктивныеПотоки);
			Если СвободныеПотоки.Количество() > 0 Тогда
				Возврат СвободныеПотоки;
				
			ИначеЕсли Потоки.Количество() < МаксПодпотоков Тогда
				Для НомерПотока = 1 По МаксПодпотоков Цикл
					
					Задание = ЗапуститьПоток(Диспетчер, НомерПотока, ПараметрыПотока);
					Если Потоки.Найти(Задание.УникальныйИдентификатор) = Неопределено Тогда // если новый поток
						
						Потоки.Добавить(Задание.УникальныйИдентификатор);
						СвободныеПотоки.Добавить(Задание.УникальныйИдентификатор);
						
						Прервать; // запускаем по одному
						
					КонецЕсли;
					
				КонецЦикла;
				Если СвободныеПотоки.Количество() = 0 Тогда
					ВызватьИсключение НСтр("ru = 'Не удалось запустить потоки.'");
				КонецЕсли;
				Возврат СвободныеПотоки;
				
			Иначе
				ВызватьПаузу(5000);
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Указатели

// Получить позицию.
// 
// Параметры:
//  Идентификатор - УникальныйИдентификатор - Идентификатор операции
//  Раздел - Строка - Дополнительный раздел операции
// 
// Возвращаемое значение:
//  Число - Временная метка
Функция ПолучитьПозицию(Идентификатор, Раздел = "")
	Возврат РегистрыСведений.кфкПозицииОпераций.ПолучитьПозицию(Идентификатор, Раздел);
КонецФункции

// Обновить позиции.
// 
// Параметры:
//	Идентификатор - УникальныйИдентификатор - Идентификатор операции
//	ВременнаяМетка - Число - Временная метка
//	Раздел - Неопределено, Структура - Дополнительный раздел операции:
//		* Значение - Строка - Идентификатор раздела
//		* Представление - Строка - Представление раздела
Процедура ОбновитьПозицию(Идентификатор, ВременнаяМетка, Раздел = Неопределено)
	РегистрыСведений.кфкПозицииОпераций.ОбновитьПозицию(Идентификатор, ВременнаяМетка, Раздел);
КонецПроцедуры

// Вычисляет хеш-сумму настроек.
//
// Параметры:
//	Настройки - Массив Из СправочникСсылка.кфкПродюсеры - настройки, для которых вычисляется хеш-сумма
//
// Возвращаемое значение:
//	Строка - хеш-сумма настроек в шестнадцатеричном формате
Функция ПолучитьРазделОперации(Настройки)
	
	Результат = Новый Структура("Значение,Представление", "", "");
	
	// Хеш-сумма настроек
	Список = Новый СписокЗначений; // СписокЗначений Из Строка
	Для Каждого Настройка Из Настройки Цикл
		Список.Добавить(XMLСтрока(Настройка));
	КонецЦикла;
	Список.СортироватьПоЗначению();
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Для Каждого Элемент Из Список Цикл
		Хеш.Добавить(Элемент.Значение);
	КонецЦикла;
	Результат.Значение = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
	
	// Представление настроек
	//@skip-check bsl-legacy-check-string-literal
	Реквизиты = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Настройки, "Представление");
	Представления = ОбщегоНазначения.ВыгрузитьКолонку(Реквизиты, "Значение");
	Результат.Представление = СтрСоединить(Представления, "|");
	
	Возврат Результат;
	
КонецФункции

// Создает пустую таблицу состояния потоков.
//
// Возвращаемое значение:
//	ТаблицаЗначений - пустую таблицу указателей:
//	 * ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
//	 * СтатусПотока - Число - Статус потока
//	 * ВременнаяМетка - Число - Временная метка
//
Функция ПустаяТаблицаУказателейПотоков()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИдентификаторПотока", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Результат.Колонки.Добавить("СтатусПотока", ОбщегоНазначения.ОписаниеТипаЧисло(1, 0, ДопустимыйЗнак.Любой));
	Результат.Колонки.Добавить("ВременнаяМетка", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0, ДопустимыйЗнак.Неотрицательный));
	
	Результат.Индексы.Добавить("ИдентификаторПотока");
	
	Возврат Результат;
	
КонецФункции

// Указатель погрешность смещения.
// 
// Возвращаемое значение:
//  Число - Указатель погрешность смещения
Функция УказательПогрешностьСмещения()
	Возврат 600000; // 10 минуту ждем появления новых данных
КонецФункции

// Указатель пустого запроса.
// 
// Возвращаемое значение:
//  Число - Указатель пустого запроса
Функция УказательПустойВыборки()
	Возврат ТекущаяУниверсальнаяДатаВМиллисекундах() - УказательПогрешностьСмещения(); // 10 минуту ждем появления новых данных
КонецФункции

// Добавить указатель потока.
// 
// Параметры:
//	Указатели - ТаблицаЗначений - Указатели, см. ПустаяТаблицаУказателейПотоков:
//	 * ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
//	 * СтатусПотока - Число - Статус потока
//	 * ВременнаяМетка - Число - Временная метка
//	ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
//	ВременнаяМетка - Число - Временная метка
Процедура ДобавитьУказательПотока(Указатели, ИдентификаторПотока, ВременнаяМетка)
	
	НоваяСтрока = Указатели.Добавить();
	НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
	НоваяСтрока.ВременнаяМетка = ВременнаяМетка;
	
КонецПроцедуры

// Устанавливает статус 'завершено' указателей, см. ОбновитьУказательНачалаВыборки
// 
// Параметры:
//  Указатели - ТаблицаЗначений - указатели потоков, см. ПустаяТаблицаСостоянияПотоков:
//	 * ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
//	 * СтатусПотока - Число - Статус потока
//	 * ВременнаяМетка - Число - Временная метка
//	ЗавершенныеПотоки - Массив Из УникальныйИдентификатор - Активные потоки
Процедура ЗафиксироватьУказатели(Указатели, ЗавершенныеПотоки)
	
	Если Указатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Поток Из ЗавершенныеПотоки Цикл
		Для Каждого Строка Из Указатели.НайтиСтроки(Новый Структура("ИдентификаторПотока", Поток)) Цикл
			Если Строка.СтатусПотока = 0 Тогда
				Строка.СтатусПотока = 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Обновить статус указателей.
// 
// Параметры:
//  УказателиПотоков - ТаблицаЗначений - указатели потоков, см. ПустаяТаблицаСостоянияПотоков:
//	 * ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
//	 * СтатусПотока - Число - Статус потока
//	 * ВременнаяМетка - Число - Временная метка
//	Потоки - Массив Из УникальныйИдентификатор - Потоки
Процедура ОбновитьСтатусУказателей(УказателиПотоков, Потоки)
	
	Если УказателиПотоков.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ИдентификаторПотока ИЗ РегистрСведений.кфкОчередьПотоков
	|	ГДЕ ИдентификаторПотока В (&Идентификаторы)";
	Запрос.УстановитьПараметр("Идентификаторы", Потоки);
	АктивныеПотоки = кфкОбщегоНазначенияСлужебный.ВыбратьКолонку(Запрос.Выполнить().Выбрать(), "ИдентификаторПотока");
	ЗавершенныеПотоки = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Потоки, АктивныеПотоки);
	
	ЗафиксироватьУказатели(УказателиПотоков, ЗавершенныеПотоки);

КонецПроцедуры

// Обновляет указатели начала выборки.
//
// Параметры:
//	УказательНачалаВыборки - Число - Указатель начала выборки данных
//	УказателиПотоков - ТаблицаЗначений - указатели потоков, см. ПустаяТаблицаСостоянияПотоков:
//	 * ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
//	 * СтатусПотока - Число - Статус потока
//	 * ВременнаяМетка - Число - Временная метка
//	УказательПустойВыборки - Число - Указатель пустой выборки
//	Потоки - Массив Из УникальныйИдентификатор - Активныеотоки
//	ИДОперации - УникальныйИдентификатор - ИД операции
//	РазделОперации - Неопределено, Структура - Дополнительный раздел операции:
//		* Значение - Строка - Идентификатор раздела
//		* Представление - Строка - Представление раздела
// 
Процедура ОбновитьУказательНачалаВыборки(УказательНачалаВыборки, УказателиПотоков, УказательПустойВыборки, Потоки,
		ИДОперации, РазделОперации)
	
	Если УказателиПотоков.Количество() = 0 Тогда
		УказательНачалаВыборки = Макс(УказательНачалаВыборки, УказательПустойВыборки);
		ОбновитьПозицию(ИДОперации, УказательНачалаВыборки, РазделОперации);
		
	Иначе
		КУдалению = Новый Массив; // Массив Из СтрокаТаблицыЗначений
		УказателиПотоков.Сортировать("ВременнаяМетка");
		
		МинСтатус = 1;
		НовыйУказатель = Ложь;
		
		Для Каждого Строка Из УказателиПотоков Цикл
			
			Если Строка.СтатусПотока = 0 И Потоки.Найти(Строка.ИдентификаторПотока) = Неопределено Тогда
				Строка.СтатусПотока = -1;
				КУдалению.Добавить(Строка); // сразу удаляем
			КонецЕсли;
			
			МинСтатус = Мин(МинСтатус, Строка.СтатусПотока);
			Если МинСтатус = 1 Тогда
				НовыйУказатель = Истина;
				УказательНачалаВыборки = Строка.ВременнаяМетка;
				КУдалению.Добавить(Строка); // пакет обработан и учтен, можно удалить
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Строка Из КУдалению Цикл
			УказателиПотоков.Удалить(Строка);
		КонецЦикла;
		
		Если НовыйУказатель Тогда
			УказательНачалаВыборки = УказательНачалаВыборки - УказательПогрешностьСмещения();
			ОбновитьПозицию(ИДОперации, УказательНачалаВыборки, РазделОперации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СериализацияСообщений

// Выборка сериализации сообщений. см. СериализацияСообщений
//
// Параметры:
//  Продюсеры - Массив Из СправочникСсылка.кфкПродюсеры - Продюсеры
//  Количество - Число - Количество записей
//  МеткаИзмененияМС - Число - Указатель начала выборки данных
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка исходящих сообщений:
//	* КлючЗаписи - Строка - Владелец сообщения
//	* ДатаРегистрацииМС - Число - Дата регистрации (мс)
//	* МеткаИзмененияМС - Число - Последнее изменение (мс)
Функция ВыборкаСериализацииСообщений(Продюсеры, Количество, МеткаИзмененияМС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОбработкаИсходящихСообщений(Количество);
	Запрос.УстановитьПараметр("Продюсеры", Продюсеры);
	Запрос.УстановитьПараметр("Статус", Перечисления.кфкСтатусыСообщений.Новое);
	Запрос.УстановитьПараметр("МеткаИзмененияМС", МеткаИзмененияМС);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Выборка сериализация сообщений. см. СериализацияСообщений
//
// Параметры:
//  ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
//  Количество - Число - Количество записей
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка исходящих сообщений:
//  * КлючЗаписи - Строка - Владелец сообщения
//  * ДатаРегистрацииМС - Число - Дата регистрации (мс)
//  * ИсходныеДанные - ХранилищеЗначения - Исходные данные
//	* ЭтоУдаление - Булево - Это удаление
//	* Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер
//	* ТипОбъект - Строка - Тип объекта
//	* ТипИсходныхДанных - Строка - Тип исходных данных
//	* КлючОбъекта - Строка - Ключ записи
//	* СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	* ДатаРегистрации - Дата - Дата регистрации
//	* ДатаОбработки - Дата - Дата обработки
//	* ТекстЖурнала - Строка - Текст журнала
//	* КоличествоОбработок - Число - Количество обработок
//	* КоличествоВыгрузок - Число - Количество выгрузок
Функция ВыборкаСериализацияСообщенийВПотоке(ИдентификаторПотока, Количество)
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.ДатаРегистрацииМС КАК ДатаРегистрацииМС,
	|	Т.ИсходныеДанные КАК ИсходныеДанные,
	|	Т.ЭтоУдаление КАК ЭтоУдаление,
	|	Т.Продюсер КАК Продюсер,
	|	Т.ТипОбъект КАК ТипОбъект,
	|	Т.ТипИсходныхДанных КАК ТипИсходныхДанных,
	|	Т.КлючОбъекта КАК КлючОбъекта,
	|	Т.СобытиеРегистрации КАК СобытиеРегистрации,
	|	Т.ДатаРегистрации КАК ДатаРегистрации,
	|	Т.ДатаОбработки КАК ДатаОбработки,
	|	Т.ТекстЖурнала КАК ТекстЖурнала,
	|	Т.КоличествоОбработок КАК КоличествоОбработок,
	|	Т.КоличествоВыгрузок КАК КоличествоВыгрузок
	|ИЗ
	|	РегистрСведений.кфкИсходящиеСообщения КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.кфкОчередьПотоков КАК ОП
	|		ПО Т.КлючЗаписи = ОП.Ключ
	|		И Т.ДатаРегистрацииМС = ОП.ВременнаяМетка
	|		И ОП.ИдентификаторПотока = &ИдентификаторПотока
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.МеткаИзмененияМС";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "1000", XMLСтрока(Количество));
	Запрос.УстановитьПараметр("ИдентификаторПотока", ИдентификаторПотока);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ОбработчикСериализацииСообщений(Выборка, Очереди, ИдентификаторПотока, Правила)
	
	Очередь = НоваяОчередь(Очереди);
	ОчередьПотока = НоваяОчередьПотока(Очереди);
	
	Пока Выборка.Следующий() Цикл
		
		// Инициализация переменных сообщения
		Ключ = "";
		Заголовки = Неопределено;
		Тело = Неопределено;
		// Инициализация переменных журнала
		ТекстЖурнала = "";
		ДлительностьОбработки = 0;
		Статус = Перечисления.кфкСтатусыСообщений.ОшибкаОбработки;
		
		// Применение правил сериализации
		Правило = Правила.Получить(НРег(XMLСтрока(Выборка.Продюсер) + Выборка.ТипОбъект)); // см. НовоеОписаниеПравилОбмена
		Если Правило = Неопределено Тогда
			Статус = Перечисления.кфкСтатусыСообщений.ОшибкаОбработки;
			ТекстЖурнала = НСтр("ru = 'Не задан тип сериализации!'");
			
		Иначе
			Попытка
				
				// Инициализация переменных обработки
				Отказ = Ложь;
				Данные = Неопределено; // Неопределено, СправочникОбъектИмяСправочника, ДокументОбъектИмяДокумента
				Сообщение = Неопределено; // Неопределено, Структура - см. кфкИнтеграция.ПараметрыСообщения
				
				СвойстваСообщений = СвойстваСериализацииСообщений(Выборка);
				ИсходныеДанные = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Выборка.ИсходныеДанные);
				ДопСвойства = Неопределено;
				Если ТипЗнч(ИсходныеДанные) = Тип("Структура") И ИсходныеДанные.Количество() = 2
					И ИсходныеДанные.Свойство("Данные", Данные) И ИсходныеДанные.Свойство("ДополнительныеСвойства", ДопСвойства) Тогда
					Если ТипЗнч(ДопСвойства) = Тип("Структура") И ДопСвойства.Количество() > 0 Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Данные.ДополнительныеСвойства, ДопСвойства, Истина);
					КонецЕсли;
					
				Иначе
					Данные = ИсходныеДанные;
				КонецЕсли;
				
				// Выполнение обработчика
				Если Правило.Тип = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик Тогда
					Сообщение = ВыполнитьПроизвольныйОбработчикСериализации(Правило, Данные, СвойстваСообщений,
						ДлительностьОбработки, ТекстЖурнала, Отказ);
					
				ИначеЕсли Правило.Тип = Перечисления.кфкТипыОбработчиков.КонвертацияДанных Тогда
					Сообщение = ВыполнитьКДОбработчикСериализации(Правило, Данные, СвойстваСообщений,
						ДлительностьОбработки, ТекстЖурнала, Отказ);
					
				Иначе
					Статус = Перечисления.кфкСтатусыСообщений.ОшибкаОбработки;
					ТекстЖурнала = НСтр("ru = 'Не задан тип сериализации!'");
					
				КонецЕсли;
				
				// Результат обработки
				Если Отказ = Истина Тогда // Отказ
					Статус = Перечисления.кфкСтатусыСообщений.ОбработкаОтменена;
					
				ИначеЕсли Сообщение = Неопределено Тогда // Ошибка
					Статус = Перечисления.кфкСтатусыСообщений.ОшибкаОбработки;
					
				Иначе // ОК
					// Статус
					Статус = Перечисления.кфкСтатусыСообщений.Обработано;
					// Заголовки
					Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Сообщение.Заголовки);
					// Тело
					Данные = кфкИнтеграцияСлужебный.ТелоСообщения(Сообщение, ТекстЖурнала); // Неопределено, Строка, ДвоичныеДанные
					Если Данные = Неопределено Тогда
						Статус = Перечисления.кфкСтатусыСообщений.ОшибкаОбработки;
					Иначе
						Тело = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Данные);
					КонецЕсли;
					// КлючСообщения
					Ключ = Сообщение.Ключ;
					
				КонецЕсли;
				
			Исключение
				
				Сообщение = Неопределено;
				ТекстЖурнала = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Отказ = Ложь;
				
			КонецПопытки;
			
		КонецЕсли;
		
		// Запись
		НоваяСтрока = Очередь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Статус = Статус;
		НоваяСтрока.КлючСообщения = Ключ;
		НоваяСтрока.Заголовки = Заголовки;
		НоваяСтрока.ТелоСообщения = Тело;
		НоваяСтрока.ДатаОбработки = ТекущаяДатаСеанса();
		НоваяСтрока.ДлОбработкиМС = ДлительностьОбработки;
		НоваяСтрока.КоличествоОбработок = НоваяСтрока.КоличествоОбработок + 1;
//		НоваяСтрока.ДатаВыгрузки = Неопределено;
		НоваяСтрока.ТекстЖурнала = ДополнитьТекстЖурнала(Выборка.ТекстЖурнала, ТекстЖурнала);
		НоваяСтрока.МеткаИзмененияМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		НоваяСтрока = ОчередьПотока.Добавить();
		НоваяСтрока.Ключ = Выборка.КлючЗаписи;
		НоваяСтрока.ВременнаяМетка = Выборка.ДатаРегистрацииМС;
		НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
		
	КонецЦикла;
	
	// Если разница между первой и последней меткой изменений больше 2 секунд, то обновляем все метки изменений
	Если Очередь[Очередь.Количество()-1].МеткаИзмененияМС - Очередь[0].МеткаИзмененияМС > 2000 Тогда
		ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Для Каждого Строка Из Очередь Цикл
			Строка.МеткаИзмененияМС = ТекущаяДатаМС;
		КонецЦикла;
	КонецЕсли;
	
//	Запись в БД
	Очередь.Записать(РежимЗамещения.Обновление);
	ОчередьПотока.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

// Свойства сериализации сообщений. см. СериализацияСообщений
// 
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса - Выборка исходящих сообщений. см. ВыборкаСериализацииСообщений.
// 
// Возвращаемое значение:
//  Структура - Свойства сериализации сообщений:
// * Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер
// * ТипОбъект - Строка - Тип объект
// * ТипИсходныхДанных - Строка - Тип исходных данных
// * СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
// * КлючРегистрации - Строка - Ключ регистрации
// * ДатаРегистрации - Дата - Дата регистрации
// * ДатаРегистрацииМС - Число - Дата регистрации в миллисекундах
// * ПоследняяОбработка - Дата - Последняя обработка
// * ЭтоУдаление - Булево - Это удаление
// * СсылкаНаОбъект - Неопределено, ЛюбаяСсылка - Ссылка на объект регистрации
Функция СвойстваСериализацииСообщений(Выборка)
	
	Результат = Новый Структура;
	Результат.Вставить("Продюсер", Выборка.Продюсер);
	Результат.Вставить("ТипОбъект", Выборка.ТипОбъект);
	Результат.Вставить("ТипИсходныхДанных", Выборка.ТипИсходныхДанных);
	Результат.Вставить("СобытиеРегистрации", Выборка.СобытиеРегистрации);
	Результат.Вставить("КлючРегистрации", Выборка.КлючЗаписи);
	Результат.Вставить("ДатаРегистрации", Выборка.ДатаРегистрации);
	Результат.Вставить("ДатаРегистрацииМС", Выборка.ДатаРегистрацииМС);
	Результат.Вставить("ПоследняяОбработка", Выборка.ДатаОбработки);
	Результат.Вставить("ЭтоУдаление", Выборка.ЭтоУдаление);
	
	ТипОбъект = СтрЗаменитьПоРегулярномуВыражению(Выборка.ТипИсходныхДанных, "(Object|Ref|RecordSet)\.", ".", Истина);
	ОбъектМД = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ТипОбъект);
	Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Выборка.КлючОбъекта)
			И Не ОбщегоНазначения.ЭтоРегистр(ОбъектМД) Тогда
		
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМД.ПолноеИмя());
		СсылкаНаОбъект = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.КлючОбъекта));
		Результат.Вставить("СсылкаНаОбъект", СсылкаНаОбъект);
		
	Иначе
		Результат.Вставить("СсылкаНаОбъект", Неопределено);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьПроизвольныйОбработчикСериализации(Правило, Данные, СвойстваСообщений, ДлительностьОбработки, ТекстЖурнала, Отказ)
	
	Если ПустаяСтрока(Правило.ИмяМетода) Тогда
		ТекстЖурнала = НСтр("ru = 'Не задан метод сериализации!'");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСериализации = Новый Массив(4); // Массив Из Неопределено, СправочникСсылка, Структура, Строка, Булево
	ПараметрыСериализации[0] = Данные;
	ПараметрыСериализации[1] = СвойстваСообщений;
	ПараметрыСериализации[2] = "";
	ПараметрыСериализации[3] = Ложь;

	НачалоОбработки = ТекущаяУниверсальнаяДатаВМиллисекундах();
	// TODO: ОбщегоНазначения.ВыполнитьМетодОбъекта с БСП 3.1.11
	Сообщение = ОбщегоНазначения.ВызватьФункциюКонфигурации(Правило.ИмяМетода, ПараметрыСериализации); // см. кфкИнтеграция.ПараметрыСообщения
	ДлительностьОбработки = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоОбработки;

	ТекстЖурнала = ПараметрыСериализации[2];
	Отказ = ПараметрыСериализации[3];
	
	Возврат Сообщение;
	
КонецФункции

Функция ВыполнитьКДОбработчикСериализации(Правило, Данные, СвойстваСообщений, ДлительностьОбработки, ТекстЖурнала, Отказ)
	
	КомпонентыОбмена = Правило.КомпонентыОбмена; // Неопределено, Структура - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
	Если Правило.КомпонентыОбмена = Неопределено Тогда
		
		Если ПустаяСтрока(Правило.Формат) Или ПустаяСтрока(Правило.ИмяМодуля) Или ПустаяСтрока(Правило.ИмяПОД) Тогда
			ТекстЖурнала = НСтр("ru = 'Ошибка инициализации компонентов обмена. Не заполнены обязательные поля.'");
			Возврат Неопределено;
		КонецЕсли;
		
		КомпонентыОбмена = кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Отправка"); // Структура
		КомпонентыОбмена.XMLСхема = Правило.Формат;
		КомпонентыОбмена.МенеджерОбмена = ОбщегоНазначения.ОбщийМодуль(Правило.ИмяМодуля);
		кфкОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена);
		
		Правило.КомпонентыОбмена = КомпонентыОбмена;
		
	КонецЕсли;
	
	КомпонентыОбмена.КлючСообщения = "";
	КомпонентыОбмена.СвойстваСообщения = СвойстваСообщений;
	КомпонентыОбмена.ЗаголовкиСообщения.Очистить();
	
	НачалоОбработки = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат = кфкОбменДаннымиXDTOСервер.ПроизвестиВыгрузкуДанных(КомпонентыОбмена, Данные, Правило.ИмяПОД);
	ДлительностьОбработки = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоОбработки;
	
	Отказ = КомпонентыОбмена.ФлагПропустить;
	ТекстЖурнала = СтрСоединить(КомпонентыОбмена.ПротоколКонвертации, "
		|- - - - - - - - - - - - - - - - - - - - - - - - -
		|");
	
	Если Результат = Неопределено Или КомпонентыОбмена.ФлагОшибки Тогда
		Возврат Неопределено;
		
	Иначе
		Сообщение = кфкИнтеграция.ПараметрыСообщения();
		Сообщение.Данные = Результат;
		Сообщение.Ключ = КомпонентыОбмена.КлючСообщения;
		Сообщение.Заголовки = КомпонентыОбмена.ЗаголовкиСообщения;
		
		Возврат Сообщение;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ВыгрузкаСообщений

Функция ИспользоватьПакетнуюПубликацию(Продюсеры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ МИНИМУМ(ЕСТЬNULL(Т2.ИспользоватьПакетнуюПубликацию, ЛОЖЬ))
	|ИЗ
	|	Справочник.кфкПродюсеры КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.кфкПродюсеры КАК Т2
	|		ПО Т1.Родитель = Т2.Ссылка
	|ГДЕ
	|	Т1.Ссылка В (&Продюсеры)";
	Запрос.УстановитьПараметр("Продюсеры", Продюсеры);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка[0], Ложь);
	
КонецФункции

// Выборка отправки данных исходящих сообщений. см. ОтправкаСообщенийВKafka
// 
// Параметры:
//  Продюсеры - Массив Из СправочникСсылка.кфкПродюсеры - Продюсеры
//  Количество - Число - Количество записей
//  МеткаИзмененияМС - Число - Указатель начала выборки данных
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка исходящих сообщений:
//	* КлючЗаписи - Строка - Владелец сообщения
//	* ДатаРегистрацииМС - Число - Дата регистрации (мс)
//	* МеткаИзмененияМС - Число - Последнее изменение (мс)
Функция ВыборкаОтправкиИсходящихСообщений(Продюсеры, Количество, МеткаИзмененияМС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОбработкаИсходящихСообщений(Количество);
	Запрос.УстановитьПараметр("Продюсеры", Продюсеры);
	Запрос.УстановитьПараметр("Статус", Перечисления.кфкСтатусыСообщений.Обработано);
	Запрос.УстановитьПараметр("МеткаИзмененияМС", МеткаИзмененияМС);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Выборка отправки данных исходящих сообщений. см. ОтправкаСообщенийВKafka
// 
// Параметры:
//	ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
//	Количество - Число - Количество записей
//	ПакетнаяПубликация - Булево - Использовать пакетную публикацию
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка исходящих сообщений:
//  * КлючЗаписи - Строка - Владелец сообщения
//  * ДатаРегистрацииМС - Число - Дата регистрации (мс)
//  * ИсходныеДанные - ХранилищеЗначения - Исходные данные
//	* ЭтоУдаление - Булево - Это удаление
//	* КлючСообщения - Строка - Ключ сообщения
//	* Заголовки - ХранилищеЗначения - Исходные данные
//	* ТелоСообщения - ХранилищеЗначения - Исходные данные
//	* Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер
//	* ТипОбъект - Строка - Тип объекта
//	* ТипИсходныхДанных - Строка - Тип исходных данных
//	* КлючОбъекта - Строка - Ключ записи
//	* СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	* ДатаРегистрации - Дата - Дата регистрация
//	* ДатаОбработки - Дата - Дата обработки
//	* ДлОбработкиМС - Число - Длительность обработки в миллисекундах
//	* ТекстЖурнала - Строка - Текст журнала
//	* КоличествоОбработок - Число - Количество обработок
//	* КоличествоВыгрузок - Число - Количество выгрузок
Функция ВыборкаОтправкиИсходящихСообщенийВПотоке(ИдентификаторПотока, Количество, ПакетнаяПубликация)
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.ДатаРегистрацииМС КАК ДатаРегистрацииМС,
	|	Т.ИсходныеДанные КАК ИсходныеДанные,
	|	Т.ЭтоУдаление КАК ЭтоУдаление,
	|	Т.КлючСообщения КАК КлючСообщения,
	|	Т.Заголовки КАК Заголовки,
	|	Т.ТелоСообщения КАК ТелоСообщения,
	|	Т.Продюсер КАК Продюсер,
	|	Т.ТипОбъект КАК ТипОбъект,
	|	Т.ТипИсходныхДанных КАК ТипИсходныхДанных,
	|	Т.КлючОбъекта КАК КлючОбъекта,
	|	Т.СобытиеРегистрации КАК СобытиеРегистрации,
	|	Т.ДатаРегистрации КАК ДатаРегистрации,
	|	Т.ДатаОбработки КАК ДатаОбработки,
	|	Т.ДлОбработкиМС КАК ДлОбработкиМС,
	|	Т.ТекстЖурнала КАК ТекстЖурнала,
	|	Т.КоличествоОбработок КАК КоличествоОбработок,
	|	Т.КоличествоВыгрузок КАК КоличествоВыгрузок
	|ИЗ
	|	РегистрСведений.кфкИсходящиеСообщения КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.кфкОчередьПотоков КАК ОП
	|		ПО Т.КлючЗаписи = ОП.Ключ
	|		И Т.ДатаРегистрацииМС = ОП.ВременнаяМетка
	|		И ОП.ИдентификаторПотока = &ИдентификаторПотока
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.МеткаИзмененияМС";
	
	Если ПакетнаяПубликация Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ИТОГИ
		|ПО
		|	Продюсер,
		|	ТипОбъект";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "1000", XMLСтрока(Количество));
	Запрос.УстановитьПараметр("ИдентификаторПотока", ИдентификаторПотока);
	
	ОбходЗапроса = ?(ПакетнаяПубликация, ОбходРезультатаЗапроса.ПоГруппировкам, ОбходРезультатаЗапроса.Прямой);
	Возврат Запрос.Выполнить().Выбрать(ОбходЗапроса);
	
КонецФункции

Процедура ОбработчикОтправкиИсходящихСообщений(Выборка, Сессии, Очереди, ИдентификаторПотока, Топики)
	
	Очередь = НоваяОчередь(Очереди);
	ОчередьПотока = НоваяОчередьПотока(Очереди);
	
	Пока Выборка.Следующий() Цикл
		
		ТекстЖурнала = "";
		ИмяТопика = Топики.Получить(НРег(XMLСтрока(Выборка.Продюсер) + Выборка.ТипОбъект)); // Строка
		Если ПустаяСтрока(ИмяТопика) Тогда
			Статус = Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки;
			ТекстЖурнала = НСтр("ru = 'Отсутствует имя топика!'");
			
		Иначе
			Сообщение = кфкИнтеграция.ПараметрыСообщения();
			//@skip-check statement-type-change
			Сообщение.Данные = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Выборка.ТелоСообщения);
			//@skip-check statement-type-change
			Сообщение.Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Выборка.Заголовки);
			Сообщение.Ключ = ?(ПустаяСтрока(Выборка.КлючСообщения), Выборка.КлючОбъекта, Выборка.КлючСообщения);
			
			Результат = кфкИнтеграцияСлужебный.Отправить(Выборка.Продюсер, ИмяТопика, Сообщение, -1, Сессии); // см. кфкИнтеграция.РезультатИнтеграции
			Если Результат.Успешно Тогда
				Статус = Перечисления.кфкСтатусыСообщений.Выгружено;
				
			Иначе
				Статус = Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки;
				ТекстЖурнала = Результат.ТекстОшибки; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Запись
		НоваяСтрока = Очередь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Статус = Статус;
		НоваяСтрока.ДатаВыгрузки = ТекущаяДатаСеанса();
		НоваяСтрока.ТекстЖурнала = ДополнитьТекстЖурнала(Выборка.ТекстЖурнала, ТекстЖурнала);
		НоваяСтрока.КоличествоВыгрузок = НоваяСтрока.КоличествоВыгрузок + 1;
		НоваяСтрока.МеткаИзмененияМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		НоваяСтрока = ОчередьПотока.Добавить();
		НоваяСтрока.Ключ = Выборка.КлючЗаписи;
		НоваяСтрока.ВременнаяМетка = Выборка.ДатаРегистрацииМС;
		НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
		
	КонецЦикла;
	
//	Запись в БД
	Очередь.Записать(РежимЗамещения.Обновление);
	ОчередьПотока.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

// Обработчик отправки пакет исходящих сообщений.
// 	см. ОтправитьПакетСообщений - метод не может гарантировать доставку всех сообщений, а использование транзакций не оправдано (ВК 1.8.1)
// 
// Параметры:
//	Выборка - см. ВыборкаОтправкиИсходящихСообщенийВПотоке
//	Сессии - Соответствие Из КлючИЗначение - Сессии
//	Очереди - Структура - Очереди
//	ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
//	Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер
//	ИмяТопика - Строка - Имя топика
//@skip-check module-unused-method
Процедура ОбработчикОтправкиПакетИсходящихСообщений(Выборка, Сессии, Очереди, ИдентификаторПотока, Продюсер, ИмяТопика)
	
	// Проверка наличия имени топика
	Если ПустаяСтрока(ИмяТопика) Тогда
		ОбработчикОтправкиПакетИсходящихСообщенийЗаписатьОшибку(Выборка, Очереди, ИдентификаторПотока,
			НСтр("ru = 'Отсутствует имя топика!'"));
		Возврат;
	КонецЕсли;
	
	// Инициализация набора записей
	Очередь = НоваяОчередь(Очереди);
	ОчередьПотока = НоваяОчередьПотока(Очереди);
	
	// Инициализация значений очереди БД
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	// Инициализация значений очереди Kafka
	Сообщения = Новый Массив; // Массив Из Структура
	
	// Обработка очереди БД
	НачатьТранзакцию();
	Попытка
		
		// Формируем пакет сообщений
		Пока Выборка.Следующий() Цикл
			
			// Запись
			НоваяСтрока = Очередь.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Выгружено;
			НоваяСтрока.ДатаВыгрузки = ТекущаяДата;
			НоваяСтрока.КоличествоВыгрузок = НоваяСтрока.КоличествоВыгрузок + 1;
			НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
			НоваяСтрока = ОчередьПотока.Добавить();
			НоваяСтрока.Ключ = Выборка.КлючЗаписи;
			НоваяСтрока.ВременнаяМетка = Выборка.ДатаРегистрацииМС;
			НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
			
			// Добавление сообщения в оперативную очередь
			Сообщение = Новый Структура;
			Сообщение.Вставить("key", ?(ПустаяСтрока(Выборка.КлючСообщения), Выборка.КлючОбъекта, Выборка.КлючСообщения));
			Сообщение.Вставить("partition", -1);
			Сообщение.Вставить("message", кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Выборка.ТелоСообщения));
			Сообщение.Вставить("headers", кфкИнтеграцияСлужебный.ЗаголовкиПакетногоСообщения(
				кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Выборка.Заголовки)));
			Сообщения.Добавить(Сообщение);
			
		КонецЦикла;
		
		// Запись в БД
		Очередь.Записать(РежимЗамещения.Обновление);
		ОчередьПотока.Записать(РежимЗамещения.Удаление);
		
		// Отправка в Kafka
		Результат = кфкИнтеграцияСлужебный.ОтправитьПакетСообщений(Продюсер, ИмяТопика, Сообщения, Сессии); // см. кфкИнтеграция.РезультатИнтеграции
		Если Результат.Успешно Тогда
			ЗафиксироватьТранзакцию();
			
		Иначе
			ОтменитьТранзакцию();
			ОбработчикОтправкиПакетИсходящихСообщенийЗаписатьОшибку(Выборка, Очереди, ИдентификаторПотока, Результат.ТекстОшибки);
			
		КонецЕсли;
		
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбработчикОтправкиПакетИсходящихСообщенийЗаписатьОшибку(Выборка, Очереди, ИдентификаторПотока, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработчикОтправкиПакетИсходящихСообщенийЗаписатьОшибку(Выборка, Очереди, ИдентификаторПотока, ТекстЖурнала)
	
	// Инициализация набора записей
	Очередь = НоваяОчередь(Очереди);
	ОчередьПотока = НоваяОчередьПотока(Очереди);
	
	// Инициализация значений очереди БД
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		
		// Запись
		НоваяСтрока = Очередь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки;
		НоваяСтрока.ДатаВыгрузки = ТекущаяДата;
		НоваяСтрока.ТекстЖурнала = ДополнитьТекстЖурнала(Выборка.ТекстЖурнала, ТекстЖурнала);
		НоваяСтрока.КоличествоВыгрузок = НоваяСтрока.КоличествоВыгрузок + 1;
		НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
		
		НоваяСтрока = ОчередьПотока.Добавить();
		НоваяСтрока.Ключ = Выборка.КлючЗаписи;
		НоваяСтрока.ВременнаяМетка = Выборка.ДатаРегистрацииМС;
		НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
		
	КонецЦикла;
	
	// Запись в БД
	Очередь.Записать(РежимЗамещения.Обновление);
	ОчередьПотока.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаСообщений

Функция КомандаЗагрузкаСообщенийАктивно()
	Возврат "ЗАГРУЗКА-СООБЩЕНИЙ-АКТИВНО";
КонецФункции

Функция ЕстьКомандаЗагрузкиСообщений(ИдентификаторПотока)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РегистрСведений.кфкОчередьПотоков.Ключ ГДЕ Ключ = &Ключ И ИдентификаторПотока = &ИдентификаторПотока";
	Запрос.УстановитьПараметр("Ключ", КомандаЗагрузкаСообщенийАктивно());
	Запрос.УстановитьПараметр("ИдентификаторПотока", ИдентификаторПотока);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Возвращает таблицу распределения чтения консьюмеров
// 
// Параметры:
//	Консьюмеры - Массив Из СправочникСсылка.кфкКонсьюмеры - Консьюмеры
//	СтратегияРаспределения - Структура - Стратегия распределения:
//	 * ПодпотокиТранспорта - Число - Допустимое число вложенных потоков обработки
//	 * МинРазмерПакета - Число - Минимальный количество сообщений в очереди потока
//	 * МаксРазмерПакета - Число - Максимальное количество сообщений в очереди потока
//	СостояниеОчереди - Число - Текущий размер очереди
//	КЭШ - Неопределено, Структура - Кэш
// 
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица распределения чтения консьюмеров:
//	 * Консьюмер - СправочникСсылка.кфкКонсьюмеры - Консьюмер
//	 * НомерПотока - Число - Номер потока
Функция ТаблицаРаспределенияЧтенияКонсьюмеров(Консьюмеры, СтратегияРаспределения, СостояниеОчереди, КЭШ)
	
	Если Не КЭШ.Свойство("Коннектор") Тогда
		КЭШ.Вставить("ТочкиПолучения", Справочники.кфкКонсьюмеры.ТочкиПолученияСообщений(Консьюмеры));
		КЭШ.Вставить("Коннектор", Обработки.кфкИнтеграция.Создать());
		КЭШ.Вставить("ПартицииКонсьюмеров", Новый Соответствие);
		
		ИсторияОчереди = Новый ТаблицаЗначений;
		ИсторияОчереди.Колонки.Добавить("Консьюмер", Новый ОписаниеТипов("СправочникСсылка.кфкКонсьюмеры"));
		ИсторияОчереди.Колонки.Добавить("РазмерОчереди", Новый ОписаниеТипов("Число"));
		ИсторияОчереди.Колонки.Добавить("ВремяЗамера", Новый ОписаниеТипов("Дата"));
		ИсторияОчереди.Индексы.Добавить("Консьюмер");
		КЭШ.Вставить("ИсторияОчереди", ИсторияОчереди);
		
	КонецЕсли;
	ТочкиПолучения = КЭШ.ТочкиПолучения; // см. Справочники.кфкКонсьюмеры.ТочкиПолученияСообщений
	Коннектор = КЭШ.Коннектор;
	ИсторияОчереди = КЭШ.ИсторияОчереди;
	ПартицииКонсьюмеров = КЭШ.ПартицииКонсьюмеров;
	
	СостояниеОчереди = 0;
	
	// Сбор статистики - отставание консьюмеров
	Для Каждого КлючЗначение Из ТочкиПолучения Цикл
		Точка = КлючЗначение.Значение;
		
		НоваяСтрока = ИсторияОчереди.Добавить();
		НоваяСтрока.Консьюмер = КлючЗначение.Ключ;
		НоваяСтрока.ВремяЗамера = ТекущаяУниверсальнаяДата();
		
		КоличествоПартиций = 0;
		
		Для Каждого ИмяТопика Из Точка.Топики Цикл
			Отставание = Коннектор.ПолучитьОтставаниеКонсьюмера(Точка.АдресБрокера, ИмяТопика, Точка.Идентификатор); // Структура
			Если Отставание <> Неопределено Тогда
				НоваяСтрока.РазмерОчереди = НоваяСтрока.РазмерОчереди + Число(Отставание.total_lag);
				Значение = Неопределено; // Структура
				КоличествоПартиций = КоличествоПартиций + ?(Отставание.Свойство("partitions", Значение),
					Значение.Количество(), 0);
			КонецЕсли;
		КонецЦикла;
		
		ПартицииКонсьюмеров.Вставить(КлючЗначение.Ключ, Макс(1, КоличествоПартиций));
		
		СостояниеОчереди = СостояниеОчереди + НоваяСтрока.РазмерОчереди;
		
	КонецЦикла;
	
	// Удаление устаревших записей статистики
	ИнтервалРасчета = 300; // 5 мин
	НачалоПериодаРасчета = ТекущаяУниверсальнаяДата() - ИнтервалРасчета;
	ИсторияОчереди.Сортировать("ВремяЗамера Возр");
	Пока ИсторияОчереди.Количество() > 0 И ИсторияОчереди[0].ВремяЗамера < НачалоПериодаРасчета Цикл
		ИсторияОчереди.Удалить(0);
	КонецЦикла;
	
	// Агрегация статистики
	ИсторияОчереди.Сортировать("РазмерОчереди Убыв");
	Статистика = Новый ТаблицаЗначений;
	Статистика.Колонки.Добавить("Консьюмер", Новый ОписаниеТипов("СправочникСсылка.кфкКонсьюмеры"));
	Статистика.Колонки.Добавить("РазмерОчереди", Новый ОписаниеТипов("Число"));
	Статистика.Колонки.Добавить("Партиций", Новый ОписаниеТипов("Число"));
	Статистика.Колонки.Добавить("СредРазмер", Новый ОписаниеТипов("Число"));
	Для Каждого КлючЗначение Из ПартицииКонсьюмеров Цикл
		
		НоваяСтрока = Статистика.Добавить();
		НоваяСтрока.Консьюмер = КлючЗначение.Ключ;
		НоваяСтрока.Партиций = КлючЗначение.Значение;
		
		// Агрегация
		Строки = ИсторияОчереди.НайтиСтроки(Новый Структура("Консьюмер", КлючЗначение.Ключ));
		НоваяСтрока.РазмерОчереди = ?(Строки.Количество() = 0, 0, Строки[0].РазмерОчереди); // Максимальное значение
		
		// Считаем "тяжесть" каждого консьюмера
		НоваяСтрока.СредРазмер = НоваяСтрока.РазмерОчереди / КлючЗначение.Значение;
		
	КонецЦикла;
	
	// Средний размер очереди
	ОбщийКоэффициентРазмера = 0.7; // Степень распределения, 0.5 - агрессивная группировка (больше топиков в одном потоке), 0.8-0.9 - консервативная (чаще разделяем)
	МаксРазмерПакета = Макс(Статистика.Итог("СредРазмер") / СтратегияРаспределения.ПодпотокиТранспорта
		* ОбщийКоэффициентРазмера, СтратегияРаспределения.МаксРазмерПакета / 10);
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Консьюмер", Новый ОписаниеТипов("СправочникСсылка.кфкКонсьюмеры"));
	Результат.Колонки.Добавить("НомерПотока", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СредРазмер", Новый ОписаниеТипов("Число"));
	
	МаксНомерПотока = 0;
	
	// Распределяем консьюмеры по потокам
	Статистика.Сортировать("СредРазмер Убыв"); // от большего к меньшему
	Для Каждого Строка Из Статистика Цикл
		
		КоличествоПотоков = ?(Строка.СредРазмер < МаксРазмерПакета, 1,
			Мин(Окр(Строка.СредРазмер / МаксРазмерПакета, 0, РежимОкругления.Окр15как20), Строка.Партиций));
		СредРазмер = Строка.СредРазмер / КоличествоПотоков;
		Для Номер = 1 По КоличествоПотоков Цикл
			
			Результат.Сортировать("СредРазмер Возр, НомерПотока Возр");
			НомерПотока = ?(Результат.Количество() > 0 И Результат[0].СредРазмер + СредРазмер < МаксРазмерПакета
					Или МаксНомерПотока = СтратегияРаспределения.ПодпотокиТранспорта,
				Результат[0].НомерПотока, МаксНомерПотока + 1);
			МаксНомерПотока = Макс(МаксНомерПотока, НомерПотока);
			
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.Консьюмер = Строка.Консьюмер;
			НоваяСтрока.НомерПотока = НомерПотока;
			НоваяСтрока.СредРазмер = СредРазмер;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Результат.Колонки.Удалить("СредРазмер");
	Результат.Индексы.Добавить("НомерПотока");
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьРаспределениеКонсьюмеров(Распределение, Потоки, Очередь1, Очередь2, ОчередьПотоков)
	
	// Сбросим состояние наборов записей
	Очередь1.Очистить();
	Очередь2.Очистить();
	Очередь1.Отбор.Сбросить();
	Очередь2.Отбор.Сбросить();
					
	// Удаляем неиспользуемые потоки
	Ключи = ОбщегоНазначения.ВыгрузитьКолонку(ОчередьПотоков, "Ключ");
	Для Каждого Ключ Из ОбщегоНазначенияКлиентСервер.РазностьМассивов(Ключи, Потоки) Цикл
		ОчередьПотоков.Удалить(Ключ);
	КонецЦикла;
	
	Для Индекс = 0 По Потоки.ВГраница() Цикл
		
		ИдентификаторПотока = Потоки[Индекс];
		
		// Текущее состояние РС.ОчередьПотоков
		Консьюмеры = ОчередьПотоков.Получить(ИдентификаторПотока); // Массив Из СправочникСсылка.кфкКонсьюмеры
		Если Консьюмеры = Неопределено Тогда
			Консьюмеры = Новый Массив;
			ОчередьПотоков.Вставить(ИдентификаторПотока, Консьюмеры);
		КонецЕсли;
		
		КУдалению = ОбщегоНазначения.СкопироватьРекурсивно(Консьюмеры, Ложь);
		
		// Добавляем новые консьюмеры
		Для Каждого Строка Из Распределение.НайтиСтроки(Новый Структура("НомерПотока", Индекс+1)) Цикл
			
			Если Консьюмеры.Найти(Строка.Консьюмер) = Неопределено Тогда
				
				НоваяСтрока = Очередь1.Добавить();
				НоваяСтрока.Ключ = XMLСтрока(Строка.Консьюмер);
				НоваяСтрока.ВременнаяМетка = 0;
				НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
				
				Консьюмеры.Добавить(Строка.Консьюмер);
				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(КУдалению, Строка.Консьюмер);
			
		КонецЦикла;
		
		// Удаляем старые консьюмеры
		Для Каждого Консьюмер Из КУдалению Цикл
			
			НоваяСтрока = Очередь2.Добавить();
			НоваяСтрока.Ключ = XMLСтрока(Консьюмер);
			НоваяСтрока.ВременнаяМетка = 0;
			НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
			
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(Консьюмеры, Консьюмер);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Записываем изменения
	Если Очередь1.Количество() > 0 Тогда
		Очередь1.Записать(РежимЗамещения.Добавление);
	КонецЕсли;
	Если Очередь2.Количество() > 0 Тогда
		Очередь2.Записать(РежимЗамещения.Удаление);
	КонецЕсли;
	
КонецПроцедуры

Функция ОчередьПотоковЗагрузкиСообщений()
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Т2.Ключ КАК Ключ,
		|	Т2.ИдентификаторПотока КАК ИдентификаторПотока
		|ИЗ
		|	РегистрСведений.кфкОчередьПотоков КАК Т1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.кфкОчередьПотоков КАК Т2
		|		ПО Т1.ИдентификаторПотока = Т2.ИдентификаторПотока
		|		И Т1.Ключ <> Т2.Ключ
		|		И Т1.Ключ = &Ключ
		|ИТОГИ
		|ПО
		|	ИдентификаторПотока";
	Запрос.УстановитьПараметр("Ключ", КомандаЗагрузкаСообщенийАктивно());
	ВыборкаПотока = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПотока.Следующий() Цикл
		
		Список = Новый Массив; // Массив Из СправочникСсылка.кфкКонсьюмеры
		Выборка = ВыборкаПотока.Выбрать();
		Пока Выборка.Следующий() Цикл
			Список.Добавить(Справочники.кфкКонсьюмеры.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка[0])));
		КонецЦикла;
		
		Результат.Вставить(ВыборкаПотока[1], Список);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает консьюмеры для загрузки сообщений.
// 
// Параметры:
//	ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
// 
// Возвращаемое значение:
//	Массив Из СправочникСсылка.кфкКонсьюмеры - Консьюмеры для загрузки сообщений
Функция КонсьюмерыЗагрузкиСообщений(ИдентификаторПотока)
	
	Результат = Новый Массив; // Массив Из СправочникСсылка.кфкКонсьюмеры
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РегистрСведений.кфкОчередьПотоков.Ключ ГДЕ ИдентификаторПотока = &ИдентификаторПотока";
	Запрос.УстановитьПараметр("ИдентификаторПотока", ИдентификаторПотока);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка[0] <> КомандаЗагрузкаСообщенийАктивно() Тогда
			Результат.Добавить(Справочники.кфкКонсьюмеры.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка[0])));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Закрыть сессии консьюмера параллельного потока.
// 
// Параметры:
//	Сессии - Соответствие Из КлючИЗначение - Сессии:
//	 * Ключ - СправочникСсылка.кфкКонсьюмеры - Консьюмер
//	 * Значение - ОбработкаОбъект.кфкИнтеграция - Сессия
//	Консьюмеры - Массив Из СправочникСсылка.кфкКонсьюмеры - Консьюмеры
Процедура ЗакрытьСессииКонсьюмераПараллельногоПотока(Сессии, Консьюмеры)
	
	КУдалению = Новый Соответствие;
	Для Каждого Сессия Из Сессии Цикл
		
		Если Консьюмеры.Найти(Сессия.Ключ) = Неопределено Тогда
			КУдалению.Вставить(Сессия.Ключ, Сессия.Значение);
			Сессии.Удалить(Сессия.Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
	кфкИнтеграцияСлужебный.ЗакрытьСессииКонсьюмера(КУдалению);
	
КонецПроцедуры

// Устарела. Обработчик загрузки сообщений.
// 
// Параметры:
//	Консьюмеры - Массив Из СправочникСсылка.кфкКонсьюмеры - Консьюмеры
//	Сессии - Соответствие Из КлючИЗначение - Сессии
//	Очередь - РегистрСведенийНаборЗаписей.кфкВходящиеСообщения - Очередь
//	РазмерПакета - Число - Размер пакета
//	Загружено - Булево - Загружено
//@skip-check module-unused-method
Процедура ОбработчикЗагрузкиСообщений(Консьюмеры, Сессии, Очередь, РазмерПакета, Загружено)
	
	Загружено = Ложь;
	
	Для Каждого Консьюмер Из Консьюмеры Цикл
		
		Очередь.Очистить();
		
		Сообщение = Неопределено;
		
		Для НомерСообщений = 1 По РазмерПакета Цикл
			
			Результат = кфкИнтеграцияСлужебный.Прочитать(Консьюмер, Ложь, Сессии); // см. кфкИнтеграция.РезультатИнтеграции
			Если Результат.Успешно = Ложь Тогда
				ОповеститьОбОшибкиЧтения(Консьюмер, Результат.ТекстОшибки);
				кфкИнтеграцияСлужебный.ЗакрытьСессииКонсьюмера(Сессии);
				ВызватьИсключение Результат.ТекстОшибки;
				
			ИначеЕсли Результат.Сообщение = Неопределено Тогда
				Прервать;
				
			Иначе
				ТекущаяДата = ТекущаяДатаСеанса();
				ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
				
				Сообщение = Результат.Сообщение;
				
				Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
				Хеш.Добавить(XMLСтрока(Консьюмер));
				Хеш.Добавить(НРег(Сообщение.Топик));
				Хеш.Добавить(НРег(Сообщение.Ключ));
				
				НоваяСтрока = Очередь.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Сообщение, "Топик,Раздел,Смещение");
				НоваяСтрока.КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
				НоваяСтрока.ДатаЗагрузкиМС = ТекущаяДатаМС;
				НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Новое; 
				НоваяСтрока.Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Сообщение.Заголовки);
				НоваяСтрока.ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Сообщение.Тело);
				НоваяСтрока.Консьюмер = Консьюмер;
				НоваяСтрока.КлючСообщения = Сообщение.Ключ;
				НоваяСтрока.ДатаЗаписи = МестноеВремя(Дата(1970, 1, 1, 0, 0, 0) + Сообщение.ВременнаяМетка);
				НоваяСтрока.ДатаЗагрузки = ТекущаяДата;
				НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// сохраняем результат чтения
		Если Очередь.Количество() > 0 Тогда
			
			НачатьТранзакцию();
			Попытка
				
				Очередь.Записать(РежимЗамещения.Добавление);
				
				// Зафиксировать смещение в Кафке
				Если Не Сообщение = Неопределено Тогда
					Результат = кфкИнтеграцияСлужебный.ЗафиксироватьСмещение(Консьюмер, Сессии, Сообщение); // Сообщение - последнее полученное сообщение
					Если Не Результат.Успешно Тогда
						ВызватьИсключение Результат.ТекстОшибки;
					КонецЕсли;
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				кфкИнтеграцияСлужебный.ЗакрытьСессииКонсьюмера(Сессии);
				
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ОповеститьОбОшибкиЧтения(Консьюмер, ТекстОшибки);
				ВызватьИсключение ТекстОшибки;
				
			КонецПопытки;
			
			Загружено = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик загрузки пакет сообщений.
// 
// Параметры:
//	Консьюмеры - Массив Из СправочникСсылка.кфкКонсьюмеры - Консьюмеры
//	Сессии - Соответствие Из КлючИЗначение - Сессии
//	Очередь - РегистрСведенийНаборЗаписей.кфкВходящиеСообщения - Очередь
//	РазмерПакета - Число - Размер пакета
//	Загружено - Булево - Загружено
Процедура ОбработчикЗагрузкиПакетСообщений(Консьюмеры, Сессии, Очередь, РазмерПакета, Загружено)
	
	Загружено = Ложь;
	
	Для Каждого Консьюмер Из Консьюмеры Цикл
			
		Результат = кфкИнтеграцияСлужебный.ПрочитатьПакетСообщений(Консьюмер, Истина, РазмерПакета, Сессии); // см. кфкИнтеграция.РезультатИнтеграции
		Если Результат.Успешно = Ложь Тогда
			ОповеститьОбОшибкиЧтения(Консьюмер, Результат.ТекстОшибки);
			кфкИнтеграцияСлужебный.ЗакрытьСессииКонсьюмера(Сессии);
			ВызватьИсключение Результат.ТекстОшибки;
			
		ИначеЕсли Результат.Сообщения.Количество() > 0 Тогда
			
			// Инициализация
			Очередь.Очистить();
			ТекущаяДата = ТекущаяДатаСеанса();
			ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
			НомерСообщения = 0;
			
			// Перебор сообщений
			Для Каждого Сообщение Из Результат.Сообщения Цикл
				НомерСообщения = НомерСообщения + 1;
				
				// ключ сообщения
				Ключ = "";
				Если Не Сообщение.Свойство("key", Ключ) Тогда
					СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Сообщение.message);
					ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
					ХешОбъекта.Добавить(СтрокаXML);
					Ключ = ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма);
				КонецЕсли;
				
				Заголовки = Новый Соответствие;
				Если Сообщение.Свойство("headers") Тогда
					//@skip-check property-return-type
					Для Каждого header Из Сообщение.headers Цикл
						Заголовки.Вставить(header.key, header.value);
					КонецЦикла;
				КонецЕсли;
				
				Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
				Хеш.Добавить(XMLСтрока(Консьюмер));
				Хеш.Добавить(НРег(Сообщение.topic));
				Хеш.Добавить(НРег(Ключ));
				
				НоваяСтрока = Очередь.Добавить();
				НоваяСтрока.КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
				НоваяСтрока.ДатаЗагрузкиМС = ТекущаяДатаМС + НомерСообщения / 10000;
				
				НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Новое; 
				НоваяСтрока.Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Заголовки);
				НоваяСтрока.ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Сообщение.message);
				
				НоваяСтрока.Консьюмер = Консьюмер;
				НоваяСтрока.Топик = Сообщение.topic;
				НоваяСтрока.Раздел = Сообщение.partition;
				НоваяСтрока.Смещение = Сообщение.offset;
				НоваяСтрока.КлючСообщения = Ключ;
				НоваяСтрока.ДатаЗаписи = МестноеВремя(Дата(1970, 1, 1, 0, 0, 0) + Сообщение.timestamp / 1000);
				НоваяСтрока.ДатаЗагрузки = ТекущаяДата;
				НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
				
			КонецЦикла;
			
			// Фиксируем сообщения
			Очередь.Записать(РежимЗамещения.Добавление);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ДесериализацияСообщений

// Выборка десериализации сообщений. см. ДесериализацияСообщений
// 
// Параметры:
//  Консьюмеры - Массив из СправочникСсылка.кфкКонсьюмеры - Консьюмеры
//  Количество - Число - Количество записей
//  МеткаИзмененияМС - Число - Указатель начала выборки данных
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка исходящих сообщений:
//	* КлючЗаписи - Строка - Ключ записи
//	* ДатаЗагрузкиМС - Число - Дата загрузки из брокер (мс)
//	* МеткаИзмененияМС - Число - Последнее изменение (мс)
Функция ВыборкаДесериализацииСообщений(Консьюмеры, Количество, МеткаИзмененияМС)
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС,
	|	Т.МеткаИзмененияМС КАК МеткаИзмененияМС
	|ИЗ
	|	РегистрСведений.кфкВходящиеСообщения КАК Т
	|ГДЕ
	|	Т.Консьюмер В (&Консьюмеры)
	|	И Т.МеткаИзмененияМС >= &МеткаИзмененияМС
	|	И НЕ 0 В
	|		(ВЫБРАТЬ
	|			0
	|		ИЗ
	|			РегистрСведений.кфкОчередьПотоков КАК ОП
	|		ГДЕ
	|			ОП.Ключ = Т.КлючЗаписи)
	|	И Т.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.МеткаИзмененияМС";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "1000", XMLСтрока(Количество));
	Запрос.УстановитьПараметр("Консьюмеры", Консьюмеры);
	Запрос.УстановитьПараметр("МеткаИзмененияМС", МеткаИзмененияМС);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Выборка десериализации сообщений. см. ДесериализацияСообщений
// 
// Параметры:
//  ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
//  Количество - Число - Количество записей
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка исходящих сообщений:
//	* Консьюмер - СправочникСсылка.кфкКонсьюмеры - Консьюмер
//	* Топик - Строка - Топик
//	* Раздел - Строка - Раздел
//	* Смещение - Строка - Смещение
//	* КлючСообщения - Строка - Ключ
//	* КлючЗаписи - Строка - Владелец сообщения
//	* Заголовки - ХранилищеЗначения - Заголовки
//	* ТелоСообщения - ХранилищеЗначения - Тело
//	* ДатаЗаписи - Дата - Дата записи в брокер
//	* ДатаЗагрузки - Дата - Дата загрузки
//	* ДатаЗагрузкиМС - Число - Дата загрузки из брокер (мс)
//	* ДатаОбработки - Дата - Дата загрузки
//	* ТекстЖурнала - Строка - Текст журнала
//	* КоличествоОбработок - Число - Количество обработок
Функция ВыборкаДесериализацииСообщенийВПотоке(ИдентификаторПотока, Количество)
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Т.Консьюмер КАК Консьюмер,
	|	Т.Топик КАК Топик,
	|	Т.Раздел КАК Раздел,
	|	Т.Смещение КАК Смещение,
	|	Т.КлючСообщения КАК КлючСообщения,
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.Заголовки КАК Заголовки,
	|	Т.ТелоСообщения КАК ТелоСообщения,
	|	Т.ДатаЗаписи КАК ДатаЗаписи,
	|	Т.ДатаЗагрузки КАК ДатаЗагрузки,
	|	Т.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС,
	|	Т.ДатаОбработки КАК ДатаОбработки,
	|	Т.ТекстЖурнала КАК ТекстЖурнала,
	|	Т.КоличествоОбработок КАК КоличествоОбработок
	|ИЗ
	|	РегистрСведений.кфкВходящиеСообщения КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.кфкОчередьПотоков КАК ОП
	|		ПО Т.КлючЗаписи = ОП.Ключ
	|		И Т.ДатаЗагрузкиМС = ОП.ВременнаяМетка
	|		И ОП.ИдентификаторПотока = &ИдентификаторПотока";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "1000", XMLСтрока(Количество));
	Запрос.УстановитьПараметр("ИдентификаторПотока", ИдентификаторПотока);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ОбработчикДесериализацииСообщений(Выборка, Очереди, ИдентификаторПотока, Правила)
	
	Очередь = НоваяОчередь(Очереди);
	ОчередьПотока = НоваяОчередьПотока(Очереди);
	
	Пока Выборка.Следующий() Цикл
		
		// Инициализация переменных журнала
		ТекстЖурнала = "";
		ДлительностьОбработки = 0;
		Статус = Перечисления.кфкСтатусыСообщений.ОшибкаОбработки;
		
		// Применение правил сериализации
		Правило = Правила.Получить(НРег(XMLСтрока(Выборка.Консьюмер) + Выборка.Топик)); // см. НовоеОписаниеПравилОбмена
		Если Правило = Неопределено Тогда
			Статус = Перечисления.кфкСтатусыСообщений.ОшибкаОбработки;
			ТекстЖурнала = НСтр("ru = 'Не задан тип десериализации!'");
			
		Иначе
			Попытка
				// Инициализация переменных обработки
				Отказ = Ложь;
				Успешно = Ложь;
				ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Выборка.ТелоСообщения);
				СвойстваСообщений = СвойстваВходящихСообщений(Выборка);
				
				// Выполнение обработчика
				Если Правило.Тип = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик Тогда
					Успешно = ВыполнитьПроизвольныйОбработчикДесериализации(Правило, ТелоСообщения, СвойстваСообщений,
						ДлительностьОбработки, ТекстЖурнала, Отказ);
					
				ИначеЕсли Правило.Тип = Перечисления.кфкТипыОбработчиков.КонвертацияДанных Тогда
					Успешно = ВыполнитьКДОбработчикДесериализации(Правило, ТелоСообщения, СвойстваСообщений,
						ДлительностьОбработки, ТекстЖурнала, Отказ);
					
				Иначе
					Статус = Перечисления.кфкСтатусыСообщений.ОшибкаОбработки;
					ТекстЖурнала = НСтр("ru = 'Не задан тип десериализации!'");
					
				КонецЕсли;
				
				// Результат обработки
				Если Не Успешно Тогда // Ошибка
					Статус = Перечисления.кфкСтатусыСообщений.ОшибкаОбработки;
					
				ИначеЕсли Отказ = Истина Тогда // Отказ
					Статус = Перечисления.кфкСтатусыСообщений.ОбработкаОтменена;
					
				Иначе // ОК
					Статус = Перечисления.кфкСтатусыСообщений.Обработано;
					
				КонецЕсли;
				
			Исключение
				ТекстЖурнала = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Статус = Перечисления.кфкСтатусыСообщений.ОшибкаОбработки;
				
			КонецПопытки;
		КонецЕсли;
		
		// Запись
		НоваяСтрока = Очередь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Статус = Статус;
		НоваяСтрока.ДатаОбработки = ТекущаяДатаСеанса();
		НоваяСтрока.ДлОбработкиМС = ДлительностьОбработки;
		НоваяСтрока.КоличествоОбработок = НоваяСтрока.КоличествоОбработок + 1;
		НоваяСтрока.ТекстЖурнала = ДополнитьТекстЖурнала(Выборка.ТекстЖурнала, ТекстЖурнала);
		НоваяСтрока.МеткаИзмененияМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		НоваяСтрока = ОчередьПотока.Добавить();
		НоваяСтрока.Ключ = Выборка.КлючЗаписи;
		НоваяСтрока.ВременнаяМетка = Выборка.ДатаЗагрузкиМС;
		НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
		
	КонецЦикла;
	
	// Если разница между первой и последней меткой изменений больше 2 секунд, то обновляем все метки изменений
	Если Очередь[Очередь.Количество()-1].МеткаИзмененияМС - Очередь[0].МеткаИзмененияМС > 2000 Тогда
		ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Для Каждого Строка Из Очередь Цикл
			Строка.МеткаИзмененияМС = ТекущаяДатаМС;
		КонецЦикла;
	КонецЕсли;
	
//	Запись в БД
	Очередь.Записать(РежимЗамещения.Обновление);
	ОчередьПотока.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

// Свойства сообщения подготовки данных. см. ДесериализацияСообщений
// 
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса - Выборка исходящих сообщений. см. ВыборкаДесериализацииСообщений.
// 
// Возвращаемое значение:
//  Структура - Свойства сообщения подготовки данных:
//	* Консьюмер - СправочникСсылка.кфкКонсьюмеры - Консьюмер
//	* Топик - Строка - Топик
//	* Ключ - Строка - Ключ
//	* Раздел - Строка - Раздел
//	* Смещение - Строка - Смещение
//	* Заголовки - Соответствие Из Строка - Заголовки
//	* ДатаЗагрузки - Дата - Дата загрузки
//	* ДатаОбработки - Дата - Дата обработки
Функция СвойстваВходящихСообщений(Выборка)
			
	Результат = Новый Структура;
	Результат.Вставить("Консьюмер", Выборка.Консьюмер);
	Результат.Вставить("Топик", Выборка.Топик);
	Результат.Вставить("Ключ", Выборка.КлючСообщения);
	Результат.Вставить("Раздел", Выборка.Раздел);
	Результат.Вставить("Смещение", Выборка.Смещение);
	Результат.Вставить("Заголовки", кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Выборка.Заголовки));
	Результат.Вставить("ДатаЗаписи", Выборка.ДатаЗаписи);
	Результат.Вставить("ДатаЗагрузки", Выборка.ДатаЗагрузки);
	Результат.Вставить("ДатаОбработки", Выборка.ДатаОбработки);
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьПроизвольныйОбработчикДесериализации(Правило, ТелоСообщения, СвойстваСообщений, ДлительностьОбработки, ТекстЖурнала, Отказ)
	
	Если ПустаяСтрока(Правило.ИмяМетода) Тогда
		ТекстЖурнала = НСтр("ru = 'Не задан метод десериализации!'");
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыСериализации = Новый Массив(4); // Массив Из Неопределено, СправочникСсылка, Структура, Строка, Булево
	ПараметрыСериализации[0] = ТелоСообщения;
	ПараметрыСериализации[1] = СвойстваСообщений;
	ПараметрыСериализации[2] = "";
	ПараметрыСериализации[3] = Ложь;
	
	НачалоОбработки = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ОбщегоНазначения.ВыполнитьМетодКонфигурации(Правило.ИмяМетода, ПараметрыСериализации);
	ДлительностьОбработки = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоОбработки;
	
	ТекстЖурнала = ПараметрыСериализации[2];
	Отказ = ПараметрыСериализации[3];
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьКДОбработчикДесериализации(Правило, ТелоСообщения, СвойстваСообщений, ДлительностьОбработки, ТекстЖурнала, Отказ)
	
	КомпонентыОбмена = Правило.КомпонентыОбмена; // Неопределено, Структура - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
	Если Правило.КомпонентыОбмена = Неопределено Тогда
		
		Если ПустаяСтрока(Правило.Формат) Или ПустаяСтрока(Правило.ИмяМодуля) Или ПустаяСтрока(Правило.ИмяПОД) Тогда
			ТекстЖурнала = НСтр("ru = 'Ошибка инициализации компонентов обмена. Не заполнены обязательные поля.'");
			Возврат Неопределено;
		КонецЕсли;
		
		КомпонентыОбмена = кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Получение");
		КомпонентыОбмена.XMLСхема = Правило.Формат;
		КомпонентыОбмена.МенеджерОбмена = ОбщегоНазначения.ОбщийМодуль(Правило.ИмяМодуля);
		кфкОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена);
		
		Правило.КомпонентыОбмена = КомпонентыОбмена;
		
	КонецЕсли;
	
	КомпонентыОбмена.КлючСообщения = СвойстваСообщений.Ключ;
	КомпонентыОбмена.СвойстваСообщения = СвойстваСообщений;
	КомпонентыОбмена.ЗаголовкиСообщения = СвойстваСообщений.Заголовки;
	
	НачалоОбработки = ТекущаяУниверсальнаяДатаВМиллисекундах();
	кфкОбменДаннымиXDTOСервер.ПроизвестиЧтениеДанных(КомпонентыОбмена, ТелоСообщения, Правило.ИмяПОД);
	ДлительностьОбработки = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоОбработки;
	
	Отказ = КомпонентыОбмена.ФлагПропустить;
	ТекстЖурнала = СтрСоединить(КомпонентыОбмена.ПротоколКонвертации, "
		|- - - - - - - - - - - - - - - - - - - - - - - - -
		|");
	
	Возврат КомпонентыОбмена.ФлагОшибки;
	
КонецФункции

#КонецОбласти

#Область УдалениеДублейОчереди

// Выборка дублей исходящих сообщений.
// 
// Параметры:
//  Количество - Число - Количество записей
//  МеткаИзмененияМС - Число - Указатель начала выборки данных
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка дублей исходящих сообщений:
//	* КлючЗаписи - Строка - Владелец сообщения
//	* ДатаРегистрацииМС - Число - Дата регистрации (мс)
//	* Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер
//	* МеткаИзмененияМС - Число - Метка изменения (мс)
//
Функция ВыборкаДублейИсходящихСообщений(Количество, МеткаИзмененияМС)
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Т1.КлючЗаписи КАК КлючЗаписи,
	|	Т1.ДатаРегистрацииМС КАК ДатаРегистрацииМС,
	|	Т1.Продюсер КАК Продюсер,
	|	Т1.МеткаИзмененияМС КАК МеткаИзмененияМС
	|ИЗ
	|	РегистрСведений.кфкИсходящиеСообщения КАК Т1
	|ГДЕ
	|	Т1.МеткаИзмененияМС >= &МеткаИзмененияМС
	|	И НЕ Т1.ДатаРегистрацииМС В
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(Т2.ДатаРегистрацииМС) КАК ДатаРегистрацииМС
	|		ИЗ
	|			РегистрСведений.кфкИсходящиеСообщения КАК Т2
	|		ГДЕ
	|			Т2.КлючЗаписи = Т1.КлючЗаписи)
	|	И НЕ 0 В
	|		(ВЫБРАТЬ
	|			0
	|		ИЗ
	|			РегистрСведений.кфкОчередьПотоков КАК ОП
	|		ГДЕ
	|			ОП.Ключ = Т1.КлючЗаписи)
	|	И Т1.Статус В (ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое),
	|		ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки), ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Обработано),
	|		ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаВыгрузки))
	|
	|УПОРЯДОЧИТЬ ПО
	|	МеткаИзмененияМС";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "1000", XMLСтрока(Количество));
	Запрос.УстановитьПараметр("МеткаИзмененияМС", МеткаИзмененияМС);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#Область ВозвратВОчередь

// Возвращает выборку возврата в очередь
// 
// Параметры:
//	Количество - Число - Количество записей
//	МеткаИзмененияМС - Число, Произвольный - Метка изменения МС
//	МаксКоличествоВыгрузок - Число - Макс количество выгрузок
// 
// Возвращаемое значение:
//	ВыборкаИзРезультатаЗапроса - Выборка возврата в очередь:
//		* КлючЗаписи - Строка - Ключ записи
//		* ДатаРегистрацииМС - Число - Дата регистрации МС
//		* ИсходныеДанные - ХранилищеЗначения - Исходные данные
//		* ЭтоУдаление - Булево - Это удаление
//		* КлючСообщения - Строка - Ключ сообщения
//		* Заголовки - ХранилищеЗначения - Заголовки
//		* ТелоСообщения - ХранилищеЗначения - Тело сообщения
//		* Продюсер - Строка - Продюсер
//		* ТипОбъект - Строка - Тип объект
//		* ТипИсходныхДанных - Строка - Тип исходных данных
//		* КлючОбъекта - Строка - Ключ объекта
//		* СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//		* ДатаРегистрации - Дата - Дата регистрации
//		* ДатаОбработки - Дата - Дата обработки
//		* ДатаВыгрузки - Дата - Дата выгрузки
//		* ДлОбработкиМС - Число - Длительность обработки МС
//		* ТекстЖурнала - Строка - Текст журнала
//		* КоличествоОбработок - Число - Количество обработок
//		* КоличествоВыгрузок - Число - Количество выгрузок
//		* МеткаИзмененияМС - Число - Метка изменения МС
Функция ВыборкаВозвратаВОчередь(Количество, МеткаИзмененияМС, МаксКоличествоВыгрузок)
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.ДатаРегистрацииМС КАК ДатаРегистрацииМС,
	|	Т.ИсходныеДанные КАК ИсходныеДанные,
	|	Т.ЭтоУдаление КАК ЭтоУдаление,
	|	Т.КлючСообщения КАК КлючСообщения,
	|	Т.Заголовки КАК Заголовки,
	|	Т.ТелоСообщения КАК ТелоСообщения,
	|	Т.Продюсер КАК Продюсер,
	|	Т.ТипОбъект КАК ТипОбъект,
	|	Т.ТипИсходныхДанных КАК ТипИсходныхДанных,
	|	Т.КлючОбъекта КАК КлючОбъекта,
	|	Т.СобытиеРегистрации КАК СобытиеРегистрации,
	|	Т.ДатаРегистрации КАК ДатаРегистрации,
	|	Т.ДатаОбработки КАК ДатаОбработки,
	|	Т.ДатаВыгрузки КАК ДатаВыгрузки,
	|	Т.ДлОбработкиМС КАК ДлОбработкиМС,
	|	Т.ТекстЖурнала КАК ТекстЖурнала,
	|	Т.КоличествоОбработок КАК КоличествоОбработок,
	|	Т.КоличествоВыгрузок КАК КоличествоВыгрузок,
	|	Т.МеткаИзмененияМС КАК МеткаИзмененияМС
	|ИЗ
	|	РегистрСведений.кфкИсходящиеСообщения КАК Т
	|ГДЕ
	|	Т.МеткаИзмененияМС > &МеткаИзмененияМС
	|	И Т.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаВыгрузки)
	|	И Т.КоличествоВыгрузок < &КоличествоВыгрузок
	|
	|УПОРЯДОЧИТЬ ПО
	|	МеткаИзмененияМС";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "1000", XMLСтрока(Количество));
	Запрос.УстановитьПараметр("МеткаИзмененияМС", МеткаИзмененияМС);
	Запрос.УстановитьПараметр("КоличествоВыгрузок", МаксКоличествоВыгрузок);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#Область ОчисткаХранилищаОчереди

// Выборка устаревших исходящих сообщений. см. ОчисткаХранилищаОчереди
// 
// Параметры:
//  Количество - Число - Количество записей
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка записей исходящих сообщений:
//	* КлючЗаписи - Строка - Владелец сообщения
//	* ДатаРегистрацииМС - Число - Дата регистрации (мс)
Функция ВыборкаУстаревшихИсходящихСообщений(Количество)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СтатусыСообщений.Ссылка КАК Статус,
	|	&ТекущаяУниверсальнаяМС - ПараметрыОчисткиХранилища.СрокХраненияНезавершенных * 86400000 КАК СрокХранения
	|ПОМЕСТИТЬ ВТПараметрыОчисткиХранилища
	|ИЗ
	|	РегистрСведений.кфкПараметрыОчисткиХранилища КАК ПараметрыОчисткиХранилища
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ПустаяСсылка) КАК Ссылка
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое)
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Обработано)) КАК СтатусыСообщений
	|		ПО ИСТИНА
	|ГДЕ
	|	ПараметрыОчисткиХранилища.СрокХраненияНезавершенных > 0 // незавершенные нельзя сразу удалить
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки),
	|	&ТекущаяУниверсальнаяМС - кфкПараметрыОчисткиХранилища.СрокХраненияОшибкиОбработкиИсходящих * 86400000
	|ИЗ
	|	РегистрСведений.кфкПараметрыОчисткиХранилища КАК кфкПараметрыОчисткиХранилища
	|ГДЕ
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОшибкиОбработкиИсходящих >= 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОбработкаОтменена),
	|	&ТекущаяУниверсальнаяМС - кфкПараметрыОчисткиХранилища.СрокХраненияОтмененныхИсходящих * 86400000
	|ИЗ
	|	РегистрСведений.кфкПараметрыОчисткиХранилища КАК кфкПараметрыОчисткиХранилища
	|ГДЕ
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОтмененныхИсходящих >= 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаВыгрузки),
	|	&ТекущаяУниверсальнаяМС - кфкПараметрыОчисткиХранилища.СрокХраненияОшибкиОтправки * 86400000
	|ИЗ
	|	РегистрСведений.кфкПараметрыОчисткиХранилища КАК кфкПараметрыОчисткиХранилища
	|ГДЕ
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОшибкиОтправки >= 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Выгружено),
	|	&ТекущаяУниверсальнаяМС - кфкПараметрыОчисткиХранилища.СрокХраненияОтправленных * 86400000
	|ИЗ
	|	РегистрСведений.кфкПараметрыОчисткиХранилища КАК кфкПараметрыОчисткиХранилища
	|ГДЕ
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОтправленных >= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ИсходящиеСообщения.КлючЗаписи КАК КлючЗаписи,
	|	ИсходящиеСообщения.ДатаРегистрацииМС КАК ДатаРегистрацииМС
	|ИЗ
	|	РегистрСведений.кфкИсходящиеСообщения КАК ИсходящиеСообщения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПараметрыОчисткиХранилища КАК ВТПараметрыОчисткиХранилища
	|		ПО ИсходящиеСообщения.МеткаИзмененияМС < ВТПараметрыОчисткиХранилища.СрокХранения
	|		И ИсходящиеСообщения.Статус = ВТПараметрыОчисткиХранилища.Статус";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "1000", XMLСтрока(Количество));
	Запрос.УстановитьПараметр("ТекущаяУниверсальнаяМС", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

// Выборка устаревших входящих сообщений. см. ОчисткаХранилищаОчереди
// 
// Параметры:
//  Количество - Число - Количество записей
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка записей входящих сообщений:
//	* Консьюмер - СправочникСсылка.кфкКонсьюмеры - Консьюмер
//	* Топик - Строка - Топик
//	* Раздел - Строка - Раздел
//	* КлючСообщения - Строка - Ключ сообщения
//	* ДатаЗагрузкиМС - Число - Дата загрузки в МС
Функция ВыборкаУстаревшихВходящихСообщений(Количество)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СтатусыСообщений.Ссылка КАК Статус,
	|	&ТекущаяУниверсальнаяМС - кфкПараметрыОчисткиХранилища.СрокХраненияНезавершенных * 86400000 КАК СрокХранения
	|ПОМЕСТИТЬ ВТПараметрыОчисткиХранилища
	|ИЗ
	|	РегистрСведений.кфкПараметрыОчисткиХранилища КАК кфкПараметрыОчисткиХранилища
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ПустаяСсылка) КАК Ссылка
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое)) КАК СтатусыСообщений
	|		ПО ИСТИНА
	|ГДЕ
	|	кфкПараметрыОчисткиХранилища.СрокХраненияНезавершенных >= 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки),
	|	&ТекущаяУниверсальнаяМС - кфкПараметрыОчисткиХранилища.СрокХраненияОшибкиОбработкиВходящих * 86400000
	|ИЗ
	|	РегистрСведений.кфкПараметрыОчисткиХранилища КАК кфкПараметрыОчисткиХранилища
	|ГДЕ
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОшибкиОбработкиВходящих >= 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОбработкаОтменена),
	|	&ТекущаяУниверсальнаяМС - кфкПараметрыОчисткиХранилища.СрокХраненияОтмененныхВходящих * 86400000
	|ИЗ
	|	РегистрСведений.кфкПараметрыОчисткиХранилища КАК кфкПараметрыОчисткиХранилища
	|ГДЕ
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОтмененныхВходящих >= 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Обработано),
	|	&ТекущаяУниверсальнаяМС - кфкПараметрыОчисткиХранилища.СрокХраненияОбработанных * 86400000
	|ИЗ
	|	РегистрСведений.кфкПараметрыОчисткиХранилища КАК кфкПараметрыОчисткиХранилища
	|ГДЕ
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОбработанных >= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ВходящиеСообщения.КлючЗаписи КАК КлючЗаписи,
	|	ВходящиеСообщения.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС
	|ИЗ
	|	РегистрСведений.кфкВходящиеСообщения КАК ВходящиеСообщения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПараметрыОчисткиХранилища КАК ВТПараметрыОчисткиХранилища
	|		ПО ВходящиеСообщения.МеткаИзмененияМС < ВТПараметрыОчисткиХранилища.СрокХранения
	|		И ВходящиеСообщения.Статус = ВТПараметрыОчисткиХранилища.Статус";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "1000", XMLСтрока(Количество));
	Запрос.УстановитьПараметр("ТекущаяУниверсальнаяМС", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Выборка позиции операций.
// 
// Возвращаемое значение:
//	ВыборкаИзРезультатаЗапроса - Выборка позиции операций:
//	 * Идентификатор - УникальныйИдентификатор - Идентификатор операции
//	 * Раздел - Строка - Дополнительный раздел операции
Функция ВыборкаПозицииОпераций()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Идентификатор КАК Идентификатор,
	|	Т.Раздел КАК Раздел
	|ИЗ
	|	РегистрСведений.кфкПозицииОпераций КАК Т
	|ГДЕ
	|	Т.ВременнаяМетка < &ВременнаяМетка";
	Запрос.УстановитьПараметр("ВременнаяМетка", ТекущаяУниверсальнаяДатаВМиллисекундах() - 2592000000); // 30 дней
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Выборка идентификаторов потока.
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка идентификаторов потока:
//	 * ИдентификаторПотока - УникальныйИдентификатор - Идентификатор потока
Функция ВыборкаИдентификаторовПотока()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ИдентификаторПотока ИЗ РегистрСведений.кфкОчередьПотоков");
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Удаляет записи регистра сведений на основе переданной выборки.
//
// Параметры:
//	Выборка - ВыборкаИзРезультатаЗапроса - Выборка записей регистра сведений для удаления
//	Менеджер - РегистрСведенийМенеджерИмяРегистраСведений - Менеджер регистра сведений, записи которого необходимо удалить
Процедура УдалитьЗаписиРС(Выборка, Менеджер)
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Набор = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(Менеджер);
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
	КонецЦикла;
	Набор.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

#КонецОбласти

#Область ВнешнееЛогирование

// Получить параметры логирования.
// 
// Возвращаемое значение:
//	Неопределено, Структура - Получить параметры логирования:
//	 * Префикс - Строка - Префикс логгера
//	 * Сессия - Неопределено, HTTPСоединение - Сессия HTTP соединения
//	 * КоличествоПакетов - Число - Количество пакетов
//	 * МаксРазмерВыборкиИсх - Число - Максимальный размер выборки
//	 * МаксРазмерВыборкиВх - Число - Максимальный размер выборки
//	 * ПредставленияНастроек - Соответствие Из Строка - Представления продюсеров и консьюмеров
//	 * ВыгружатьИсходныеДанныеИсходящих - Булево - Выгружать исходные данные исходящих
//	 * ВыгружатьЗаголовкиСообщенияИсходящих - Булево - Выгружать заголовки сообщений исходящих
//	 * ВыгружатьТелоСообщенияИсходящих - Булево - Выгружать тело сообщений исходящих
//	 * ВыгружатьЗаголовкиСообщенияВходящих - Булево - Выгружать заголовки сообщений входящих
//	 * ВыгружатьТелоСообщенияВходящие - Булево - Выгружать тело сообщений входящих
//	 * АдресСервиса - Структура - Структура адрес сервиса:
//	  ** Схема - Строка - схема из URI
//	  ** Логин - Строка - логин из URI
//	  ** Пароль - Строка - пароль из URI
//	  ** ИмяСервера - Строка - часть <хост>:<порт> из URI
//	  ** Хост - Строка - хост из URI
//	  ** Порт - Неопределено, Число - порт из URI
//	  ** ПутьНаСервере - Строка - часть <путь>?<параметры>#<якорь> из URI
Функция КонфигурацияЛогирования()
	
	ПараметрыЛогирования = РегистрыСведений.кфкПараметрыЛогирования.ПолучитьПараметры();
	Если ПустаяСтрока(ПараметрыЛогирования.АдресСервиса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	// ОБЩИЕ НАСТРОЙКИ
	Результат.Вставить("Префикс", "");
	
	Результат.Вставить("Сессия", Неопределено);
	
	Результат.Вставить("КоличествоПакетов", 10); // x2: по N для исходящих, и по N для входящих 
	Результат.Вставить("МаксРазмерВыборкиИсх", НоваяСтратегияРаспределения().МаксРазмерПакета);
	Результат.Вставить("МаксРазмерВыборкиВх", НоваяСтратегияРаспределения().МаксРазмерПакета);
	
	Представления = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Справочник.кфкПродюсеры.Ссылка, Наименование ГДЕ ЭтоГруппа = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ Справочник.кфкКонсьюмеры.Ссылка, Наименование ГДЕ ЭтоГруппа = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//@skip-check property-return-type
		Представления.Вставить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	Результат.Вставить("ПредставленияНастроек", Представления);
	
	// ИСХОДЯЩИЕ СООБЩЕНИЯ
	Результат.Вставить("ВыгружатьИсходныеДанныеИсходящих", Ложь);
	Результат.Вставить("ВыгружатьЗаголовкиСообщенияИсходящих", Ложь);
	Результат.Вставить("ВыгружатьТелоСообщенияИсходящих", Ложь);
	
	// ВХОДЯЩИЕ СООБЩЕНИЯ
	Результат.Вставить("ВыгружатьЗаголовкиСообщенияВходящих", Ложь);
	Результат.Вставить("ВыгружатьТелоСообщенияВходящие", Ложь);
	
	ЗаполнитьЗначенияСвойств(Результат, ПараметрыЛогирования);
	
	АдресСервиса = ОбщегоНазначенияКлиентСервер.СтруктураURI(ПараметрыЛогирования.АдресСервиса);
	Результат.Вставить("АдресСервиса", АдресСервиса);
	
	// МаксРазмерВыборки+КоэффициентУменьшения
	МинимальныйКоэффициент = 0.5; // Число
	//	* Исходящие
	КоэффициентУменьшения = Макс(МинимальныйКоэффициент,
		?(Результат.ВыгружатьИсходныеДанныеИсходящих, 0, 1) + ?(Результат.ВыгружатьЗаголовкиСообщенияИсходящих, 0, 1));
	Результат.МаксРазмерВыборкиИсх = Результат.МаксРазмерВыборкиИсх * КоэффициентУменьшения * 10;
	//	* Входящие
	КоэффициентУменьшения = Макс(МинимальныйКоэффициент, ?(Результат.ВыгружатьЗаголовкиСообщенияВходящих, 0, 2));
	Результат.МаксРазмерВыборкиВх = Результат.МаксРазмерВыборкиВх * КоэффициентУменьшения * 10;
	
	Возврат Результат;
	
КонецФункции

// Статусы удаления сообщений после отправки логов.
// 
// Возвращаемое значение:
//	Структура - Статусы удаления сообщений после отправки логов:
//		* Исходящих - Массив Из ПеречислениеСсылка.кфкСтатусыСообщений - Статусы удаления исходящих сообщений
//		* Входящих - Массив Из ПеречислениеСсылка.кфкСтатусыСообщений - Статусы удаления входящих сообщений
Функция СтатусыУдаленияСообщенийПослеОтправкиЛогов()
	
	СтатусыКУдалениюВходящих = Новый Массив; // Массив Из ПеречислениеСсылка.кфкСтатусыСообщений
	СтатусыКУдалениюИсходящих = Новый Массив; // Массив Из ПеречислениеСсылка.кфкСтатусыСообщений
	
	ПараметрыОчистки = РегистрыСведений.кфкПараметрыОчисткиХранилища.ПолучитьПараметры();
	
	// РС ИсходящиеСообщения
	Если ПараметрыОчистки.СрокХраненияОтправленных = -2 Тогда
		СтатусыКУдалениюИсходящих.Добавить(Перечисления.кфкСтатусыСообщений.Выгружено);
	КонецЕсли;
	Если ПараметрыОчистки.СрокХраненияОтмененныхИсходящих = -2 Тогда
		СтатусыКУдалениюИсходящих.Добавить(Перечисления.кфкСтатусыСообщений.ОбработкаОтменена);
	КонецЕсли;
	
	// РС ВходящиеСообщения
	Если ПараметрыОчистки.СрокХраненияОбработанных = -2 Тогда
		СтатусыКУдалениюВходящих.Добавить(Перечисления.кфкСтатусыСообщений.Обработано);
	КонецЕсли;
	Если ПараметрыОчистки.СрокХраненияОтмененныхВходящих = -2 Тогда
		СтатусыКУдалениюВходящих.Добавить(Перечисления.кфкСтатусыСообщений.ОбработкаОтменена);
	КонецЕсли;
	
	Возврат Новый Структура("Исходящих, Входящих", СтатусыКУдалениюИсходящих, СтатусыКУдалениюВходящих);
	
КонецФункции

// Выборка позиций отправки логов.
// 
// Возвращаемое значение:
//  Структура - Позиции отправки логов:
//	 * ВременнаяМеткаВходящих - Число - Временная метка входящих
//	 * ВременнаяМеткаИсходящих - Число - Временная метка исходящих
Функция ПозицииОтправкиЛогов()
	
	Результат = Новый Структура;
	Результат.Вставить("ВременнаяМеткаВходящих", 0);
	Результат.Вставить("ВременнаяМеткаИсходящих", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(ПозицииОпераций.ВременнаяМеткаВходящих) КАК ВременнаяМеткаВходящих,
	|	МАКСИМУМ(ПозицииОпераций.ВременнаяМеткаИсходящих) КАК ВременнаяМеткаИсходящих
	|ИЗ
	|	(ВЫБРАТЬ
	|		кфкПозицииОпераций.ВременнаяМетка КАК ВременнаяМеткаИсходящих,
	|		0 КАК ВременнаяМеткаВходящих
	|	ИЗ
	|		РегистрСведений.кфкПозицииОпераций КАК кфкПозицииОпераций
	|	ГДЕ
	|		кфкПозицииОпераций.Идентификатор = &ИдентификаторИсх
	|
	|	ОБЪЕДИНИТЬ
	|
	|	ВЫБРАТЬ
	|		0,
	|		кфкПозицииОпераций.ВременнаяМетка
	|	ИЗ
	|		РегистрСведений.кфкПозицииОпераций КАК кфкПозицииОпераций
	|	ГДЕ
	|		кфкПозицииОпераций.Идентификатор = &ИдентификаторВх) КАК ПозицииОпераций";
	Запрос.УстановитьПараметр("ИдентификаторИсх", ИДОперации_ОтправкаЛоговИсходящих());
	Запрос.УстановитьПараметр("ИдентификаторВх", ИДОперации_ОтправкаЛоговВходящих());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Имя раздела логирования.
// 
// Параметры:
//	Префикс - Строка - Префикс логгера
//	Настройка - СправочникСсылка.кфкПродюсеры, СправочникСсылка.кфкКонсьюмеры - Настройка
// 
// Возвращаемое значение:
//	Строка - Имя раздела логирования
Функция ИмяРазделаЛогирования(Префикс, Настройка)
	
	Возврат
		?(ПустаяСтрока(Префикс), "", Префикс + "-")
		+ "kfk-"
		+ ?(ТипЗнч(Настройка) = Тип("СправочникСсылка.кфкПродюсеры"), "producer", "consumer") + "-"
		+ СтрЗаменить(XMLСтрока(Настройка), "-", "");
	
КонецФункции

// Ключ события логирования.
// 
// Параметры:
//  КлючЗаписи - Строка - Ключ записи
//  Период - Число - Период события
// 
// Возвращаемое значение:
//  Строка - Ключ события логирования
Функция КлючСобытияЛогирования(КлючЗаписи, Период)
	Возврат КлючЗаписи + "_" + XMLСтрока(Период);
КонецФункции

// Добавить дату в лог.
// 
// Параметры:
//  Событие - Соответствие Из Произвольный - Событие
//  Значение - Дата - Значение
//  Ключ - Строка - Ключ
Процедура ДобавитьДатуВЛог(Событие, Значение, Ключ)
	
	Если Значение = Дата(1, 1, 1) Тогда
		Возврат;
	КонецЕсли;
	
	Событие.Вставить(Ключ, кфкОбщегоНазначенияСлужебный.ДатаВСтроку(Значение, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением));
	
КонецПроцедуры

Процедура ДобавитьЗаголовкиСообщенияВЛог(Событие, Значение, УсловиеДобавление)
	
	Если Не УсловиеДобавление Тогда
		Возврат;
	КонецЕсли;
	
	Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Значение); // Неопределено, Соответствие Из Строка
	Если Заголовки = Неопределено Или Заголовки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Результат = "";
	//@skip-check property-return-type
	Для Каждого Элемент Из Заголовки Цикл
		ТЗначение = ТипЗнч(Элемент.Значение); // см. XMLСтрока
		Если Значение = Неопределено Или Значение = Null
			Или ТЗначение = Тип("Булево") Или ТЗначение = Тип("Число") Или ТЗначение = Тип("Строка") Или ТЗначение = Тип("Дата")
			Или ТЗначение = Тип("УникальныйИдентификатор") Или ТЗначение = Тип("ДвоичныеДанные") Или ТЗначение = Тип("ХранилищеЗначения")
			Или ТЗначение = Тип("ВидСчета") Или ТЗначение = Тип("ВидДвиженияБухгалтерии") Или ТЗначение = Тип("ВидДвиженияНакопления")
			Или ТЗначение = Тип("ДопустимыйЗнак") Или ТЗначение = Тип("ДопустимаяДлина") Или ТЗначение = Тип("ЧастиДаты") Тогда
			
			Результат = Результат + ?(ПустаяСтрока(Результат), "", ",")
				+ XMLСтрока(Элемент.Ключ) + "=" + XMLСтрока(Элемент.Значение);
			
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Событие.Вставить("msg_headers", Результат);
	
КонецПроцедуры

Процедура ДобавитьТелоСообщенияВЛог(Событие, Значение, УсловиеДобавление)
	
	Если Не УсловиеДобавление Тогда
		Возврат;
	КонецЕсли;
	
	Результат = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Значение); // Строка
	Если ПустаяСтрока(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Событие.Вставить("msg_body", Результат);
	
КонецПроцедуры

// Отправляет логи в сервис по указанному адресу.
//
// Параметры:
//	КонфигЛога - Структура - Конфигурация логирования, см. КонфигурацияЛогирования
//	События - Массив Из Произвольный - события для отправки
Процедура ОтправитьЛоги(КонфигЛога, События)
	
	Адрес = КонфигЛога.АдресСервиса; // Структура
	СобытияJSON = кфкОбщегоНазначенияСлужебный.ЗначениеВJSON(События);
	
	Если КонфигЛога.Сессия = Неопределено Тогда
		ЗащищенноеСоединение = ?(НРег(Адрес.Схема) = "http", Неопределено, Новый ЗащищенноеСоединениеOpenSSL);
		КонфигЛога.Сессия = Новый HTTPСоединение(Адрес.Хост, Адрес.Порт, , , , , ЗащищенноеСоединение);
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(Адрес.ПутьНаСервере);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.Заголовки.Вставить("Content-encoding", "gzip");
	
	Запрос.УстановитьТелоИзСтроки(СобытияJSON);
	СобытияДД = Запрос.ПолучитьТелоКакДвоичныеДанные();
	СобытияGZip = кфкОбщегоНазначенияСлужебный.ЗаписатьGZip(СобытияДД);
	Запрос.УстановитьТелоИзДвоичныхДанных(СобытияGZip);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Ответ = КонфигЛога.Сессия.ВызватьHTTPМетод("POST", Запрос);
	Если Не Ответ.КодСостояния = 200 Тогда
		ВызватьИсключение Ответ.КодСостояния;
	КонецЕсли;
	
КонецПроцедуры

#Область ЛогированияИсходящих

// Выборка исходящих событий.
// 
// Параметры:
//  Количество - Число - Количество записей
//  НачальнаяПозиция - Число - НачальнаяПозиция
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка исходящих событий:
//	* КлючЗаписи - Строка - Владелец сообщения
//	* ДатаРегистрацииМС - Число - Дата регистрации (мс)
//	* Статус - ПеречислениеСсылка.кфкСтатусыСообщений - Статус
//	* ИсходныеДанные - ХранилищеЗначения - Исходные данные
//	* ЭтоУдаление - Булево - Это удаление
//	* КлючСообщения - Строка - Ключ сообщения
//	* Заголовки - ХранилищеЗначения - Заголовки
//	* ТелоСообщения - ХранилищеЗначения - Тело сообщения
//	* Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер
//	* ТипОбъект - Строка - Имя объекта метаданных
//	* ТипИсходныхДанных - Строка - Тип исходных данных
//	* КлючОбъекта - Строка - Ключ записи
//	* СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	* ДатаРегистрации - Дата - Дата регистрация
//	* ДатаОбработки - Дата - Дата обработки
//	* ДатаВыгрузки - Дата - Дата выгрузки
//	* ДлОбработкиМС - Число - Длительность обработки в миллисекундах
//	* ТекстЖурнала - Строка - Текст журнала
//	* КоличествоОбработок - Число - Количество обработок
//	* КоличествоВыгрузок - Число - Количество выгрузок
//	* МеткаИзмененияМС - Число - Метка изменения (мс)
Функция ВыборкаЛоговИсходящихСообщений(Количество, НачальнаяПозиция)
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Таблица.КлючЗаписи КАК КлючЗаписи,
	|	Таблица.ДатаРегистрацииМС КАК ДатаРегистрацииМС,
	|	Таблица.Статус КАК Статус,
	|	Таблица.ИсходныеДанные КАК ИсходныеДанные,
	|	Таблица.ЭтоУдаление КАК ЭтоУдаление,
	|	Таблица.КлючСообщения КАК КлючСообщения,
	|	Таблица.Заголовки КАК Заголовки,
	|	Таблица.ТелоСообщения КАК ТелоСообщения,
	|	Таблица.Продюсер КАК Продюсер,
	|	Таблица.ТипОбъект КАК ТипОбъект,
	|	Таблица.ТипИсходныхДанных КАК ТипИсходныхДанных,
	|	Таблица.КлючОбъекта КАК КлючОбъекта,
	|	Таблица.СобытиеРегистрации КАК СобытиеРегистрации,
	|	Таблица.ДатаРегистрации КАК ДатаРегистрации,
	|	Таблица.ДатаОбработки КАК ДатаОбработки,
	|	Таблица.ДатаВыгрузки КАК ДатаВыгрузки,
	|	Таблица.ДлОбработкиМС КАК ДлОбработкиМС,
	|	Таблица.ТекстЖурнала КАК ТекстЖурнала,
	|	Таблица.КоличествоОбработок КАК КоличествоОбработок,
	|	Таблица.КоличествоВыгрузок КАК КоличествоВыгрузок,
	|	Таблица.МеткаИзмененияМС КАК МеткаИзмененияМС
	|ИЗ
	|	РегистрСведений.кфкИсходящиеСообщения КАК Таблица
	|ГДЕ
	|	Таблица.МеткаИзмененияМС > &НачальнаяПозиция
	|
	|УПОРЯДОЧИТЬ ПО
	|	Таблица.МеткаИзмененияМС";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "1000", XMLСтрока(Количество));
	Запрос.УстановитьПараметр("НачальнаяПозиция", ?(ЗначениеЗаполнено(НачальнаяПозиция), НачальнаяПозиция, 0));
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ОбработчикВыгрузкиЛоговИсходящихСообщений(КонфигЛога, СтатусыКУдалению, Очередь, ПозицииОт)
	
	Выборка = ВыборкаЛоговИсходящихСообщений(КонфигЛога.МаксРазмерВыборкиИсх, ПозицииОт.ВременнаяМеткаИсходящих);
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	События = Новый Массив; // Массив Из Соответствие
	МеткаИзменения = 0;
	
	Префикс = КонфигЛога.Префикс; // Строка
	Представления = КонфигЛога.ПредставленияНастроек; // Соответствие Из Строка
	ВыгружатьЗаголовкиСообщения = КонфигЛога.ВыгружатьЗаголовкиСообщенияИсходящих; // Булево
	ВыгружатьТелоСообщения = КонфигЛога.ВыгружатьТелоСообщенияИсходящих; // Булево
	ВыгружатьИсходныеДанные = КонфигЛога.ВыгружатьИсходныеДанныеИсходящих; // Булево
	
	// Очистка очереди
	Очередь.Отбор.Сбросить();
	Очередь.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		ИмяРаздела = ИмяРазделаЛогирования(Префикс, Выборка.Продюсер);
		
		Событие = Новый Соответствие; // Соответствие Из Произвольный
		Событие.Вставить("logger", ИмяРаздела);
		Событие.Вставить("id", КлючСобытияЛогирования(Выборка.КлючЗаписи, Выборка.ДатаРегистрацииМС));
		Событие.Вставить("@timestamp", кфкОбщегоНазначенияСлужебный.ДатаМсВСтроку(Выборка.ДатаРегистрацииМС));
		
		Событие.Вставить("producer_id", XMLСтрока(Выборка.Продюсер));
		Событие.Вставить("producer_name", Представления.Получить(Выборка.Продюсер));
		Событие.Вставить("object_type", Выборка.ТипОбъект);
		Событие.Вставить("source_type", Выборка.ТипИсходныхДанных);
		Событие.Вставить("object_key", Выборка.КлючОбъекта);
		Событие.Вставить("record_key", Выборка.КлючЗаписи);
		Событие.Вставить("trigger", XMLСтрока(Выборка.СобытиеРегистрации));
		Событие.Вставить("status", XMLСтрока(Выборка.Статус));
		Событие.Вставить("message_key", Выборка.КлючСообщения);
		
		ДобавитьДатуВЛог(Событие, Выборка.ДатаРегистрации, "registration_date");
		ДобавитьДатуВЛог(Событие, Выборка.ДатаОбработки, "processing_date");
		ДобавитьДатуВЛог(Событие, Выборка.ДатаВыгрузки, "export_date");
		
		Событие.Вставить("log_text", Выборка.ТекстЖурнала);
		Событие.Вставить("change_mark_ms", кфкОбщегоНазначенияСлужебный.ДатаМсВСтроку(Выборка.МеткаИзмененияМС));
		Событие.Вставить("processing_duration_ms", Выборка.ДлОбработкиМС);
		Событие.Вставить("processing_count", Выборка.КоличествоОбработок);
		Событие.Вставить("export_count", Выборка.КоличествоВыгрузок);
		
		Если ВыгружатьИсходныеДанные Тогда
			ИсходныеДанные = Выборка.ИсходныеДанные.Получить(); // Строка
			Если ТипЗнч(ИсходныеДанные) = Тип("Строка") Тогда
				РегулярноеВыражение = "(\s*xmlns(\:\w+)?=""[^""]+"")|((d3p1|xsi)\:)|((?<=\>)\s+(?=\<))";
				Событие.Вставить("source", СтрЗаменитьПоРегулярномуВыражению(ИсходныеДанные, РегулярноеВыражение, "", Истина, Истина));
				Событие.Вставить("is_delete", Выборка.ЭтоУдаление);
			КонецЕсли;
		КонецЕсли;
		ДобавитьЗаголовкиСообщенияВЛог(Событие, Выборка.Заголовки, ВыгружатьЗаголовкиСообщения);
		ДобавитьТелоСообщенияВЛог(Событие, Выборка.ТелоСообщения, ВыгружатьТелоСообщения);
		
		События.Добавить(Событие);
		
		МеткаИзменения = Выборка.МеткаИзмененияМС;
		
		// Очистка очереди
		Если СтатусыКУдалению.Найти(Выборка.Статус) <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Очередь.Добавить(), Выборка, "КлючЗаписи,ДатаРегистрацииМС");
		КонецЕсли;
		
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		
		ПозицииОт.ВременнаяМеткаИсходящих = МеткаИзменения;
		ОбновитьПозицию(ИДОперации_ОтправкаЛоговИсходящих(), МеткаИзменения);
		
		// Очистка очереди
		Если Очередь.Количество() > 0 Тогда
			Очередь.Записать(РежимЗамещения.Удаление);
		КонецЕсли;
		
		ОтправитьЛоги(КонфигЛога, События);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти

#Область ЛогированияВходящих

// Выборка прочитанных событий.
// 
// Параметры:
//  Количество - Число - Количество записей
//  НачальнаяПозиция - Число - НачальнаяПозиция
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка прочитанных событий:
//  * КлючЗаписи - Строка - Владелец сообщения
//  * ДатаЗагрузкиМС - Число - Дата загрузки (мс)
//  * Статус - ПеречислениеСсылка.кфкСтатусыСообщений - Статус
//  * Заголовки - ХранилищеЗначения - Заголовки
//  * ТелоСообщения - ХранилищеЗначения - Тело сообщения
//	* Консьюмер - СправочникСсылка.кфкКонсьюмеры - Консьюмер
//	* Топик - Строка - Топик
//	* Раздел - Число - Раздел
//	* Смещение - Число - Смещение
//	* КлючСообщения - Строка - Ключ сообщения
//	* ДатаЗаписи - Дата - Дата записи
//	* ДатаЗагрузки - Дата - Дата загрузки
//	* ДатаОбработки - Дата - Дата обработки
//	* ДлОбработкиМС - Число - Длительность обработки (мс)
//	* ТекстЖурнала - Строка - Текст журнала
//	* КоличествоОбработок - Число - Количество обработок
//	* МеткаИзмененияМС - Число - Метка изменения (мс)
Функция ВыборкаЛоговВходящихСообщений(Количество, НачальнаяПозиция)
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Таблица.КлючЗаписи КАК КлючЗаписи,
	|	Таблица.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС,
	|	Таблица.Статус КАК Статус,
	|	Таблица.Заголовки КАК Заголовки,
	|	Таблица.ТелоСообщения КАК ТелоСообщения,
	|	Таблица.Консьюмер КАК Консьюмер,
	|	Таблица.Топик КАК Топик,
	|	Таблица.Раздел КАК Раздел,
	|	Таблица.Смещение КАК Смещение,
	|	Таблица.КлючСообщения КАК КлючСообщения,
	|	Таблица.ДатаЗаписи КАК ДатаЗаписи,
	|	Таблица.ДатаЗагрузки КАК ДатаЗагрузки,
	|	Таблица.ДатаОбработки КАК ДатаОбработки,
	|	Таблица.ДлОбработкиМС КАК ДлОбработкиМС,
	|	Таблица.ТекстЖурнала КАК ТекстЖурнала,
	|	Таблица.КоличествоОбработок КАК КоличествоОбработок,
	|	Таблица.МеткаИзмененияМС КАК МеткаИзмененияМС
	|ИЗ
	|	РегистрСведений.кфкВходящиеСообщения КАК Таблица
	|ГДЕ
	|	Таблица.МеткаИзмененияМС > &НачальнаяПозиция
	|
	|УПОРЯДОЧИТЬ ПО
	|	Таблица.МеткаИзмененияМС";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "1000", XMLСтрока(Количество));
	Запрос.УстановитьПараметр("НачальнаяПозиция", ?(ЗначениеЗаполнено(НачальнаяПозиция), НачальнаяПозиция, 0));
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ОбработчикВыгрузкиЛоговВходящихСообщений(КонфигЛога, СтатусыКУдалению, Очередь, ПозицииОт)
	
	Выборка = ВыборкаЛоговВходящихСообщений(КонфигЛога.МаксРазмерВыборкиВх, ПозицииОт.ВременнаяМеткаВходящих);
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	События = Новый Массив; // Массив Из Соответствие
	МеткаИзменения = 0;
	
	Префикс = КонфигЛога.Префикс; // Строка
	Представления = КонфигЛога.ПредставленияНастроек; // Соответствие Из Строка
	ВыгружатьЗаголовкиСообщения = КонфигЛога.ВыгружатьЗаголовкиСообщенияВходящих; // Булево
	ВыгружатьТелоСообщения = КонфигЛога.ВыгружатьТелоСообщенияВходящие; // Булево
	
	// Очистка очереди
	Очередь.Отбор.Сбросить();
	Очередь.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		ИмяРаздела = ИмяРазделаЛогирования(Префикс, Выборка.Консьюмер);
		
		Событие = Новый Соответствие; // Соответствие Из Произвольный
		Событие.Вставить("logger", ИмяРаздела);
		Событие.Вставить("id", КлючСобытияЛогирования(Выборка.КлючЗаписи, Выборка.ДатаЗагрузкиМС));
		Событие.Вставить("@timestamp", кфкОбщегоНазначенияСлужебный.ДатаМсВСтроку(Выборка.ДатаЗагрузкиМС));
		
		Событие.Вставить("consumer_id", XMLСтрока(Выборка.Консьюмер));
		Событие.Вставить("consumer_name", Представления.Получить(Выборка.Консьюмер));
		Событие.Вставить("topic", Выборка.Топик);
		Событие.Вставить("message_key", Выборка.КлючСообщения);
		Событие.Вставить("record_key", Выборка.КлючЗаписи);
		Событие.Вставить("load_date_ms", Выборка.ДатаЗагрузкиМС);
		Событие.Вставить("partition", Выборка.Раздел);
		Событие.Вставить("offset", Выборка.Смещение);
		Событие.Вставить("status", XMLСтрока(Выборка.Статус));
		
		ДобавитьДатуВЛог(Событие, Выборка.ДатаЗаписи, "write_date");
		ДобавитьДатуВЛог(Событие, Выборка.ДатаЗагрузки, "load_date");
		ДобавитьДатуВЛог(Событие, Выборка.ДатаОбработки, "processing_date");
		
		ДобавитьЗаголовкиСообщенияВЛог(Событие, Выборка.Заголовки, ВыгружатьЗаголовкиСообщения);
		ДобавитьТелоСообщенияВЛог(Событие, Выборка.ТелоСообщения, ВыгружатьТелоСообщения);
		
		Событие.Вставить("log_text", Выборка.ТекстЖурнала);
		Событие.Вставить("change_mark_ms", кфкОбщегоНазначенияСлужебный.ДатаМсВСтроку(Выборка.МеткаИзмененияМС));
		Событие.Вставить("processing_duration_ms", Выборка.ДлОбработкиМС);
		Событие.Вставить("processing_count", Выборка.КоличествоОбработок);
	
		События.Добавить(Событие);
		
		МеткаИзменения = Выборка.МеткаИзмененияМС;
		
		// Очистка очереди
		Если СтатусыКУдалению.Найти(Выборка.Статус) <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Очередь.Добавить(), Выборка, "КлючЗаписи,ДатаЗагрузкиМС");
		КонецЕсли;
		
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		
		ПозицииОт.ВременнаяМеткаВходящих = МеткаИзменения;
		ОбновитьПозицию(ИДОперации_ОтправкаЛоговВходящих(), МеткаИзменения);
		
		// Очистка очереди
		Если Очередь.Количество() > 0 Тогда
			Очередь.Записать(РежимЗамещения.Удаление);
		КонецЕсли;
		
		ОтправитьЛоги(КонфигЛога, События);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КонтрольИнтеграции

// Оповестить об ошибки.
// 
// Параметры:
//  ПараметрыКонтроля - Структура - Параметры контроля:
//   * ИдентификаторЧатаТГ - Строка - Идентификатор чата ТГ
//   * ТокенБотаТГ - Строка - Токен бота ТГ
//  ТекстСообщения - Строка - Текст сообщения в формате MD
Процедура ОповеститьОбОшибки(ПараметрыКонтроля, ТекстСообщения)
	
	Хост = "api.telegram.org";
	АдресЗапроса = СтрШаблон("/bot%1/sendMessage", ПараметрыКонтроля.ТокенБотаТГ);
	
	Тело = Новый Структура;
	Тело.Вставить("chat_id", ПараметрыКонтроля.ИдентификаторЧатаТГ);
	Тело.Вставить("text", ТекстСообщения);
	Тело.Вставить("parse_mode", "Markdown");
	СтрокаJSON = кфкОбщегоНазначенияСлужебный.ЗначениеВJSON(Тело); // Строка
	
	Соединение = Новый HTTPСоединение(Хост, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
	
	Запрос = Новый HTTPЗапрос(АдресЗапроса);
	Запрос.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	Если Не Ответ.КодСостояния = 200 Тогда
		ВызватьИсключение Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
КонецПроцедуры

// Оповестить об ошибки чтения.
// 
// Параметры:
//  Консьюмер - СправочникСсылка.кфкКонсьюмеры - Консьюмер
//  ТекстОшибки - Строка - Текст ошибки
Процедура ОповеститьОбОшибкиЧтения(Консьюмер, ТекстОшибки)
	
	Если Не ПолучитьФункциональнуюОпцию("кфкИспользоватьКонтрольИнтеграции") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКонтроля = РегистрыСведений.кфкПараметрыКонтроляИнтеграции.ПолучитьПараметры();
	Если ПустаяСтрока(ПараметрыКонтроля.ИдентификаторЧатаТГ) Или ПустаяСтрока(ПараметрыКонтроля.ТокенБотаТГ) Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru = '*📛 Ошибка чтения входящего потока*  
		 |🚨 **Критическая ошибка при чтении сообщений из очереди**  
		 |📍 **Компонент:** `%1`  
		 |💬 **Сообщение об ошибке:**  
		 |`%2`'");
	
	ТекстСообщения = СтрШаблон(ШаблонСообщения, Консьюмер, ТекстОшибки);
	ОповеститьОбОшибки(ПараметрыКонтроля, ТекстСообщения);
	
КонецПроцедуры

Функция КонтроляИнтеграцииПоказатели(Параметры)
	
	Результат = Новый Структура;
	
	Результат.Вставить("НарушенSLAИсходящих", 0);
	Результат.Вставить("НарушенSLAВходящих", 0);
	
	Результат.Вставить("ОшибкиИсходящих", 0);
	Результат.Вставить("ОшибкиВходящих", 0);
	
	Диапазон = ВыборкаКонтроляИнтеграцииДиапазонИзменений();
	РезультатЗапроса = РезультатЗапросаКонтроляИнтеграцииПоказатели(Параметры, Диапазон);
	
//	Обнаружены ошибки
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Значение = Выборка[0]; // Число
		Результат.ОшибкиИсходящих = Значение;
	КонецЕсли;
	Выборка = РезультатЗапроса[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Значение = Выборка[0]; // Число
		Результат.ОшибкиВходящих = Значение;
	КонецЕсли;
	
	// Нарушен SLA
	Выборка = РезультатЗапроса[2].Выбрать();
	Если Выборка.Следующий() Тогда
		Значение = Выборка[0]; // Число
		Результат.НарушенSLAИсходящих = Значение;
	КонецЕсли;
	Выборка = РезультатЗапроса[3].Выбрать();
	Если Выборка.Следующий() Тогда
		Значение = Выборка[0]; // Число
		Результат.НарушенSLAВходящих = Значение;
	КонецЕсли;
	
	ОбновитьПозицию(ИДОперации_КонтрольИнтеграцииИсходящих(), Диапазон.ИсхДо);
	ОбновитьПозицию(ИДОперации_КонтрольИнтеграцииВходящих(), Диапазон.ВхДо);
	
	Возврат Результат;
	
КонецФункции

// Выборка контроля интеграции диапазон изменений.
// 
// Возвращаемое значение:
//	Структура - Диапазон изменений:
//	 * ВхОт - Число - ВхОт
//	 * ВхДо - Число - ВхДо
//	 * ИсхОт - Число - ИсхОт
//	 * ИсхДо - Число - ИсхДо
Функция ВыборкаКонтроляИнтеграцииДиапазонИзменений()
	
	Результат = Новый Структура;
	Результат.Вставить("ИсхОт", 0);
	Результат.Вставить("ИсхДо", 0);
	
	Результат.Вставить("ВхОт", 0);
	Результат.Вставить("ВхДо", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(ПозицииОпераций.ВременнаяМеткаВходящих) КАК ВхОт,
	|	МАКСИМУМ(ПозицииОпераций.ВременнаяМеткаИсходящих) КАК ИсхОт
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПозицииОпераций.ВременнаяМетка КАК ВременнаяМеткаИсходящих,
	|		0 КАК ВременнаяМеткаВходящих
	|	ИЗ
	|		РегистрСведений.кфкПозицииОпераций КАК ПозицииОпераций
	|	ГДЕ
	|		ПозицииОпераций.Идентификатор = &ИдентификаторИсх
	|
	|	ОБЪЕДИНИТЬ
	|
	|	ВЫБРАТЬ
	|		0,
	|		ПозицииОпераций.ВременнаяМетка
	|	ИЗ
	|		РегистрСведений.кфкПозицииОпераций КАК ПозицииОпераций
	|	ГДЕ
	|		ПозицииОпераций.Идентификатор = &ИдентификаторВх) КАК ПозицииОпераций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИсходящиеСообщения.МеткаИзмененияМС) КАК ИсхДо
	|ИЗ
	|	РегистрСведений.кфкИсходящиеСообщения КАК ИсходящиеСообщения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВходящиеСообщения.МеткаИзмененияМС) КАК ВхДо
	|ИЗ
	|	РегистрСведений.кфкВходящиеСообщения КАК ВходящиеСообщения";
	Запрос.УстановитьПараметр("ИдентификаторИсх", ИДОперации_КонтрольИнтеграцииИсходящих());
	Запрос.УстановитьПараметр("ИдентификаторВх", ИДОперации_КонтрольИнтеграцииВходящих());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка, "ВхОт,ИсхОт");
	КонецЕсли;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка, "ИсхДо");
	КонецЕсли;
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка, "ВхДо");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Результат запроса контроля интеграции показатели.
// 
// Параметры:
//  Параметры - Структура - Параметры
//  Диапазон - Структура - Диапазон
// 
// Возвращаемое значение:
//  Массив Из РезультатЗапроса - Результат запроса контроля интеграции показатели
Функция РезультатЗапросаКонтроляИнтеграцииПоказатели(Параметры, Диапазон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	РегистрСведений.кфкИсходящиеСообщения КАК ИсходящиеСообщения
	|ГДЕ
	|	ИсходящиеСообщения.МеткаИзмененияМС > &МеткаИзмененияОтИсх
	|	И ИсходящиеСообщения.МеткаИзмененияМС <= &МеткаИзмененияДоИсх
	|	И ИсходящиеСообщения.Статус В (ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки),
	|		ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаВыгрузки))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	РегистрСведений.кфкВходящиеСообщения КАК ВходящиеСообщения
	|ГДЕ
	|	ВходящиеСообщения.МеткаИзмененияМС > &МеткаИзмененияОтВх
	|	И ВходящиеСообщения.МеткаИзмененияМС <= &МеткаИзмененияДоВх
	|	И ВходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Запрос.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(*) КАК Количество
	|	ИЗ
	|		РегистрСведений.кфкИсходящиеСообщения КАК ИсходящиеСообщения
	|	ГДЕ
	|		ИсходящиеСообщения.МеткаИзмененияМС > &МеткаИзмененияОтИсх
	|		И ИсходящиеСообщения.МеткаИзмененияМС <= &МеткаИзмененияДоИсх
	|		И ИсходящиеСообщения.ДатаРегистрацииМС < &ВремяSLAИсхМС
	|		И ИсходящиеСообщения.Статус В (ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое),
	|			ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Обработано))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		КОЛИЧЕСТВО(*)
	|	ИЗ
	|		РегистрСведений.кфкИсходящиеСообщения КАК ИсходящиеСообщения
	|	ГДЕ
	|		ИсходящиеСообщения.МеткаИзмененияМС > &МеткаИзмененияОтИсх
	|		И ИсходящиеСообщения.МеткаИзмененияМС <= &МеткаИзмененияДоИсх
	|		И РАЗНОСТЬДАТ(ИсходящиеСообщения.ДатаРегистрации, ИсходящиеСообщения.ДатаВыгрузки, МИНУТА) > &ВремяSLAИсх
	|		И ИсходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Выгружено)) КАК Запрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Запрос.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(*) КАК Количество
	|	ИЗ
	|		РегистрСведений.кфкВходящиеСообщения КАК ВходящиеСообщения
	|	ГДЕ
	|		ВходящиеСообщения.МеткаИзмененияМС > &МеткаИзмененияОтВх
	|		И ВходящиеСообщения.МеткаИзмененияМС <= &МеткаИзмененияДоВх
	|		И ВходящиеСообщения.ДатаЗагрузкиМС < &ВремяSLAВхМС
	|		И ВходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		КОЛИЧЕСТВО(*)
	|	ИЗ
	|		РегистрСведений.кфкВходящиеСообщения КАК ВходящиеСообщения
	|	ГДЕ
	|		ВходящиеСообщения.МеткаИзмененияМС > &МеткаИзмененияОтВх
	|		И ВходящиеСообщения.МеткаИзмененияМС <= &МеткаИзмененияДоИсх
	|		И РАЗНОСТЬДАТ(ВходящиеСообщения.ДатаЗагрузки, ВходящиеСообщения.ДатаОбработки, МИНУТА) > &ВремяSLAВх
	|		И ВходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Обработано)) КАК Запрос";
	
	Запрос.УстановитьПараметр("ВремяSLAВх", Параметры.ВремяSLAВходящих);
	Запрос.УстановитьПараметр("ВремяSLAВхМС", Параметры.ВремяSLAВходящих * 60000);
	Запрос.УстановитьПараметр("ВремяSLAИсх", Параметры.ВремяSLAИсходящих);
	Запрос.УстановитьПараметр("ВремяSLAИсхМС", Параметры.ВремяSLAИсходящих * 60000);
	
	Запрос.УстановитьПараметр("МеткаИзмененияОтВх", Диапазон.ВхОт);
	Запрос.УстановитьПараметр("МеткаИзмененияДоВх", Диапазон.ВхДо);
	
	
	Запрос.УстановитьПараметр("МеткаИзмененияОтИсх", Диапазон.ИсхОт);
	Запрос.УстановитьПараметр("МеткаИзмененияДоИсх", Диапазон.ИсхДо);
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

#КонецОбласти

#Область Прочее

// Добавляет сообщение в журнал.
// 
// Параметры:
//  ТекстЖурнала - Строка - Текст журнала
//  ТекстСообщения - Строка - Новый текст сообщения
// 
// Возвращаемое значение:
//  Строка - Дополнить текст журнала
Функция ДополнитьТекстЖурнала(ТекстЖурнала, ТекстСообщения)
	
	Если ПустаяСтрока(ТекстЖурнала) Тогда
		Возврат ТекстСообщения;
		
	ИначеЕсли ПустаяСтрока(ТекстСообщения) Тогда
		Возврат ТекстЖурнала;
		
	Иначе
		Возврат СокрЛП(ТекстСообщения) + "
		|--------------------------------------------------
		|" + СокрЛП(ТекстЖурнала);
		
	КонецЕсли;
	
КонецФункции

// Очереди исходящих.
// 
// Возвращаемое значение:
//  Структура - Очереди исходящих:
// * Очередь - РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения - Исходящие сообщения
// * ОчередьПотока - РегистрСведенийНаборЗаписей.кфкОчередьПотоков - Очередь потоков
Функция ОчередиИсходящих()
	
	Результат = Новый Структура;
	Результат.Вставить("Очередь", кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкИсходящиеСообщения));
	Результат.Вставить("ОчередьПотока", кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкОчередьПотоков));
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

// Очереди входящих.
// 
// Возвращаемое значение:
//  Структура - Очереди исходящих:
// * Очередь - РегистрСведенийНаборЗаписей.кфкВходящиеСообщения - Входящие сообщения
// * ОчередьПотока - РегистрСведенийНаборЗаписей.кфкОчередьПотоков - Очередь потоков
Функция ОчередиВходящих()
	
	Результат = Новый Структура;
	Результат.Вставить("Очередь", кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкВходящиеСообщения));
	Результат.Вставить("ОчередьПотока", кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкОчередьПотоков));
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

// Новая очередь.
// 
// Параметры:
//	Очереди - Структура - Очереди, см. ОчередиИсходящих, ОчередиВходящих 
// 
// Возвращаемое значение:
//  РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения, РегистрСведенийНаборЗаписей.кфкВходящиеСообщения - Новая очередь
Функция НоваяОчередь(Очереди)
	
	Результат = Очереди.Очередь; // РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения, РегистрСведенийНаборЗаписей.кфкВходящиеСообщения
	Результат.Отбор.Сбросить();
	Результат.Очистить();
	
	Возврат Результат;
	
КонецФункции

// Новая очередь потока.
// 
// Параметры:
//  Очереди - Структура - Очереди, см. ОчередиИсходящих, ОчередиВходящих
// 
// Возвращаемое значение:
//  РегистрСведенийНаборЗаписей.кфкОчередьПотоков - Новая очередь потока
Функция НоваяОчередьПотока(Очереди)
	
	Результат = Очереди.ОчередьПотока; // РегистрСведенийНаборЗаписей.кфкОчередьПотоков
	Результат.Отбор.Сбросить();
	Результат.Очистить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
