#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание продюсера.
// 
// Параметры:
//  Продюсер - СправочникСсылка.кфкПродюсеры - Экземпляр продюсера
// 
// Возвращаемое значение:
//  Структура - Описание продюсера:
// * Ссылка - СправочникСсылка.кфкПродюсеры - Ссылка
// * Наименование - Строка - Наименование
// * АдресБрокера - Строка - Адрес брокера
// * РежимАсинх - Булево - Режим асинхронной отправки
// * ПараметрыПодключения - Соответствие Из Строка - Параметры подключения брокера и продюсера
Функция ОписаниеПродюсера(Продюсер) Экспорт
	
	Результат = НовоеОписаниеПродюсера();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПродюсеры.Ссылка,
	|	кфкПродюсеры.Наименование,
	|	кфкПродюсеры.Брокер,
	|	кфкПродюсеры.РежимАсинх
	|ИЗ
	|	Справочник.кфкПродюсеры КАК кфкПродюсеры
	|ГДЕ
	|	кфкПродюсеры.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	кфкПродюсерыПараметрыПродюсера.Ключ,
	|	кфкПродюсерыПараметрыПродюсера.Значение
	|ИЗ
	|	Справочник.кфкПродюсеры.ПараметрыПродюсера КАК кфкПродюсерыПараметрыПродюсера
	|ГДЕ
	|	кфкПродюсерыПараметрыПродюсера.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Продюсер);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	ВыборкаПараметры = РезультатЗапроса[1].Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДоступныеБрокеры = Справочники.кфкБрокеры.ДоступныеБрокеры();
		Брокер = ДоступныеБрокеры.Получить(Выборка.Брокер);
		Если Брокер = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗаполнитьЗначенияСвойств(Результат, Брокер, "АдресБрокера,ПараметрыПодключения");
		
		Пока ВыборкаПараметры.Следующий() Цикл
			Результат.ПараметрыПодключения.Вставить(ВыборкаПараметры.Ключ, ВыборкаПараметры.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

// Объекты метаданных участвующие в интеграции с Kafka/
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие Из Строка - Объекты интеграции
Функция ОбъектыИнтеграции() Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	кфкПродюсерыОбъектыМетаданных.Ссылка КАК Ссылка,
	|	кфкПродюсерыОбъектыМетаданных.ТипОбъект КАК ТипОбъект
	|ИЗ
	|	Справочник.кфкПродюсеры КАК кфкПродюсеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.кфкПродюсеры.ОбъектыМетаданных КАК кфкПродюсерыОбъектыМетаданных
	|		ПО кфкПродюсеры.Ссылка = кфкПродюсерыОбъектыМетаданных.Ссылка
	|ГДЕ
	|	кфкПродюсеры.ПометкаУдаления = ЛОЖЬ
	|	И кфкПродюсеры.БлокироватьРегистрацию = ЛОЖЬ
	|ИТОГИ
	|ПО
	|	ТипОбъект";
	ВыборкаОМ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОМ.Следующий() Цикл
		
		Продюсеры = кфкОбщегоНазначенияСлужебный.ВыбратьКолонку(ВыборкаОМ.Выбрать(), "Ссылка"); // Массив Из СправочникСсылка.кфкПродюсеры
		Результат.Вставить(ВыборкаОМ.ТипОбъект, Новый ФиксированныйМассив(Продюсеры));
		
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Возвращает правила сериализации для указанных продюсеров.
//
// Параметры:
//	Продюсеры - Массив Из СправочникСсылка.кфкПродюсеры - список ссылок на продюсеров
//
// Возвращаемое значение:
//	Соответствие Из Строка - словарь сериализации:
//	 * Ключ - Строка - Продюсер + ТипОбъект
//	 * Значение - Структура - Описание сериализации, см. кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена
Функция ПравилаСериализации(Продюсеры) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПродюсерыОбъектыМетаданных.Ссылка КАК Ссылка,
	|	кфкПродюсерыОбъектыМетаданных.ТипОбъект КАК ТипОбъект,
	|	кфкПродюсерыОбъектыМетаданных.ТипСериализации КАК Тип,
	|	кфкПродюсерыОбъектыМетаданных.ИмяМетодаСериализации КАК ИмяМетода,
	|	кфкПродюсерыОбъектыМетаданных.ИмяМодуляСериализации КАК ИмяМодуля,
	|	кфкПродюсерыОбъектыМетаданных.ИмяПОДСериализации КАК ИмяПОД,
	|	кфкПродюсерыОбъектыМетаданных.ФорматСериализации КАК Формат
	|ИЗ
	|	Справочник.кфкПродюсеры.ОбъектыМетаданных КАК кфкПродюсерыОбъектыМетаданных
	|ГДЕ
	|	кфкПродюсерыОбъектыМетаданных.Ссылка В (&Продюсеры)";
	Запрос.УстановитьПараметр("Продюсеры", Продюсеры);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Описание = кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена();
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
		
		// TODO: КД - Обратная совместимость
		Если Описание.Тип.Пустая() И Не ПустаяСтрока(Описание.ИмяМетода)
				И ПустаяСтрока(Описание.ИмяМодуля + Описание.ИмяПОД + Описание.Формат) Тогда
			Описание.Тип = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
		КонецЕсли;
		
		Результат.Вставить(НРег(XMLСтрока(Выборка.Ссылка) + Выборка.ТипОбъект), Описание);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает топики для указанных продюсеров.
//
// Параметры:
//	Продюсеры - Массив Из СправочникСсылка.кфкПродюсеры - список ссылок на продюсеров
//
// Возвращаемое значение:
//	Соответствие Из Строка - словарь, где ключ - строка, объединяющая ссылку на продюсер и тип объекта, а значение - имя топика
Функция Топики(Продюсеры) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПродюсерыОбъектыМетаданных.Ссылка КАК Ссылка,
	|	кфкПродюсерыОбъектыМетаданных.ТипОбъект КАК ТипОбъект,
	|	кфкПродюсерыОбъектыМетаданных.ИмяТопика КАК ИмяТопика
	|ИЗ
	|	Справочник.кфкПродюсеры.ОбъектыМетаданных КАК кфкПродюсерыОбъектыМетаданных
	|ГДЕ
	|	кфкПродюсерыОбъектыМетаданных.Ссылка В (&Продюсеры)";
	Запрос.УстановитьПараметр("Продюсеры", Продюсеры);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(НРег(XMLСтрока(Выборка.Ссылка) + Выборка.ТипОбъект), Выборка.ИмяТопика);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовоеОписаниеПродюсера()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", ПустаяСсылка());
	Результат.Вставить("Наименование", "");
	Результат.Вставить("АдресБрокера", "");
	Результат.Вставить("РежимАсинх", Ложь);
	Результат.Вставить("ПараметрыПодключения", Новый Соответствие);
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли