// @strict-types

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Элементы.ФормаОбработатьСообщение.Доступность = Элемент.ВыделенныеСтроки.Количество() = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВернутьВОчередь(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Сбрасывается статус ошибки…'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ВернутьВОчередьНаСервере(ВыделенныеСтроки),
		Новый ОписаниеОповещения("ВернутьВОчередьЗавершить", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбработкаДоступна() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучнойОбработки();
		Возврат;
	КонецЕсли;
	
	ОбработатьСообщениеНаСервере(ВыделенныеСтроки[0]);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вернуть в очередь завершить.
// 
// Параметры:
//	Результат - Структура - Результат:
//		* Статус - Строка - Статус
//		* ИнформацияОбОшибке - ИнформацияОбОшибке - Информация об ошибке
//		* ПодробноеПредставлениеОшибки - Строка - Подробное представление ошибки
//		* КраткоеПредставлениеОшибки - Строка - Краткое представление ошибки
//	ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ВернутьВОчередьЗавершить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить проверку подключения к брокеру.'"));
		КонецЕсли;
		
		Возврат;
		 
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьВОчередьНаСервере(Знач КлючиЗаписей)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Сброс статус ошибки (Kafka)'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"РегистрыСведений.кфкИсходящиеСообщения.СброситьСтатусОшибки",
		КлючиЗаписей);

КонецФункции

&НаСервереБезКонтекста
Функция ОбработкаДоступна()
	Возврат (ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции")
				Или Не кфкФоновыеОперацииСлужебный.РегламентноеЗадание().Использование)
			И кфкФоновыеОперацииСлужебный.ПолучитьПотоки(СостояниеФоновогоЗадания.Активно).Количество() = 0;
КонецФункции

&НаСервере
Процедура ОбработатьСообщениеНаСервере(Сообщение)
	
	кфкФоновыеОперацииСлужебный.СериализацияСообщения(Сообщение);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти