// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Объекты интеграции.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие - Объекты интеграции
//@skip-check doc-comment-collection-item-type
Функция ОбъектыИнтеграции() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Справочники.кфкПродюсеры.ОбъектыИнтеграции();
	
КонецФункции

// Параметры логирования компоненты.
// 
// Возвращаемое значение:
//  Структура - Параметры логирования компоненты:
// * КаталогЛогов - Строка - Каталог логов
// * ФорматИмениФайлов - Строка - Формат имени файлов
Функция ПараметрыЛогированияКомпоненты() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КаталогЛогов", Строка(Константы.кфкКаталогЛогированияКомпоненты.Получить()));
	Результат.Вставить("ФорматИмениФайлов", Строка(Константы.кфкФорматИмениФайловЛогированияКомпоненты.Получить()));
	
	Возврат Результат;
	
КонецФункции

// Версия компоненты.
// 
// Возвращаемое значение:
//  Строка - Версия компоненты
Функция ВерсияКомпоненты() Экспорт
	Возврат Обработки.кфкИнтеграция.Создать().ВерсияКомпоненты();
КонецФункции

// Свойства конфигурации librdkafka.
// 
// Параметры:
//	Раздел - Строка - C = Консюмер, P = Продюсер, * = Общий
// 
// Возвращаемое значение:
//	ФиксированноеСоответствие Из ФиксированнаяСтруктура - Свойства конфигурации:
//	* Ключ - Строка - Имя свойства
//	* Значение - ФиксированнаяСтруктура - Свойства, см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka:
//		** ДоступныеЗначения - Строка, ФиксированныйМассив Из Строка - Доступные строковые значения
//		** ДоступныеЗначенияОт - Число - Доступные число 'ОТ'
//		** ДоступныеЗначенияДо - Число - Доступные число 'ДО'
//		** ЗначениеПоУмолчанию - Строка, Число - Значение по умолчанию
//		** ЗначениеПоУмолчаниюСтрокой - Строка - Значение по умолчанию строкой
//		** ТипЗначения - Строка - Тип значения: string, bool, float, int, enum, list|string 
//		** Важность - Число - Важность, 1 - Низкая, 2 - Средняя, 3 - Высокая
//		** БыстрыйДоступ - Булево - Быстрый доступ
//		** Описание - Строка - Описание
Функция СвойстваLibrdKafka(Раздел) Экспорт
	
	Если Не (Раздел = "*" Или Раздел = "C" Или Раздел = "P") Тогда
		ВызватьИсключение НСтр("ru = 'Недопустимое значение раздела'");
	КонецЕсли;
	
	Результат = Новый Соответствие;
	
	Макет = ПолучитьОбщийМакет("кфкСвойстваLibrdKafka");
	Область = Макет.Область(1, 1, Макет.ВысотаТаблицы, Макет.ШиринаТаблицы);
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Область);
	Построитель.Выполнить();
	
	Выборка = Построитель.Результат.Выбрать();
	//@skip-check property-return-type
	//@skip-check statement-type-change
	//@skip-check invocation-parameter-type-intersect
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Раздел <> Раздел Тогда
			Продолжить;
		КонецЕсли;
		
		Свойство = кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka();
		Свойство.ТипЗначения = Выборка.Тип;
		Свойство.ЗначениеПоУмолчаниюСтрокой = Выборка.ПоУмолчанию;
		Свойство.Важность = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Выборка.Важность);
		Свойство.БыстрыйДоступ = Выборка.БыстрыйДоступ = "1";
		Свойство.Описание = Выборка.Описание;
		
		Если Свойство.ТипЗначения = "string" Или Свойство.ТипЗначения = "bool"	
				Или Свойство.ТипЗначения = "enum" Или Свойство.ТипЗначения = "list|string" Тогда
			Свойство.ДоступныеЗначения = Новый ФиксированныйМассив(СтрРазделить(Выборка.Значения, ",", Ложь));
			Свойство.ЗначениеПоУмолчанию = Выборка.ПоУмолчанию; // bool: Булево(Выборка.ПоУмолчанию);
			
		ИначеЕсли Свойство.ТипЗначения = "int" Или Свойство.ТипЗначения = "float" Тогда
			Свойство.ДоступныеЗначенияОт = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Выборка.ОТ);
			Свойство.ДоступныеЗначенияДо = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Выборка.ДО);
			Свойство.ЗначениеПоУмолчанию = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Выборка.ПоУмолчанию);
			
		КонецЕсли;
		
		Результат.Вставить(Выборка.Свойство, Новый ФиксированнаяСтруктура(Свойство));
		
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Возвращает массив имен общих модулей.
//
// Возвращаемое значение:
//   ФиксированныйМассив Из Строка - Массив строк с именами общих модулей.
Функция ПолучитьИменаОбщихМодулей() Экспорт
	
	Результат = Новый Массив; // Массив Из Строка
	
	НеИспользоватьПовтИсп = Метаданные.СвойстваОбъектов.ПовторноеИспользованиеВозвращаемыхЗначений.НеИспользовать;
	
	Для Каждого Модуль Из Метаданные.ОбщиеМодули Цикл
		Если Модуль.Сервер И Не Модуль.КлиентУправляемоеПриложение 
			И Модуль.ПовторноеИспользованиеВозвращаемыхЗначений = НеИспользоватьПовтИсп Тогда
			
			Попытка
				ВерсияМенеджера = ОбщегоНазначения.ВызватьФункциюКонфигурации(Модуль.Имя + ".ВерсияФорматаМенеджераОбмена"); // Строка
			Исключение
				Продолжить;
			КонецПопытки;
			
			Если ВерсияМенеджера = "2" Или ВерсияМенеджера = "2.КФК" Тогда
				Результат.Добавить(Модуль.Имя);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

#КонецОбласти
