///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	кфкИспользоватьИнтеграцию.Значение КАК ИспользоватьИнтеграцию,
		|	кфкБлокировкаИнтеграции.Значение КАК БлокировкаИнтеграции
		|ИЗ
		|	Константа.кфкИспользоватьИнтеграцию КАК кфкИспользоватьИнтеграцию,
		|	Константа.кфкБлокировкаИнтеграции КАК кфкБлокировкаИнтеграции";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ИспользоватьРегламентноеЗадание = кфкФоновыеОперацииСлужебный.РегламентноеЗадание().Использование;
	
	ВерсияПодсистемы = кфкОбщегоНазначенияСлужебный.ВерсияПодсистемы();
	ВерсияКомпоненты = кфкИнтеграцияСлужебныйПовтИсп.ВерсияКомпоненты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
	Если Не ПустаяСтрока(Параметры.ИмяСтраницы) Тогда
		ПодключитьОбработчикОжидания("ПерейтиНаСтраницуПриОткрытии", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Навигация

&НаКлиенте
Процедура ПерейтиФоновыеЗадания(Команда)
	ОткрытьСтраницу("ФоновыеЗадания");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиРегламентноеЗадание(Команда)
	ОткрытьСтраницу("РегламентноеЗадание");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиОчереди(Команда)
	ОткрытьСтраницу("Очереди");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиЛогирование(Команда)
	ОткрытьСтраницу("Логирование");
КонецПроцедуры

#КонецОбласти

#Область УправлениеПодсистемой

&НаКлиенте
Процедура ВключитьПодсистему(Команда)
	
	ИспользоватьИнтеграцию = Истина;
	ВключитьПодсистемуНаСервере();
	
	УстановитьВидимостьДоступность();
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыключитьПодсистему(Команда)
	
	ЗаголовокВопроса = НСтр("ru = 'Полная остановка обмена с Kafka и регистрации данных'");
	ТекстВопроса = НСтр("ru = 'Вы отключаете обработку сообщений Kafka и регистрацию данных в системе.
		|Это может привести к рассинхронизации данных при последующей интеграции.
		|Продолжить выполнение?'");
	Кнопки = Новый СписокЗначений; // СписокЗначений Из КодВозвратаДиалога
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
	Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Отмена'"));
	Ответ = Ждать ВопросАсинх(ТекстВопроса, Кнопки, 60, КодВозвратаДиалога.Нет, ЗаголовокВопроса, КодВозвратаДиалога.Нет); // КодВозвратаДиалога
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьИнтеграцию = Ложь;
	БлокировкаИнтеграции = Истина;
	ВыключитьПодсистемуНаСервере();
	
	УстановитьВидимостьДоступность();
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаПодключения

&НаКлиенте
Процедура Брокеры(Команда)
	
	ОткрытьФорму("Справочник.кфкБрокеры.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Продюсеры(Команда)
	
	ОткрытьФорму("Справочник.кфкПродюсеры.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Консьюмеры(Команда)
	
	ОткрытьФорму("Справочник.кфкКонсьюмеры.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОчередиСообщений

&НаКлиенте
Процедура РСИсходящиеСообщения(Команда)
	
	ОткрытьФорму("РегистрСведений.кфкИсходящиеСообщения.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РСВходящиеСообщения(Команда)
	
	ОткрытьФорму("РегистрСведений.кфкВходящиеСообщения.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРегистрацияИзменений(Команда)
	
	ОткрытьФорму("Обработка.кфкРегистрацияИзменений.Форма", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность() Экспорт
	
	// ОБЩИЙ ДОСТУП
	Элементы.ВключитьПодсистему.Видимость = Не ИспользоватьИнтеграцию;
	Элементы.ВыключитьПодсистему.Видимость = ИспользоватьИнтеграцию;
	Элементы.КомандыПерейти.Доступность = ИспользоватьИнтеграцию;
	Элементы.ГруппаПанельОсновное.Доступность = ИспользоватьИнтеграцию;
	
	// НАВИГАЦИЯ
	Картинка = ?(БлокировкаИнтеграции, БиблиотекаКартинок.кфкЗаблокироватьПотоки16, БиблиотекаКартинок.кфкРазблокироватьПотоки16х16);
	Элементы.ПерейтиФоновыеЗадания.Картинка = Картинка;
	Элементы.ПерейтиФоновыеЗаданияИзОсновной.Картинка = Картинка;
	
	Картинка = ?(ИспользоватьРегламентноеЗадание, БиблиотекаКартинок.кфкЗапуск16, БиблиотекаКартинок.кфкПауза16);
	Элементы.ПерейтиРегламентноеЗадание.Картинка = Картинка;
	Элементы.ПерейтиРегламентноеЗаданиеИзОсновной.Картинка = Картинка;
	
КонецПроцедуры

#Область Навигация

&НаКлиенте
Процедура ПерейтиНаСтраницуПриОткрытии()
	
	Если Не ПустаяСтрока(Параметры.ИмяСтраницы) Тогда
		ОткрытьСтраницу(Параметры.ИмяСтраницы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницу(ИмяСтраницы)
	
	ОткрытьФорму("Обработка.кфкПанельАдминистрирования.Форма." + ИмяСтраницы, , ЭтотОбъект, , Окно);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеПодсистемой

&НаСервереБезКонтекста
Процедура ВключитьПодсистемуНаСервере()
	
	Константы.кфкИспользоватьИнтеграцию.Установить(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыключитьПодсистемуНаСервере()
	
	Константы.кфкИспользоватьИнтеграцию.Установить(Ложь);
	Константы.кфкБлокировкаИнтеграции.Установить(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
