#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Поле = Список.Поля.Найти(Новый ПолеКомпоновкиДанных("Операция"));
	Если Поле <> Неопределено Тогда
		Поле.УстановитьДоступныеЗначения(кфкФоновыеОперацииСлужебный.ПредставленияИдентификатораОпераций());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти
