///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Сбросить статус ошибки.
// 
// Параметры:
//  КлючиЗаписей - Массив Из РегистрСведенийКлючЗаписи.кфкИсходящиеСообщения - Ключи записей
Процедура СброситьСтатусОшибки(КлючиЗаписей) Экспорт
	
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкИсходящиеСообщения); // РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения
	
	//@skip-check invocation-parameter-type-intersect
	Таблица = Очередь.Выгрузить(, "КлючЗаписи,ДатаРегистрацииМС");
	
	Для Каждого КлючЗаписей Из КлючиЗаписей Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), КлючЗаписей);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.ДатаРегистрацииМС КАК ДатаРегистрацииМС
	|ПОМЕСТИТЬ ВТКлючиЗаписей
	|ИЗ
	|	&Таблица КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходящиеСообщения.КлючЗаписи КАК КлючЗаписи,
	|	ИсходящиеСообщения.ДатаРегистрацииМС КАК ДатаРегистрацииМС,
	|	ВЫБОР
	|		КОГДА ИсходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое)
	|		КОГДА ИсходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаВыгрузки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Обработано)
	|	КОНЕЦ КАК Статус,
	|	ИсходящиеСообщения.ИсходныеДанные КАК ИсходныеДанные,
	|	ИсходящиеСообщения.ЭтоУдаление КАК ЭтоУдаление,
	|	ИсходящиеСообщения.КлючСообщения КАК КлючСообщения,
	|	ИсходящиеСообщения.Заголовки КАК Заголовки,
	|	ИсходящиеСообщения.ТелоСообщения КАК ТелоСообщения,
	|	ИсходящиеСообщения.Продюсер КАК Продюсер,
	|	ИсходящиеСообщения.ТипОбъект КАК ТипОбъект,
	|	ИсходящиеСообщения.ТипИсходныхДанных КАК ТипИсходныхДанных,
	|	ИсходящиеСообщения.КлючОбъекта КАК КлючОбъекта,
	|	ИсходящиеСообщения.СобытиеРегистрации КАК СобытиеРегистрации,
	|	ИсходящиеСообщения.ДатаРегистрации КАК ДатаРегистрации,
	|	ИсходящиеСообщения.ДатаОбработки КАК ДатаОбработки,
	|	ИсходящиеСообщения.ДлОбработкиМС КАК ДлОбработкиМС,
	|	ИсходящиеСообщения.ДатаВыгрузки КАК ДатаВыгрузки,
	|	ИсходящиеСообщения.ТекстЖурнала КАК ТекстЖурнала,
	|	ИсходящиеСообщения.КоличествоОбработок КАК КоличествоОбработок,
	|	ИсходящиеСообщения.КоличествоВыгрузок КАК КоличествоВыгрузок
	|ИЗ
	|	ВТКлючиЗаписей КАК ВТКлючиЗаписей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.кфкИсходящиеСообщения КАК ИсходящиеСообщения
	|		ПО ВТКлючиЗаписей.КлючЗаписи = ИсходящиеСообщения.КлючЗаписи
	|		И ВТКлючиЗаписей.ДатаРегистрацииМС = ИсходящиеСообщения.ДатаРегистрацииМС
	|ГДЕ
	|	ИсходящиеСообщения.Статус В (ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки),
	|		ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаВыгрузки))";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Очередь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.МеткаИзмененияМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
	КонецЦикла;
	
	Очередь.Записать(РежимЗамещения.Обновление);
	
КонецПроцедуры

// Удалить сообщения.
// 
// Параметры:
//	КУдалению - Массив Из РегистрСведенийКлючЗаписи.кфкИсходящиеСообщения - Список ключей записи
//			  - Структура - Описание запроса:
//					* Текст - Строка - Текст запроса
//					* Параметры - Структура - Параметры запроса
Процедура УдалитьСообщения(КУдалению) Экспорт
	
	// Создаем набор записей
	Набор = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкИсходящиеСообщения);
	
	Если ТипЗнч(КУдалению) = Тип("Массив") Тогда // Если передан массив
		// Добавляем записи в набор
		Для Каждого Запись Из КУдалению Цикл
			ЗаполнитьЗначенияСвойств(Набор.Добавить(), Запись);
		КонецЦикла;
		// Удаляем записи из регистра
		Если Набор.Количество() > 0 Тогда
			Набор.Записать(РежимЗамещения.Удаление);
		КонецЕсли;
		
	Иначе
		// Создаем запрос
		Запрос = Новый Запрос;
		//@skip-check bsl-ql-hub
		Запрос.Текст = СтрЗаменить(КУдалению.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ 10000");
		Для Каждого Параметр Из КУдалению.Параметры Цикл
			Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		КонецЦикла;
		
		// Удаляем все записи из регистра по отбору
		Пока Истина Цикл
			// Выполняем запрос
			Выборка = Запрос.Выполнить().Выбрать();
			// Если записей нет, то завершаем цикл
			Если Выборка.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			// Добавляем записи в набор
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
			КонецЦикла;
			// Удаляем записи из регистра
			Набор.Записать(РежимЗамещения.Удаление);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьРегистр() Экспорт
	кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкИсходящиеСообщения).Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
