///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Текущее окно
	АктивноеОкно = АктивноеОкно();
	Если АктивноеОкно = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск данных
	НавигационнаяСсылка = НРег(АктивноеОкно.ПолучитьНавигационнуюСсылку());
	Если Не СтрНачинаетсяС(НавигационнаяСсылка, "e1cib/data/")
			И Не СтрНачинаетсяС(НавигационнаяСсылка, "e1cib/list/") Тогда
		Возврат;
	КонецЕсли;
	
	// Ожидаемый тип данных
	ПозицияНачалаИмениТипа = 12;
	ТипОбъекта = Сред(НавигационнаяСсылка, ПозицияНачалаИмениТипа,
		СтрНайти(НавигационнаяСсылка, "?") - ПозицияНачалаИмениТипа);
	// Проверка на участие в интеграции
	Если Не УчаствуетВИнтеграции(ТипОбъекта) Тогда
		Возврат;
	КонецЕсли;

	// Путь к данным
	ПутьКДанным = ?(СтрНайти(НавигационнаяСсылка, "/data/") > 0,
		"Параметры.Ключ", "Элементы.Список.ТекущаяСтрока");
	ИмяСвойства = СтрРазделить(ПутьКДанным, ".")[0];
	// Объект регистрации
	Данные = НайтиДанныеВФормах(АктивноеОкно, ПутьКДанным, ИмяСвойства, ТипОбъекта);
	// Поиск завершен, данные не найдены
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Открытие истории выгрузки
	кфкИнтеграцияКлиент.ИсторияВыгрузкиОбъекта(Данные, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция НайтиДанныеВФормах(АктивноеОкно, ПутьКДанным, ИмяСвойства, ТипОбъекта)

	// Поиск данных среди всех открытых форм текущего окна
	Для Каждого Форма Из АктивноеОкно.Содержимое Цикл
		// Проверка наличия реквизита
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяСвойства) Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			// Получение данных
			Данные = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ПутьКДанным);
			// Проверка типа данных
			Если ЗначениеЗаполнено(Данные) И ЭтоОжидаемыйТипДанных(ТипОбъекта, ТипЗнч(Данные)) Тогда
				Возврат Данные;
			КонецЕсли;

		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

&НаСервере
Функция УчаствуетВИнтеграции(Знач Ключ)
	Возврат кфкИнтеграцияСлужебныйПовтИсп.ИменаОбъектовИнтеграции().Найти(Ключ) <> Неопределено;
КонецФункции

&НаСервере
Функция ЭтоОжидаемыйТипДанных(Знач ТипОбъекта, Знач ТипДанных)
	Возврат ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ТипОбъекта) = Метаданные.НайтиПоТипу(ТипДанных);
КонецФункции

#КонецОбласти
