// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Текущее окно
	АктивноеОкно = АктивноеОкно();
	Если АктивноеОкно = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Объект регистрации
	Данные = Неопределено;
	
	// Поиск данных
	НавигационнаяСсылка = НРег(АктивноеОкно.ПолучитьНавигационнуюСсылку());
	Если СтрНачинаетсяС(НавигационнаяСсылка, "e1cib/data/") И СтрНайти(НавигационнаяСсылка, "?ref=") > 0 Тогда // Ссылка на объект информационной базы
		// Проверка на участие в интеграции
		ТипОбъекта = Сред(НавигационнаяСсылка, 12, СтрНайти(НавигационнаяСсылка, "?") - 12);
		Если Не УчаствуетВИнтеграции(ТипОбъекта) Тогда
			Возврат;
		КонецЕсли;
		
		// Получаем ссылку на объект
		Данные = СсылкаНаОбъект(ТипОбъекта, Прав(НавигационнаяСсылка, 32));
		
	ИначеЕсли СтрНачинаетсяС(НавигационнаяСсылка, "e1cib/data/регистрсведений.")
			Или СтрНачинаетсяС(НавигационнаяСсылка, "e1cib/data/informationregister.") Тогда
		// Проверка на участие в интеграции
		ТипОбъекта = Сред(НавигационнаяСсылка, 12, СтрНайти(НавигационнаяСсылка, "?") - 12);
		Если Не УчаствуетВИнтеграции(ТипОбъекта) Тогда
			Возврат;
		КонецЕсли;
		
		// Путь к данным
		ПутьКДанным = ?(ВариантВстроенногоЯзыкаРусский(), "Запись.ИсходныйКлючЗаписи", "Record.SourceRecordKey");
		
		// Поиск ключа записи РС ожидаемого типа
		Данные = ДанныеИзОкна(АктивноеОкно, ТипОбъекта, ПутьКДанным);
		
	ИначеЕсли СтрНачинаетсяС(НавигационнаяСсылка, "e1cib/list/") Тогда // Ссылка на список информационной базы
		// Проверка на участие в интеграции
		ТипОбъекта = СтрЗаменить(НавигационнаяСсылка, "e1cib/list/", "");
		Если Не УчаствуетВИнтеграции(ТипОбъекта) Тогда
			Возврат;
		КонецЕсли;
		
		// Путь к данным
		ПутьКДанным = ?(ВариантВстроенногоЯзыкаРусский(), "Элементы.Список.ТекущаяСтрока", "Items.List.CurrentRow");
		
		// Поиск Ссылки на объект или ключа записи РС ожидаемого типа
		Данные = ДанныеИзОкна(АктивноеОкно, ТипОбъекта, ПутьКДанным);
		
	Иначе
		Возврат;
		
	КонецЕсли;
	
	// Поиск завершен, данные не найдены
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Открытие истории выгрузки
	кфкИнтеграцияКлиент.ИсторияВыгрузкиОбъекта(Данные, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УчаствуетВИнтеграции(Ключ)
	Возврат кфкИнтеграцияСлужебныйПовтИсп.ОбъектыИнтеграции().Получить(Ключ) <> Неопределено;
КонецФункции

&НаСервере
Функция СсылкаНаОбъект(ТипОбъекта, ИнверсныйГУИД)
	
	// Менеджер объекта
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ТипОбъекта); // СправочникМенеджер
	
	// Получение идентификатора из ссылки
	Идентификатор = Сред(ИнверсныйГУИД, 25, 8) + "-" + Сред(ИнверсныйГУИД, 21, 4) + "-" + Сред(ИнверсныйГУИД, 17, 4)
		+ "-" + Сред(ИнверсныйГУИД, 1, 4) + "-" + Сред(ИнверсныйГУИД, 5, 12);
	
	// Проверка, что полученный идентификатор соответствует шаблону
	Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Получение ссылки по идентификатору
	Результат = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	
	// Проверка, что ссылка существует
	Если Не ОбщегоНазначения.СсылкаСуществует(Результат) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Возвращаем ссылку
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДанныеИзОкна(Окно, ТипОбъекта, ПутьКДанным)
	
	Результат = Неопределено;
	
	ИмяСвойства = СтрРазделить(ПутьКДанным, ".")[0];
	
	// Поиск данных
	Для Каждого Форма Из Окно.Содержимое Цикл
		
		// Проверка наличия реквизита
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			// Получение данных
			Результат = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ПутьКДанным);
			
			// Проверка типа данных
			Если ЭтоОжидаемыйТипДанных(ТипОбъекта, ТипЗнч(Результат)) Тогда
				Прервать;
			КонецЕсли;
			
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВариантВстроенногоЯзыкаРусский()
	Возврат (Метаданные.ВариантВстроенногоЯзыка = Метаданные.СвойстваОбъектов.ВариантВстроенногоЯзыка.Русский);
КонецФункции

&НаСервере
Функция ЭтоОжидаемыйТипДанных(ТипОбъекта, ТипДанных)
	Возврат ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ТипОбъекта) = Метаданные.НайтиПоТипу(ТипДанных);
КонецФункции

#КонецОбласти
