///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Текущее окно
	АктивноеОкно = АктивноеОкно();
	Если АктивноеОкно = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Объект регистрации
	Данные = Неопределено;
	
	// Поиск данных
	НавигационнаяСсылка = НРег(АктивноеОкно.ПолучитьНавигационнуюСсылку());
	Если СтрНачинаетсяС(НавигационнаяСсылка, "e1cib/data/") // Ссылка на объект информационной базы
			Или СтрНачинаетсяС(НавигационнаяСсылка, "e1cib/list/") Тогда // Ссылка на список информационной базы
		
		// Ожидаемый тип данных
		ТипОбъекта = Сред(НавигационнаяСсылка, 12, СтрНайти(НавигационнаяСсылка, "?") - 12);
		
		// Проверка на участие в интеграции
		Если Не УчаствуетВИнтеграции(ТипОбъекта) Тогда
			Возврат;
		КонецЕсли;
		
		// Путь к данным
		ПутьКДанным = ?(СтрНайти(НавигационнаяСсылка, "/data/") > 0, "Параметры.Ключ", "Элементы.Список.ТекущаяСтрока");
		ИмяСвойства = СтрРазделить(ПутьКДанным, ".")[0];
		
		// Поиск данных среди всех открытых форм текущего окна
		Для Каждого Форма Из АктивноеОкно.Содержимое Цикл
			
			// Проверка наличия реквизита
			Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяСвойства) Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				
				// Получение данных
				Данные = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ПутьКДанным);
				
				// Проверка типа данных
				Если ЗначениеЗаполнено(Данные) И ЭтоОжидаемыйТипДанных(ТипОбъекта, ТипЗнч(Данные)) Тогда
					Прервать;
				КонецЕсли;
				
			Исключение
				Продолжить;
			КонецПопытки;
			
		КонецЦикла;
		
	Иначе
		Возврат;
		
	КонецЕсли;
	
	// Поиск завершен, данные не найдены
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Открытие истории выгрузки
	кфкИнтеграцияКлиент.ИсторияВыгрузкиОбъекта(Данные, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УчаствуетВИнтеграции(Ключ)
	Возврат кфкИнтеграцияСлужебныйПовтИсп.ИменаОбъектовИнтеграции().Найти(Ключ) <> Неопределено;
КонецФункции

&НаСервере
Функция ЭтоОжидаемыйТипДанных(ТипОбъекта, ТипДанных)
	Возврат ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ТипОбъекта) = Метаданные.НайтиПоТипу(ТипДанных);
КонецФункции

#КонецОбласти
