///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийКлюч = Параметры.ТекущийКлюч;
	ВажностьНизкая = 1;
	ВажностьСредняя = 2;
	ВажностьВысокая = 3;

	Для Каждого Свойство Из Параметры.СвойстваLibrdKafka Цикл
		
		НоваяСтрока = Свойства.Добавить();
		НоваяСтрока.ИмяСвойства = Строка(Свойство.Ключ);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Свойство.Значение);
		
		НоваяСтрока.ДоступныеЗначенияПредставление = ?(НоваяСтрока.ДоступныеЗначения = Неопределено,
			СтрШаблон("%1 - %2", НоваяСтрока.ДоступныеЗначенияОт, НоваяСтрока.ДоступныеЗначенияДо),
			СтрСоединить(НоваяСтрока.ДоступныеЗначения, ","));
		
		Если НоваяСтрока.ИмяСвойства = ТекущийКлюч Тогда
			Элементы.Свойства.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
		Если НоваяСтрока.Важность = ВажностьНизкая Тогда
			НоваяСтрока.ВажностьПредставление = НСтр("ru = 'Низкая'");
		КонецЕсли;

		Если НоваяСтрока.Важность = ВажностьСредняя Тогда
			НоваяСтрока.ВажностьПредставление = НСтр("ru = 'Средняя'");
		КонецЕсли;

		Если НоваяСтрока.Важность = ВажностьВысокая Тогда
			НоваяСтрока.ВажностьПредставление = НСтр("ru = 'Высокая'");
		КонецЕсли;
		
	КонецЦикла;
	Свойства.Сортировать("ИмяСвойства");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВажностьПриИзменении(Элемент)
	
	Элементы.Свойства.ОтборСтрок = ?(Важность > 0, Новый ФиксированнаяСтруктура("Важность", Важность), Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвойства

&НаКлиенте
Процедура СвойстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Элемент.ТекущиеДанные.ИмяСвойства);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Элемент.ТекущиеДанные.ИмяСвойства);
	
КонецПроцедуры

#КонецОбласти
